const KaraniyaPali = `
<
1.

කරණීයමත්ථකුසලේන
යං තං සන්තං පදං අභිසමෙච්ච
සක්කෝ උජු ච සූජූ ච
සුවචෝ චස්ස මුදු අනතිමානී
>
<
2.

සන්තුස්සකෝ ච සුභරෝ ච
අප්පකිච්චෝ ච සල්ලහුකවුත්තී
සන්තින්ද්‍රියෝ ච නිපකෝ ච
අප්පගබ්භෝ කුලේසු අනනුගිද්ධෝ
>
<
3.

න ච ඛුද්දං සමාචරේ කිඤ්චි
යේන විඤ්ඤූ පරේ උපවදෙය්‍යුං
සුඛිනෝ වා ඛේමිනෝ හොන්තු
සබ්බේ සත්තා භවන්තු සුඛිතත්තා
>
<
4.

යේ කේචි පාණභුතත්ථි
තසා වා ථාවරා වා අනවසේසා
දීඝා වා යේ මහන්තා වා
මජ්ඣිමා රස්සකාණුකථූලා
>

<
5.

දිට්ඨා වා යේව අද්දිට්ඨා
යේ ච දූරේ වසන්ති අවිදූරේ
භූතා වා සම්භවේසීවා
සබ්බේ සත්තා භවන්තු සුඛිතත්තා
>
<
6.

න පරෝ පරං නිකුබ්බේථ
නාතිමඤ්ඤේථ කත්ථචි නං කඤ්චි
ඛ්‍යාරෝසනා පටිඝසඤ්ඤා
නාඤ්ඤමඤ්ඤස්ස දුක්ඛමිච්ඡෙය්‍ය

>
<
7.

මාතා යථා නියං පුත්තං
ආයුසා ඒකපුත්තමනුරක්ඛේ
ඒවම්පි සබ්බභූතේසු
මානසං භාවයේ අපරිමාණං

>
<

8.
මෙත්තං ච සබ්බ ලෝකස්මිං
මානසං භාවයේ අපරිමාණං
උද්ධං අධෝ ච තිරියඤ්ච
අසම්බාධං අවේරං අසපත්තං
>
<
9.

තිට්ඨං චරං නිසින්නෝ වා
සයානෝ වා යාවතස්ස විගතමිද්ධෝ
ඒතං සතිං අධිට්ඨෙය්‍ය
බ්‍රහ්මමේතං විහාරං ඉධමාහු
>
<
10.

දිට්ඨිං ච අනුපගම්ම සීලවා
දස්සනේන සම්පන්නෝ
කාමේසු විනෙය්‍ය ගේධං
නහි ජාතු ගබ්භසෙය්‍යං පුනරේතී ති
>
`;

export default KaraniyaPali;
