const KaraniyaSinhala = `
<
1.

ශාන්ත පදයයි කියනු ලබන නිවනට පැමිණ වසන්නහු විසින් යමක් කටයුතුද, දක්ෂයා විසින් එය කටයුතුයි. හෙතෙම දක්ෂයෙක් වන්නේය. සෘජු වන්නේය. මනාකොට සෘජු වන්නේය. කීකරු වන්නේය. මෘදු වන්නේය. නිහතමානි වන්නේය.
>
<
2.

ලද දෙයින් සතුටු වන්නේය. පහසුවෙන් පෝෂණය කළහැක්කේය. ස්වල්ප කටයුතු ඇත්තෙක් වන්නේය. සැහැල්ලු පැවතුම් ඇත්තෙක් වන්නේය.  ප්‍රගල්භය නැතිවන්නේය. කුලයන් කෙරෙහි නොඇලුනෙක් වන්නේය.

>
<
3.

යම් ක්‍රියාවකින් නුවණැති අන් කෙනෙක් නින්දා කෙරෙත්ද, (එබඳු) ස්වල්පවූ වරදකුදු නොකරන්නේය. සියලු සත්වයෝ සැප ඇත්තෝ වෙත්වා. භය නැත්තෝ වෙත්වා. සුඛිත සිත් ඇත්තෝ වෙත්වා.

>
<
4.

(කෙලෙස් සහිත බැවින්) භයින් ත්‍රස්ත වූ හෝ නිර්භය හෙයින් ස්ථාවර වූ සියලු යම්කිසි සත්ව කෙනෙක් වෙත්ද, යම් සත්ව කෙනෙක් දීර්ඝ ජාති ඇත්තාහුද, මහත් සිරුරු ඇත්තාහුද, මධ්‍යම ප්‍රමාණ සිරුරු ඇත්තෝද, මිටි සිරුරු ඇත්තෝද, ඉතා සියුම් සිරුරු ඇත්තෝද, ස්ථුල සිරුරු ඇත්තෝද, 

>
<
5.

ඇසට පෙනෙන්නාවූ හෝ නොපෙනෙන්නාවූ යම් සත්ව කෙනෙක් වෙත්ද, යම් සත්ව කෙනෙක් දුර වෙසෙත්ද, නුදුරෙහි වෙසෙත්ද, ඉපදීම අවසන් කළ සත්වයෝ වෙත්ද, ඉපදීම සොයන සත්වයෝද, යන සියලු සත්වයෝ සුඛිත සිත් ඇත්තෝ වෙත්වා.

>
<
6.

අනිකෙක් අනිකෙකු නොරවටනේය. කිසි තැනකහි ඒ කිසිවකුට අවමන් නොකරන්නේය. කාය වාක් විකාරයෙන් වූ කෝපයෙන්ද, මනෝ විකාරයෙන් වූ පටිඝ සංඥායෙන්ද, එකෙක් අනෙකකුට දුකක් නොකමැති වන්නේය.

>
<
7.

යම්සේ මවක් තම එකම පුතු දිවි පිදීමෙන් රකීද, හැම සතුන් කෙරෙහි අප්‍රමාණ වූ මෛත්‍රී සිත වඩන්නේය.

>
<
8.

උඩද, යටද, සිරසද, සම්බාධ නැතිව වෛර නැතිව සතුරන් නැති සියලු සත්වයන් කෙරෙහි අප්‍රමාණ වූ මෛත්‍රී සහගත සිත වඩන්නේය.

>
<
9.

සිටින්නේ හෝ, ඇවිදින්නේ හෝ, උන්නේ හෝ, නිදන්නේ හෝ, යම්තාක්කල් නොනිදා ද, ඒතාක් මේ මෛත්‍රී සහගත සිහිය ඉටන්නේය. මෙය මේ ශාසනයෙහි බ්‍රහ්ම විහාරයයි.

>
<
10.

මිථ්‍යාදෘෂ්ටියට නොපැමිණ සිල්වත් වූයේ, දර්ශනයෙන් යුක්ත වූයේ, වස්තුකාමයන්හි ගිජු බව දුරු කොට, ඒකාන්තයෙන් මවු කුස පිළිසිඳ ගැනිමට නැවත නො එන්නේය.

>
`;

export default KaraniyaSinhala;

