const MangalaPali = `
<
ඒවං මේ සුතං. ඒකං සමයං භගවා සාවත්ථියං විහරති ජේතවනේ අනාථපිණ්ඩිකස්ස ආරාමේ. අථ ඛෝ අඤ්ඤතරා දේවතා අභික්කන්තාය රත්තියා. අභික්කන්තවණ්ණා කේවලකප්පං ජේතවනං ඕභාසෙත්වා
යේන භගවා තේනුපසංකමී. උපසංකමිත්වා භගවන්තං අභිවාදෙත්වා ඒකමන්තං අට්ඨාසි. ඒකමන්තං ඨීතා ඛෝ සා දේවතා භගවන්තං ගාථාය අජ්ඣභාසි.
>

<
බහූදේවා මනුස්සා ච –
මංගලානි අචින්තයුං
ආකංඛමානා සොත්ථානං –
බ්‍රෑහි මංගලමුත්තමං
>

<
අසේවනා ච බාලානං –
පණ්ඩිතානඤ්ච සේවනා
පූජා ච පූජනීයානං –
ඒතං මංගලමුත්තමං
>

<
පතිරූපදේසවාසෝ ච –
පුබ්බේ ච කතපුඤ්ඤතා
අත්තසම්මාපණිධි ච –
ඒතං මංගලමුත්තමං
>

<
බාහුසච්චඤ්ච සිප්පඤ්ච –
විනයෝ ච සුසික්ඛිතෝ
සුභාසිතා ච යා වාචා –
ඒතං මංගලමුත්තමං
>

<
මාතාපිතු උපට්ඨානං –
පුත්තදාරස්ස සංගහෝ
අනාකුලා ච කම්මන්තා –
ඒතං මංගලමුත්තමං
>

<දානඤ්ච ධම්මචරියා ච – ඤාතකානඤ්ච සංගහෝ
අනවජ්ජානි කම්මානි – ඒතං මංගලමුත්තමං>

<
ආරති විරති පාපා – මජ්ජපානා ච සඤ්ඤමෝ
අප්පමාදෝ ච ධම්මේසු – ඒතං මංගලමුත්තමං
>

<
ගාරවෝ ච නිවාතෝ ච – සන්තුට්ඨී ච කතඤ්ඤුතා
කාලේන ධම්මසවණං – ඒතං මංගලමුත්තමං
>

<
ඛන්තී ච සෝවචස්සතා – සමණානඤ්ච දස්සනං
කාලේන ධර්මසාකච්ඡා – ඒතං මංගලමුත්තමං
>

<
තපෝ ච බ්‍රහ්මචරියඤ්ච – අරියසච්චානදස්සනං
නිබ්බාණසච්ඡිකිරියා ච – ඒතං මංගලමුත්තමං
>

<
ඵුට්ඨස්ස ලෝකධම්මේහි -
                        චිත්තං යස්ස න කම්පති
අසෝකං විරජං ඛේමං -
                                    ඒතං මංගලමුත්තමං
>

<
ඒතාදිසානි කත්වාන –
                            සබ්බත්ථ ම පරාජිතා
සබ්බත්ථ සොත්ථිං ගච්ඡ්න්ති තං –
                       තේසං මංගලමුත්තමන්ති
>

`;
export default MangalaPali;