const MangalaSinhala = `

<මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවත් බුදුරජාණන් වහන්සේ සැවැත් නුවර ජේතවන නම් වූ අනේපිඬු සිටුතුමා ගේ ආරාමයෙහි වැඩ වසන සේක. එකල්හී එක්තරා දෙවියෙක් මධ්‍යම රාත්‍රියෙහි මනස්කාන්ත පැහැයකින් යුතුව මුළු දෙව්රම බබුළුවා ගෙන භාග්‍යවතුන් වහන්සේ ළඟට පැමිණියේ ය. එසේ පැමිණ භාග්‍යවතුන් වහන්සේට ආදරයෙන් වන්දනා කොට එකත්පසව සිට ගත්තේ ය. එකත්පසව සිටි ඒ දෙවියා භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ පවසුවේ ය.>

<
බොහෝ දෙවි මිනිස්සු ද -
සිතුවෝ ය මංගල කරුණු ගැන
යහපන කැමති ඔවුනට -
උතුම් මංගල කරුණු ගැන
පහදා දෙන්න මුනිඳුනි.
>

<
නරක අය නොම ඇසුර ද –
කළණමිතුරන් සමඟ නිති ඇසුර ද
පිදිය යුත්තන් පිදුම ද –
මේවා උතුම් මංගල කරුණු ය
>

<
යහපත් තැනක විසුම ද –
පෙර කළ පින් තිබීම ද
තමා යහමඟ යාම ද –
මේවා උතුම් මංගල කරුණු ය
>

<
බොහෝ දැන උගත් බව –
නොයෙකුත් ශිල්ප දත් බව
විනයකින් යුතු බව –
මනා කොට හික්මුන බව
සුභාසිත වූ යම් බසක් වෙද –
මේවා උතුම් මංගල කරුණු ය

>

<
මව්පිය උපස්ථානය –
අඹුදරුවන්ට සැළකුම
මැනැවින් වැඩ කෙරුම –
මේවා උතුම් මංගල කරුණු ය

>

<
දන් පැන් පිදීම ද –
දහම තුළ හැසිරීම ද
නෑයන්ට සැළකීම ද –
නිවැරදි දේ කිරීම ද
මේවා උතුම් මංගල කරුණු ය

>

<
පවෙහි නො ඇලීම ද –
හැම පවින් වැළකීම ද
මත් පැනින් දුරු වීම ද –
දහම තුළ නො පමාව ද
මේවා උතුම් මංගල කරුණු ය

>

<
උතුමන්ට ගරු කිරීම ද –
නිහතමානී වීම ද
ලද දෙයින් තුටු වීම ද –
කෙළෙහි ගුණ සැලකීම ද
නිසි කලට බණ ඇසීම ද –
මේවා උතුම් මංගල කරුණු ය

>

<
ඉවසන ගුණයෙන් යුතු බව –
යහපතට අවනත බව
ශ්‍රමණවරු බැහැ දැකුම ද –
නිසි කල දම් සභාව ද
මේවා උතුම් මංගල කරුණු ය

>

<
තපසෙහි විසීම ද –
බඹසරෙහි හැසිරීම ද
ආර්ය සත්‍යයන් දැකීම ද –
නිවන අවබෝධ වීම ද
මේවා උතුම් මංගල කරුණු ය

>

<
අටලෝ දහම එන විට –
නො සැලේද යමෙකුගෙ සිත
සෝක නැති කෙලෙසුන් නැති –
බියක් නැති තැන සිටි විට
මේවා උතුම් මංගල කරුණු ය

>

<
මේ අයුරින් කටයුතු කොට –
අපරාජිත වී හැම තැන
යහපතට ම යති හැම තැන –
එය ඔවුන් හට උත්තම මංගල කරුණු ය.

>
`;
export default MangalaSinhala;

