const RathanaSinhala = `<
පොළොවෙහි වූ හෝ අහසෙහි වූ හෝ යම් අමනුෂ්‍ය කෙනෙක් මෙහි රැස්වූහුද, ඒ සියලු අමනුෂ්‍යයෝ ම සතුටු සිතැත්තෝ වෙත්වා, තවද මාගේ වචනය සකසා අසත්වා
>
<භූතයිනි, එබැවින් තෙපි සියල්ලෝ මාගේ වචනය අසවු, මනුෂ්‍ය ප්‍රජාවට මෛත්‍රිය කරවු. යම් කෙනෙක් දහවල් ද රෑ ද පුද පඬුරු එලවත්ද (පූජා කරත්ද), එහෙයින් නොපමාව ඔවුන් රකිවු.>

<මිනිස් ලොකය හෝ නාග ලෝකය ආදී අන් ලොවෙක යම් ධනයක් වේද, දෙව්ලොව හෝ මහඟු රුවනක් වේද, ඔවුන් අතුරෙහි තථාගතයන් හා සදෘශයෙක් (සමාන කළ හැක්කෙක්) නැත්තේමය. මේ කරුණින් ද බුදුරජහු උතුම් රුවනෙකි. මේ සත්‍ය බලයෙන් සෙත් වේවා>

<ශාක්‍යමුනි තෙම එකඟ වූ සිත් ඇත්තේ, කෙලෙස් නැසීමට නිමිති වූ රාගයෙන් වෙන්වීමට නිමිතිවූ මරණයක් නැති උතුම්වූ යම් නිවනක් පසක් කෙළේද, ඒ දහම් හා සම වූ කිසිවෙක් නැත්තේය. මේ කරුණින්ද නිවන් දහම උතුම් රුවනෙකි. මේ සත්‍යානුභාවයෙන් සෙත් වේවා.>

<බුද්ධ ශ්‍රෙෂ්ඨ තෙම අත්‍යන්ත පරිශුද්ධවූ යම් මාර්ග සමාධියක් වර්ණනා කෙළේද, බුද්ධාදීහු ආනන්තරික (අනතුරුවම ඵල දෙන) සමාධියයි යමකට කියත්ද, ඒ සමාධිය හා සමාන අන්‍ය සමාධියක් නැත. මේ කරුණින්ද ආර්ය මාරගය උතුම් රුවනෙකි. මේ සත්‍ය බලයෙන් සෙත් වේවා.>

<සත්පුරුෂයන් විසින් පසස්නා ලද යම් ආර්ය පුද්ගලයෝ අටදෙනෙක් වෙත්ද නොහොත් ප්‍රශස්ත වූ යම් එකසිය අටක් ආර්ය පුද්ගලයෝ වෙත්ද මොහු හැමදෙන යුගල වශයෙන් සතර දෙනෙකි (සෝවාන්, සකෘදාගාමි, අනාගාමී, අරහත්). සුගත් බුදුරදුන්ගේ සවු වූ ඔහු තුමු දක්ෂිණාවට සුදුස්සෝ වෙති. මේ බුදු සව්වන් කෙරෙහි දෙන ලද දානයෝ මහත් ඵල ඇත්තෝ වෙත් මේ කරුණින්ද බුද්ධ ශ්‍රාවක සංඝ තෙමේ උතුම් රුවනෙකි. මේ සත්‍ය බලයෙන් සෙත්වේවා.>

<ගෞතම බුද්ධ ශාසනයෙහි වූ සුවිශුද්ධ කායවාක් කර්ම සංඛ්‍යාත ශීලස්කන්ධයෙන් යුක්ත වූ ස්ථීර සිතින් යුක්තවූ ප්‍රඥාව කරණ කොටගෙන සියලු කෙලෙසුන්ගෙන් නික්මුණාවූ යම් පුද්ගලකෙනෙක් වෙත්ද, ඔහු තුමු නිවනට බැසගෙන නො මිලයේ ම  රහත්ඵල සමවත ලැබ ගෙන එය විඳිනනහු වෙති. මේ කරුණින්ද ආර්ය සංඝයා උතුම් රුවනෙකි. මේ සත්‍ය බලයෙන් සෙත් වේවා.>

<යම්සේ පොළොව තුළ වැද සිටි (සිටවූ) ඉන්ද්‍රඛීලය (ස්ථම්භය) සිවු දිගින් හමන සුළඟින් සෙලවිය හැකි නොවේද, ආර්ය සත්‍යයන් ප්‍රඥාවෙන් බැසගෙන දක්නා පුරුෂයා (සෝවාන් පුද්ගලයා) එබන්දකු කොට කියමි. මේ කරුණින්ද ආර්ය සංඝ තෙමෙ උතුම් රුවනෙකි. මේ සත්‍ය බලයෙන් සෙත් වේවා.>

<යම් සෝවාන් පුද්ගල කෙනෙක් ගැඹුරු නුවණැති බුදුරදුන් දෙසූ ආර්ය සත්‍යයන් තමනට ප්‍රකට කෙරෙත්ද, ඔහු බෙහෙවින් පමාවූවාහු නමුත් අටවන භවයක් නො ගනිති. මෙ කරුණින්ද ආර්ය සංඝ තෙමෙ උතුම් රුවනෙකි. මේ සත්‍ය බලයෙන් සෙත් වේවා.>

<මේ සෝවාන් පුද්ගලයා ගේ දර්ශන සම්පත්තිය හෙවත් සෝවාන් මග නුවණ පහළවීම සමගම සක්කාය දෘෂ්ටියද (බුද්ධාදී අටතන්හි) සැකයද යම් මිත්ථ්‍යාශීල ව්‍රත කෙනෙක්වූහුනම් ඒ සියල්ලද යන මේ තුන් සං‍යෝජනයෝ (සක්කායදිට්ඨි, විචිකිච්ඡා, සීලබ්බත පරමාස) දුරුකරණ ලද්දෝ වෙත් හෙතෙම සතර අපායෙන් (නිරය, තිරිසන් ලෝකය, ප්‍රේත ලෝකය, අසුර) කෙරෙන් මිදුනේද වේ. ආනන්තය්‍ය කර්ම පසත් (ආනන්තරීය පාපකර්ම 5 ත්) මිතථ්‍යාදෘෂ්ටියත් යන බැරෑරුම් පව් සය කරන්නටද හේ අභව්‍ය  (සිදු නොවේ) ය. මේ කරුණින්ද ආර්ය සංඝ තෙමෙ උතුම් රුවනෙකි. මේ සත්‍ය බලයෙන් සෙත් වේවා.>

<ඒ සෝවාන් පුද්ගල තෙම කයින් හෝ වචනයෙන් හෝ නැතහොත් සිතින් හෝ ප්‍රඥප්ති මාත්‍ර වූ කිසිවරදක් කරන්නේ නමුදු හේ එය සඟවන්නට නොහැක්කේය (සඟවන්නේ නැත). දක්නාලද නිර්වාන පදය ඇති සෝවාන් පුද්ගලයාගේ අවශ්‍ය බව (ඇවැත් දෙසා සංවරයේ පිහිටයි) බුදුරදුන් විසින් වදාරණ ලද්දේය. මේ කරුණින්ද ආර්ය සංඝ තෙමෙ උතුම් රුවනෙකි. මේ සත්‍ය බලයෙන් සෙත් වේවා.>

<වන ලැහැබ තෙමෙ ග්‍රීෂ්ම සෘතුවේ පළමුවන මාසයෙහි හෙවත් බක්මස සුපිපි අක් ඇත්තේ (මල් පිපෙන්නේ) යම්සේද, එසේ වූ නිවන්පුර පමුණුවන පර්ය්‍යාප්ති (වෙනස් නොවන) ධර්මරත්නය  පරමහිතාබ්‍ය (අන්යන්ගේ හිත සුව පිණිස) වූ නිවන් පිණිස ඒ බුදුරජ තෙමෙ දේශනා කළහ. මේ කරුණින්ද බුදුරජ තෙමෙ රුවනෙකි. මේ සත්‍ය බලයෙන් සෙත් වේවා.>

<උතුම් වූ නිවන දන්නාවූ, උතුම් වූ නිවන දෙන්නාවූ, උතුම් වූ නිවන් මග ගෙනහැර පාන්නාවූ, නිරුත්තරවූ බුදුරජාණන් වහන්සේ උතුම් වූ දහමක් දෙසූ සේක. මේ කරුණින්ද බුදුරජ තෙමේ උතුම් රුවනෙකි. මේ සත්‍ය බලයෙන් සෙත් වේවා.>

<යම් කෙනෙකුන්ගේ පුරාතන කර්ම රහත් මගින් ක්ෂීණ වූයේද අළුත් කර්මයන්ගේ පහළ විමෙකුත් නැද්ද, මතු භවයක් කෙරෙහි නොඇළුණු සිතැති, ක්ෂීණවූ ප්‍රතිසන්ධි විඥාන සංඛ්‍යාද බීජ ඇති, පුනර්භව සංඛ‍යාත සංස්කාර වෘද්ධිය කෙරෙහි කැමැත්තක් නැති, ධෛර්‍ය්‍ය සම්පන්නවූ ඒ රහත්හු මේ පහන මෙන් අවසන් සිත නිරුද්ධ වීමෙන් පිරිනිවෙත්. මේ සත්‍ය බලයෙන් සෙත් වේවා.>

<පොළොවෙහි හෝ අහසෙහි වූ යම් අමනුෂ්‍ය කෙනෙක් මෙ තන්හි රැස්වූහු ද, ඔහුද මමද දෙව් මිනිසුන් විසින් පුදන ලද තථාගත බුදුරජාණන් වහන්සේ නමඳිමු. සත්ව ප්‍රජාවට සෙත් වේවා.>

<පොළොවෙහි හෝ අහසෙහි වූ යම් අමනුෂ්‍ය කෙනෙක් මෙ තන්හි රැස්වූහු ද, ඔහුද මමද දෙව් මිනිසුන් විසින් පුදන ලද බුද්ධාදීන් විසින් අවබෝධ කරන ලද බැවින් තථාගත වූ ධර්මය නමඳිමු. සත්ව ප්‍රජාවට සෙත් වේවා>

<පොළොවෙහි හෝ අහසෙහි වූ යම් අමනුෂ්‍ය කෙනෙක් මෙ තන්හි රැස්වූහු ද, ඔහුද මමද දෙව් මිනිසුන් විසින් පුදන ලද තථාගත වූ සංඝයා නමඳිමු. සත්ව ප්‍රජාවට සෙත් වේවා.>

`;
export default RathanaSinhala;
