const BuddhaAndBodhiPali = `
<
1. නමස්කාරය
 
නමෝ තස්ස භගවතෝ අරහතෝ සම්මා සම්බුද්ධස්ස. 
නමෝ තස්ස භගවතෝ අරහතෝ සම්මා සම්බුද්ධස්ස.
නමෝ තස්ස භගවතෝ අරහතෝ සම්මා සම්බුද්ධස්ස.
>
<
2. තිසරණ සරණයාම
 
බුද්ධං සරණං ගච්චාමි
ධම්මං සරණං ගච්චාමි
සංඝං සරණං ගච්චාමි

දුතියම්පි බුද්ධං සරණං ගච්චාමි
දුතියම්පි ධම්මං සරණං ගච්චාමි
දුතියම්පි සංඝං සරණං ගච්චාමි

තතියම්පි බුද්ධං සරණං ගච්චාමි
තතියම්පි ධම්මං සරණං ගච්චාමි
තතියම්පි සංඝං සරණං ගච්චාමි
>
<
3. පංචශීලය සමාදන්වීම
 
පාණාතිපාතා වේරමණී සික්ඛාපදං සමාදියාමී
අදින්නාදානා වේරමණී සික්ඛාපදං සමාදියාමී
කාමේසු මිච්ඡාචාරා වේරමණී සික්ඛාපදං සමාදියාමී
මුසාවාදා වේරමණී සික්ඛාපදං සමාදියාමි
සුමාමේරය මජ්ජපමාදට්ඨානා වේරමණී සික්ඛාපදං සමාදියාමී
තිසරණේන සද්ධිං පංචසීලං සමාදියාමි
>
<
4. බුදු ගුණ සිහි කිරීම
 
ඉතිපි සෝ භගවා අරහං සම්මා සම්බුද්ධෝ
විඡ්ඡාචරණ සම්පන්නෝ සුගතෝ ලෝකවිදූ අනුත්තරෝ
පුරිසදම්මසාරථී සත්ථා දේවමනුස්සානං බුද්ධෝ භගවාතී
>
<
5. දහම් වැඳීම

ස්වාක්ඛාතෝ, භගවතා ධම්මෝ සන්දිට්ඨිකො, අකාලිකෝ,
ඒහිපස්සිකෝ, ඕපනයිකො, පච්චත්තං වේදිතබ්බො විඤ්ඤුහීති
>
<
6. සඟුන් වැඳීම

සුපටිපන්නෝ භගවතො සාවක සංඝෝ
උජුපටිපන්නෝ භගවතො සාවක සංඝෝ
ඤායපටිපන්නෝ භගවතො සාවක සංඝෝ
සාමීචිපටිපන්නෝ භගවතො සාවක සංඝෝ
යදිදං චත්තාරි පුරිස යුගානි අට්ඨපුරිස පුග්ගලා
ඒස භගවතෝ සාවක සංඝෝ
ආහුනෙයියෝ පාහුනෙයියෝ දක්ඛිනෙයියෝ
අඤ්ජලිකරණීයෝ අනුත්තරං පුඤ්ඤක්ඛෙත්තං
ලෝකස්සාති
>
<
7. චෛත්‍ය වන්දනාව

වන්දාමි චේතියං සබ්බං – සබ්බ ධානේසු පතිට්ඨිතං
සාරීරික ධාතු මහා බෝධිං –  බුද්ධ රූපං සකලං සදා
>
<
8. බෝධි වන්දනාව

යස්සමූලේ නිසින්නෝච – සබ්බාරි විජයං අකා
පත්තෝ සබ්බඤ්ඤුතං සත්ථා – වන්දේතංබෝධිපාදපං
>
<
ඉමේ ඒතේ මහාබෝධී – ලෝකනාථේන පූජිතා
අහංපි තේ නමස්සාමි – බෝධිරාජා නමත්ථු තෙ
>
<
ඉන්ද්‍රනීල වණ්ණ පත්ත සේත ඛන්ද භාසුරං
සත්ථු නෙත්ත පංකජාහි පූජිතග්ග සාතදං
අග්ග බෝධි නාම වාම දේවරුක්ඛ සණ්ණිභං
තං විසාල බෝදි පාදපං නමාමි සබ්බදා
>
<
9. බුද්ධ පූජා ආරාධනාව

නිවේදයාමි සම්බුද්ධං – වීතරාගං මහාමුනිං
නිමන්තයාමි සුගතං – ලෝකජෙට්ඨං නරාසභං
>
<
10. පහන් පූජාව

ඝනසාරප්ප දිත්තේන – දීපේන තමධංසිනා
තිලෝකදීපං සම්බුද්ධං – පූජයාමි තමෝනුදං
>
<
11. සුවඳ දුම් පූජාව

ගන්ධ සම්භාර යුත්තේන – ධුපේනාහං සුගන්ධිනා
සුගන්ධිනාහං ගන්ධේන – පූජයාමි තථාගතං
සුගන්ධිකාය වදනං – අනන්ත ගුණගන්ධිනා
සුගන්ධිනාහං ගන්ධේන – පූජයාමි තථාගතං
>
<
12. මල් පූජාව

වණ්ණ ගන්ධ ගුණෝපේතං – ඒතං කුසුම සන්තතිං
පූජයාමි මුනින්දස්ස – සිරීපාද සරෝරුහේ


පූජේමි බුද්ධං කුසුමේනනේන
පුඤ්ඤේනමේතේන ලභාමි මොක්ඛං
පුප්ඵං මිලායාති යථා ඉදම්මේ
කායෝ තථායාති විනාස භාවං
>
<
13. පැන් පූජාව

අධිවාසේතු නෝ භන්තේ – පානීයං පරිකප්පිතං
අනුකම්පං උපාදාය – පතිගණ්හාතු මුත්තමං
>
<
14. ආහාර පූජාව

අධිවාසේතු නෝ භන්තේ – භෝජනං උපනාමිතං
අනුකම්පං උපාදාය – පතිගණ්හාතු මුත්තමං
>
<
15. ගිලන්පස පූජාව

අධිවාසේතු නෝ භන්තේ – ගිලාන පච්චයං ඉමං
අනුකම්පං උපාදාය – පතිගණ්හාතු මුත්තමං
>
<
15. දැහැත් පූජාව

නාග වල්ලී දලූ පේතං – චුණ්ණ පූග සමායුතං
තාම්බූලං පතිගණ්හාතු – සතං පූජේමිදං පිනෝ
>
<
16. සියල්ල එකවිට පූජා කිරීම

අධිවාසේ තුනෝ භන්තේ – සබ්බං සද්ධාය පූජිතං
අනුකම්පං උපාදාය – පතිගණ්හාතු මුත්තමං
>
`;


export default BuddhaAndBodhiPali;