const ChakkawaththiSinhala = `

<
සක්විති රජු ගැන සිහනදක් ලෙසින් වදාළ දෙසු​ම
>

මා විසින් මෙසේ අසන ලදී. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ මගධ ජනපදයෙහි මාතුලා නුවර වැඩවසන සේක. එහිදී භාග්‍යවතුන් වහන්සේ “මහණෙනි” යි භික්ෂූන් ඇමතූ සේක. “පින්වතුන් වහන්සැ” යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිවදන් දුන්නාහු ය. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක.

“මහණෙනි, තමා දූපතක් බඳු කොට වාසය කරව්. තමා සරණට ගනිව්. අන් කෙනෙකු සරණට නොගනිව්. ධර්මය දූපතක් බඳු කොට වාසය කරව්. ධර්මය සරණට ගනිව්. අන් දෙයක් සරණට නොගනිව්.

මහණෙනි, භික්ෂුවක් තමා ව දූපතක් බඳු කොට, තමා සරණට ගෙන, අන් කෙනෙකු සරණට නොගෙන වාසය කරන්නේ කෙසේ ද? ධර්මය දූපතක් බඳු කොට, ධර්මය සරණට ගෙන, අන් දෙයක් සරණට නොගෙන වාසය කරන්නේ කෙසේ ද?

මහණෙනි, මෙහි භික්ෂුව කෙලෙස් තවන වීර්යයෙන් යුතුව, නුවණින් යුතුව, මනා සිහියෙන් යුතුව, ලෝකයෙහි ඇලීම් ගැටීම් දුරුකොට කය පිළිබඳ ව කායානුපස්සනාවෙන් වාසය කරයි. කෙලෙස් තවන වීර්යයෙන් යුතුව, නුවණින් යුතුව, මනා සිහියෙන් යුතුව, ලෝකයෙහි ඇලීම් ගැටීම් දුරුකොට විඳීම් පිළිබඳ ව වේදනානුපස්සනාවෙන් වාසය කරයි. කෙලෙස් තවන වීර්යයෙන් යුතුව, නුවණින් යුතුව, මනා සිහියෙන් යුතුව, ලෝකයෙහි ඇලීම් ගැටීම් දුරුකොට සිත පිළිබඳ ව චිත්තානුපස්සනාවෙන් වාසය කරයි. කෙලෙස් තවන වීර්යයෙන් යුතුව, නුවණින් යුතුව, මනා සිහියෙන් යුතුව, ලෝකයෙහි ඇලීම් ගැටීම් දුරුකොට ධර්මයන් පිළිබඳ ව ධම්මානුපස්සනාවෙන් වාසය කරයි.

මහණෙනි, භික්ෂුව තමා දූපතක් බඳු කොට, තමා ව සරණට ගෙන, අන් කෙනෙකු සරණට නොගෙන, ධර්මය දූපතක් බඳු කොට, ධර්මය සරණට ගෙන, අන් දෙයක් සරණට නොගෙන වාසය කරන්නේ මෙසේ ය.

මහණෙනි, සිය පියාගෙන් තමන්ට උරුම ව ආ සතර සතිපට්ඨානය නම් වූ, තමන් සිටිය යුතු තැනෙහි හැසිරෙව්. මහණෙනි, සිය පියාගෙන් තමන්ට උරුම ව ආ සතර සතිපට්ඨානය නම් වූ තමන් සිටිය යුතු තැනෙහි හැසිරෙන විට මාරයා ඔහු ව අල්ලා ගැනීමට සිදුරක් නොලබයි. මාරයා අරමුණක් නොලබයි. මහණෙනි, කුසල් දහම්වල සමාදන් ව යෙදී සිටීම හේතුවෙන් මෙසේ මේ පින වැඩෙයි.

මහණෙනි, මෙය පෙර සිදුවූවකි. සිව් මහා සමුදුර සීමාකොට ගත්, සිව් මහා ජනපදයන්ට අධිපති ව, සතුරන් දිනා ජයගත්, ජනපදයන්හි තහවුරු බවට පත්, සප්ත රත්නයෙන් යුක්ත වූ ධාර්මික වූ, දැහැමි රජෙකු වූ දළ්හනේමි නම් සක්විති රජෙක් සිටියේ ය. ඔහුට මේ සප්ත රත්නයෝ තිබුණාහු ය. එනම්; චක්‍ර රත්නය ය, හස්ති රත්නය ය, අශ්ව රත්නය ය, මාණික්‍ය රත්නය ය, ස්ත්‍රී රත්නය ය, ගෘහපති රත්නය ය සහ සත්වෙනි පුත්‍ර රත්නය යි. ඔහුට ශූර වීර වූ, පරසෙන් මඬින දහසකට වැඩි පුත්‍රයෝ වූවාහු ය. ඔහු සයුර සීමා කොට ඇති මේ පොළොව දඬුවමින් තොර ව, අවි ආයුධයෙන් තොර ව, ධර්මයෙන් ජයගෙන වාසය කළේ ය.

ඉක්බිති මහණෙනි, දළ්හනේමි රජු බොහෝ වසර ගණනක්, බොහෝ වසර සිය ගණනක් බොහෝ වසර දහස් ගණනක් ඇවෑමෙන් එක්තරා පුරුෂයෙකු ඇමතුවේ ය.

“එම්බා පුරුෂය, යම් කලෙක ඔබ දිව්‍ය වූ චක්‍රරත්නය (සක්විති රුවන) තිබූ තැනින් පසු බැස, තිබූ තැනින් බැහැර වී තිබෙනු දකින්නෙහි නම්, එවිට මට දැනුම් දෙව.”

මහණෙනි, “එසේ ය, දේවයිනි” යි ඒ පුරුෂයා දළ්හනේමි රජුට පිළිතුරු දුන්නේ ය. මහණෙනි, බොහෝ වසර ගණනක්, බොහෝ වසර සිය ගණනක්, බොහෝ වසර දහස් ගණනක් ඇවෑමෙන්, ඒ පුරුෂයා දිව්‍ය වූ චක්‍ර රත්නය තිබූ තැනින් පසු බැස, තිබූ තැනින් බැහැරට ගොස් තිබෙනු දුටුවේ ය. දැක දළ්හනේමි රජු යම් තැනක සිටියේ ද, එතැනට පැමිණියේ ය. පැමිණ දළ්හනේමි රජුට මෙය පැවසුවේ ය.

“එහෙනම් දේවයිනි, දැනගත මැනැව. ඔබගේ දිව්‍ය වූ චක්‍ර රත්නය තිබූ තැනින් පසු බැස්සේ ය. තිබූ තැනින් බැහැරට වූයේ ය.”

ඉක්බිති මහණෙනි, දළ්හනේමි රජු වැඩිමහල් පුත් කුමරු අමතා මෙය පැවසුවේ ය.

“දරුව, කුමාරය, මාගේ දිව්‍ය වූ චක්‍රරත්නය පසුබැස ගියේලු! තිබූ තැනින් බැහැර වූයේලු! එමෙන් ම මා විසින් මෙය ද අසන ලද්දේ ය. ‘යම් සක්විති රජෙකුගේ දිව්‍ය වූ චක්‍රරත්නය තිබූ තැනින් පසුබැස යයි ද, තිබූ තැනින් බැහැර වෙයි ද, දැන් ඒ රජු විසින් බොහෝ කල් ජීවත් විය හැකි නොවෙයි’ යන කරුණයි.

මා විසින් මිනිස් ලොව කාමයෝ අනුභව කරන ලද්දාහු ය. දැන් මා හට දිව්‍ය වූ කාමයන් සොයන්නට කාලය යි. දරුව, ඔබ එව. කුමාරය, සයුර සීමා කොට ගත් මේ පොළොව පාලනය කරව. මම් කෙස් රැවුල් බහා කසට පෙවූ වත් හැඳ ගිහි ගෙයින් නික්ම අනගාරික ව පැවිදි වන්නෙමි යි.

එකල්හී මහණෙනි, දළ්හනේමි රජු වැඩිමහල් පුත් කුමරුට මනා ලෙස රාජ්‍යයෙහි අනුශාසනා කොට, කෙස් රැවුල් බහවා කසට පෙවූ වත් හැඳ, ගිහි ගෙයින් නික්ම අනගාරික ව පැවිදි වූයේ ය. මහණෙනි, ඒ රාජර්ෂීන් වහන්සේ පැවිදි ව සත් වෙනි දවසෙහි දිව්‍ය වූ චක්‍ර රත්නය නොපෙනී ගියේ ය.

ඉක්බිති මහණෙනි, එක්තරා පුරුෂයෙක් ඔටුනු පළන් ක්ෂත්‍රිය රජු වෙත එළැඹ මෙය කීවේ ය.

“දේවයනි, දැනගත මැනැව. දිව්‍ය වූ චක්‍ර රත්නය නොපෙනී ගියේ ය.” එවිට මහණෙනි, ඔටුනු පළන් ක්ෂත්‍රිය රජු දිව්‍ය වූ චක්‍ර රත්නය නොපෙනී ගිය බව අසා නොසතුටු සිත් ඇතිවූයේ ය. නොසතුටු සිත් ඇති බව අත්වින්දේ ය. ඔහු රාජර්ෂීන් වහන්සේ යම් තැනක සිටියාහු ද, එතැනට පැමිණියේ ය. පැමිණ රාජර්ෂිහට මෙය සැළ කළේ ය.

“දේවයන් වහන්ස, දැනගන්නා සේක්වා! දිව්‍ය වූ චක්‍රරත්නය නොපෙනී ගියේ ය!”

මෙසේ කී කල්හී මහණෙනි, රාජ ඍෂි තෙමේ ඔටුනු පළන් ක්ෂත්‍රිය රජුට මෙසේ පැවසුවේ ය.

“දරුව, ඔබ දිව්‍ය වූ චක්‍ර රත්නය නොපෙනී ගිය කල්හී නොසතුටු සිත් ඇති ව ඉන්නට එපා! නොසතුටු සිත් ඇති බව විඳවන්නට එපා! දරුව, දිව්‍ය වූ චක්‍රරත්නය වනාහී ඔබට පියාගෙන් උරුම වන දායාදයක් නොවෙයි. එහෙයින් දරුව, ඔබ ආර්ය වූ චක්‍රවර්තී පිළිවෙතෙහි යෙදී වසව. යම්බඳු ඔබ විසින් ආර්ය වූ චක්‍රවර්තී පිළිවෙතෙහි යෙදී සිටින කල්හී ඒ පසළොස්වක පොහෝ දිනයෙහි හිස සෝදා ස්නානය කොට, පෙහෙවස් සමාදන් ව, ප්‍රාසාදයෙහි උඩුමහල් සඳළුතලයෙහි සිටින විට, අර දහසක් ඇති, රථ වළල්ල සහිත, නැබ සහිත, සියළු අයුරින් පිරිපුන් දිව්‍ය වූ චක්‍ර රත්නය පහළ වන්නේ ය යන කරුණ දකින්නට ලැබෙයි.”

“දේවයන් වහන්ස, ඒ ආර්ය වූ චක්‍රවර්තී පිළිවෙත් යනු මොනවාද?”

“එසේ වී නම් දරුව, ඔබ දස කුසල් දහම ම ඇසුරු කොට, දස කුසල් දහමට ම සත්කාර කරමින්, දස කුසල් දහමට ම ගෞරව කරමින්, දස කුසල් දහමට ම බුහුමන් කරමින්, දස කුසල් දහමට ම පුදමින්, දස කුසල් දහමෙහි ම යහපත් පැවැතුම් ඇති ව, දස කුසල් දහම ම ධජයක් කොට, දස කුසල් දහම ම පතාකයක් කොට, දස කුසල් දහම ම අධිපති කොට, අන්තඃපුර ජනයා කෙරෙහි ධාර්මික රැකවරණ ආරක්ෂාව පිළියෙල කරව.

දස කුසල් දහම ම ඇසුරු කොට ….(පෙ)…. සිය හමුදාවන් කෙරෙහි ධාර්මික රැකවරණ ආරක්ෂාව පිළියෙල කරව.

දස කුසල් දහම ම ඇසුරු කොට ….(පෙ)…. යටහත් අනුයුක්ත වූ ක්ෂත්‍රියයන් කෙරෙහි ධාර්මික රැකවරණ ආරක්ෂාව පිළියෙල කරව.

දස කුසල් දහම ම ඇසුරු කොට ….(පෙ)…. බ්‍රාහ්මණ ගෘහපතිවරුන් කෙරෙහි ධාර්මික රැකවරණ ආරක්ෂාව පිළියෙල කරව.

දස කුසල් දහම ම ඇසුරු කොට ….(පෙ)…. නියම් ගම් ජනපද වැසියන් කෙරෙහි ධාර්මික රැකවරණ ආරක්ෂාව පිළියෙල කරව.

දස කුසල් දහම ම ඇසුරු කොට ….(පෙ)…. ශ්‍රමණ බ්‍රාහ්මණයන් කෙරෙහි ධාර්මික රැකවරණ ආරක්ෂාව පිළියෙල කරව.

දස කුසල් දහම ම ඇසුරු කොට ….(පෙ)…. සිව්පාවුන්, පක්ෂීන් කෙරෙහි ධාර්මික රැකවරණ ආරක්ෂාව පිළියෙල කරව.

දරුව, තොපගේ විජිතයෙහි අධාර්මික ක්‍රියා පවත්වන්නට ඉඩදෙන්න එපා!

දරුව, තොපගේ විජිතයෙහි යම් කෙනෙක් ධනය නැති ව සිටිත් ද, ඔවුන්ට ධනය ලබා දෙව්.

දරුව, තොපගේ විජිතයෙහි යම් ශ්‍රමණ බ්‍රාහ්මණයෝ මද ප්‍රමාදයෙන් වැළකී, ඉවසීමෙහි ත්, යහපත් වචන පිළිගැනීමෙහි ත් පිහිටා සිටිමින් එක ම සිත දමනය කරත් ද, එක ම සිත සංසිඳුවත් ද, එක ම සිත මුළුමනින් ම නිවා දමත් ද, කලින් කලට ඔවුන් වෙත එළැඹ නැවත නැවත යහපත් කරුණු අසව. නැවත නැවත විමසව. ‘ස්වාමීනී, කුසල් යනු කුමක් ද? අකුසල් යනු කුමක් ද? වැරදි දේ යනු කුමක් ද? නිවැරදි දේ යනු කුමක් ද? සේවනය කළ යුතු දේ යනු කුමක් ද? සේවනය නොකළ යුතු දේ යනු කුමක් ද? මා විසින් කුමක් කළ විට බොහෝ කල් අහිත පිණිස, දුක් පිණිස පවතින්නේ ද? මා විසින් කුමක් කළ විට බොහෝ කල් හිත පිණිස, සැප පිණිස පවතින්නේ ද?’ යි. ඔවුන්ගෙන් අසාගෙන යමක් අකුසල් නම් එය දුරලව. යමක් කුසල් නම් එය සමාදන් ව පවත්වව.

දරුව, මෙය වනාහී ආර්ය වූ චක්‍රවර්තී පිළිවෙත යි.”

මහණෙනි, “එසේ ය, දේවයන් වහන්සැ”යි ඔටුනු පළන් ක්ෂත්‍රීය රජු රාජර්ෂීතුමාට පිළිවදන් දී ආර්ය චක්‍රවර්තී පිළිවෙතෙහි යෙදී කටයුතු කළේ ය. ආර්ය චක්‍රවර්තී පිළිවෙතෙහි යෙදී කටයුතු කරන ඔහුට ඒ පසළොස්වක පුන් පොහෝ දිනයෙහි හිස සෝදා ස්නානය කොට, පෙහෙවස් සමාදන් ව, ප්‍රාසාදයට නැග උඩුමහල් සඳළුතලයෙහි සිටි කල්හී, දහසක් අර ඇති රථ වළල්ල සහිත, නැබ සහිත, සියළු අයුරින් පිරිපුන් දිව්‍ය වූ චක්‍රරත්නය පහළ වූයේ ය.

ඒ චක්‍රරත්නය දුටු ඔටුනු පළන් ක්ෂත්‍රිය රජුට මේ අදහස ඇති වූයේ ය. ‘මා විසින් මෙකරුණ අසන ලද්දේ ම ය. ඒ පුන් පොහෝ දිනයෙහි හිස සෝදා ස්නානය කොට, උපෝසථ සිල් සමාදන් ව, උතුම් මාලිගයෙහි උඩුමහලට ගොස් සිටින, යම් ඔටුණු පළන් ක්ෂත්‍රීය රජෙකු හට දහසක් අර සහිත, නිම් වළලු හෙවත් පට්ටම සහිත, නාභිය හෙවත් මැද කුඩා රවුම සහිත සියළු අයුරින් පිරිපුන් දිව්‍ය වූ චක්‍රරත්නය පහළ වෙයි ද, ඔහු සක්විති රජෙක් වෙයි යනුවෙනි. මම සක්විති රජෙක් විය හැක්කෙම් ද?’

එකල්හී මහණෙනි, ඔටුනු පළන් ක්ෂත්‍රිය රජ තෙමේ හුනස්නෙන් නැගිට, උතුරු සළුව ඒකාංශ කොට පොරොවා, වම් අතින් රන් කෙණ්ඩිය ගෙන, දකුණු අතින් චක්‍රරත්නයට පැන් ඉස්සේ ය. ‘භවත් චක්‍රරත්නය කරකැවේවා! භවත් චක්‍රරත්නය විශේෂයෙන් ජය ලබා දේවා!’ යි.

ඉක්බිති මහණෙනි, ඒ චක්‍රරත්නය නැගෙනහිර දිශාවට කරකැවුණේ ය. සක්විති රජු චතුරංගිනී සේනාව සමඟ ඒ චක්‍රරත්නය අනුව නික්මුණේ ය. මහණෙනි, යම් ප්‍රදේශයක චක්‍රරත්නය පිහිටියේ ද, සක්විති රජු චතුරංගිනී සේනාව සමඟ එහි නැවතුණේ ය. මහණෙනි, නැගෙනහිර දිශාවෙහි යම් විරුද්ධ රජවරු සිටියාහු ද, ඔවුහු සක්විති රජු වෙත එළඹ මෙසේ කීවාහු ය.

“මහරජාණෙනි, එනු මැනැව. මහරජාණෙනි, ඔබට සුභ ආගමනයකි! මහරජාණෙනි, මෙය ඔබගේ විජිතය යි. මහරජාණෙනි, අපට අනුශාසනා කළ මැනැව.”

සක්විති රජු මෙසේ පැවසුවේ ය.

“සතුන් නොමැරිය යුත්තේ ය. සොරකම් නොකළ යුත්තේ ය. වැරදි කාම සේවනයෙහි නොයෙදිය යුත්තේ ය. බොරු නොකිව යුත්තේ ය. මත්පැන් මත්ද්‍රව්‍ය භාවිත නොකළ යුත්තේ ය. යම් සේ රජසැප අනුභව කළේ ද, එසේ ම රජ සැප විඳිව්.”

මහණෙනි, නැගෙනහිර දිශාවෙහි යම් විරුද්ධ රජවරු සිටියාහු ද, ඔවුහු සක්විති රජු අනුව යන්නෝ වූහ.

ඉක්බිති මහණෙනි, ඒ චක්‍රරත්නය පෙරදිග මුහුදට බැස එයින් ගොඩ නැගී දකුණු දිශාවට කරකැවුණේ ය. ….(පෙ)…. අනුව යන්නෝ වූහ.

ඉක්බිති මහණෙනි, ඒ චක්‍රරත්නය දකුණු මුහුදට බැස එයින් ගොඩ නැගී බටහිර දිශාවට කරකැවුණේ ය. සක්විති රජු චතුරංගිනී සේනාව සමඟ ඒ චක්‍රරත්නය අනුව නික්මුණේ ය. මහණෙනි, යම් ප්‍රදේශයක චක්‍රරත්නය පිහිටියේ ද, සක්විති රජු චතුරංගිනී සේනාව සමඟ එහි නැවතුණේ ය. මහණෙනි, බටහිර දිශාවෙහි යම් විරුද්ධ රජවරු සිටියාහු ද, ඔවුහු සක්විති රජු වෙත එළඹ මෙසේ කීවාහු ය. “මහරජාණෙනි, එනු මැනැව. මහරජාණෙනි, ඔබට සුභ ආගමනයකි! මහරජාණෙනි, මෙය ඔබගේ විජිතය යි. මහරජාණෙනි, අපට අනුශාසනා කළ මැනැව.”

සක්විති රජු මෙසේ පැවසුවේ ය.

“සතුන් නොමැරිය යුත්තේ ය. සොරකම් නොකළ යුත්තේ ය. වැරදි කාම සේවනයෙහි නොයෙදිය යුත්තේ ය. බොරු නොකිව යුත්තේ ය. මත්පැන් මත්ද්‍රව්‍ය භාවිත නොකළ යුත්තේ ය. යම් සේ රජසැප අනුභව කළේ ද, එසේ ම රජ සැප විඳිව්.” මහණෙනි, බටහිර දිශාවෙහි යම් විරුද්ධ රජවරු සිටියාහු ද, ඔවුහු සක්විති රජු අනුව යන්නෝ වූහ.

ඉක්බිති මහණෙනි, ඒ චක්‍රරත්නය බටහිර මුහුදට බැස එයින් ගොඩ නැගී උතුරු දිශාවට කරකැවුණේ ය. සක්විති රජු චතුරංගිනී සේනාව සමඟ ඒ චක්‍රරත්නය අනුව නික්මුණේ ය. මහණෙනි, යම් ප්‍රදේශයක චක්‍රරත්නය පිහිටියේ ද, සක්විති රජු චතුරංගිනී සේනාව සමඟ එහි නැවතුණේ ය. මහණෙනි, උතුරු දිශාවෙහි යම් විරුද්ධ රජවරු සිටියාහු ද, ඔවුහු සක්විති රජු වෙත එළඹ මෙසේ කීවාහු ය.

“මහරජාණෙනි, එනු මැනැව. මහරජාණෙනි, ඔබට සුභ ආගමනයකි! මහරජාණෙනි, මෙය ඔබගේ විජිතය යි. මහරජාණෙනි, අපට අනුශාසනා කළ මැනැව.”

සක්විති රජු මෙසේ පැවසුවේ ය.

“සතුන් නොමැරිය යුත්තේ ය. සොරකම් නොකළ යුත්තේ ය. වැරදි කාම සේවනයෙහි නොයෙදිය යුත්තේ ය. බොරු නොකිව යුත්තේ ය. මත්පැන් මත්ද්‍රව්‍ය භාවිත නොකළ යුත්තේ ය. යම් සේ රජසැප අනුභව කළේ ද, එසේ ම රජ සැප විඳිව්.”

මහණෙනි, උතුරු දිශාවෙහි යම් විරුද්ධ රජවරු සිටියාහු ද, ඔවුහු සක්විති රජු අනුව යන්නෝ වූහ.

ඉක්බිති මහණෙනි, මහා සමුද්‍රය සීමා කොට පොළොව ජයගෙන එම රාජධානියට ම ආපසු හැරී අවුත් සක්විති රජුගේ ඇතුළු නුවර දොරටුවෙහි විනිසුරු සභාව ඉදිරියෙහි ඒ චක්‍රරත්නය කඩඇණයක් ගැසූ කලෙක මෙන් සක්විති රජුගේ අන්තඃපුරය සෝභමාන කරමින් නැවතුණේ ය.

මහණෙනි, දෙවෙනි සක්විති රජු ත් ….(පෙ)…. මහණෙනි, තුන් වෙනි සක්විති රජු ත් ….(පෙ)…. මහණෙනි, සිව්වෙනි සක්විති රජු ත් ….(පෙ)…. මහණෙනි, පස්වෙනි සක්විති රජු ත් ….(පෙ)…. මහණෙනි, සයවෙනි සක්විති රජු ත් ….(පෙ)…. මහණෙනි, සත්වෙනි සක්විති රජු ත් බොහෝ වසර ගණනක්, බොහෝ වසර සිය ගණනක්, බොහෝ වසර දහස් ගණනක් ඇවෑමෙන් එක්තරා පුරුෂයෙකු ඇමතුවේ ය.

“එම්බා පුරුෂය, යම් කලෙක ඔබ දිව්‍ය වූ චක්‍රරත්නය තිබූ තැනින් පසු බැස, තිබූ තැනින් බැහැර වී තිබෙනු දකින්නෙහි නම්, එවිට මට දැනුම් දෙව.”

මහණෙනි, “එසේ ය, දේවයිනි” යි ඒ පුරුෂයා සක්විති රජුට පිළිතුරු දුන්නේ ය. මහණෙනි, බොහෝ වසර ගණනක්, බොහෝ වසර සිය ගණනක්, බොහෝ වසර දහස් ගණනක් ඇවෑමෙන්, ඒ පුරුෂයා දිව්‍ය වූ චක්‍ර රත්නය තිබූ තැනින් පසු බැස, තිබූ තැනින් බැහැරට ගොස් තිබෙනු දුටුවේ ය. දැක සක්විති රජු යම් තැනක සිටියේ ද, එතැනට පැමිණියේ ය. පැමිණ සක්විති රජුට මෙය පැවසුවේ ය.

“එහෙනම් දේවයිනි, දැනගත මැනැව. ඔබගේ දිව්‍ය වූ චක්‍ර රත්නය තිබූ තැනින් පසු බැස්සේ ය. තිබූ තැනින් බැහැරට වූයේ ය.”

ඉක්බිති මහණෙනි, සක්විති රජු වැඩිමහල් පුත් කුමරු අමතා මෙය පැවසුවේ ය.

“දරුව, කුමාරය, මාගේ දිව්‍ය වූ චක්‍රරත්නය පසුබැස ගියේලු! තිබූ තැනින් බැහැර වූයේලු! එමෙන් ම මා විසින් මෙය ද අසන ලද්දේ ය. ‘යම් සක්විති රජෙකුගේ දිව්‍ය වූ චක්‍රරත්නය තිබූ තැනින් පසුබැස යයි ද, තිබූ තැනින් බැහැර වෙයි ද, දැන් ඒ රජු විසින් බොහෝ කල් ජීවත් විය හැකි නොවෙයි’ යන කරුණ යි.

මා විසින් මිනිස් ලොව කාමයෝ අනුභව කරන ලද්දාහු ය. දැන් මා හට දිව්‍ය වූ කාමයන් සොයන්නට කාලය යි. දරුව, ඔබ එව. කුමාරය, සයුර සීමා කොට ගත් මේ පොළොව පාලනය කරව. මම් කෙස් රැවුල් බහා කසට පෙවූ වත් හැඳ ගිහි ගෙයින් නික්ම අනගාරික ව පැවිදි වන්නෙමි යි.

එකල්හී මහණෙනි, සක්විති රජු වැඩිමහල් පුත් කුමරුට මනා ලෙස රාජ්‍යයෙහි අනුශාසනා කොට, කෙස් රැවුල් බහවා කසට පෙවූ වත් හැඳ, ගිහි ගෙයින් නික්ම අනගාරික ව පැවිදි වූයේ ය. මහණෙනි, ඒ රාජර්ෂීන් වහන්සේ පැවිදි ව සත් වෙනි දවසෙහි දිව්‍ය වූ චක්‍ර රත්නය නොපෙනී ගියේ ය.

ඉක්බිති මහණෙනි, එක්තරා පුරුෂයෙක් ඔටුනු පළන් ක්ෂත්‍රිය රජු වෙත එළැඹ මෙය කීවේ ය.

“දේවයනි, දැනගත මැනැව. දිව්‍ය වූ චක්‍ර රත්නය නොපෙනී ගියේ ය.” එවිට මහණෙනි, ඔටුනු පළන් ක්ෂත්‍රිය රජු දිව්‍ය වූ චක්‍ර රත්නය නොපෙනී ගිය බව අසා නොසතුටු සිත් ඇතිවූයේ ය. නොසතුටු සිත් ඇති බව අත්වින්දේ ය. නමුත් රාජඍෂිතුමා වෙත එළැඹ ආර්ය වූ චක්‍රවර්තී පිළිවෙත නොඇසුවේ ය. ඔහු තමන්ගේ හිතුමනාපයෙන් ජනපදය පාලනය කරයි. තමන්ගේ හිතුමනාපයට ජනපදය පාලනය කරන විට කලින් සිටි රජවරුන් ආර්ය චක්‍රවර්තී පිළිවෙතින් පාලනය කළ සමයෙහි මෙන් ඔහුගේ ජනපදයෝ දියුණු නොවෙති.

එකල්හී මහණෙනි, ඇමතිවරු ද, රජ පිරිස ද, ගණකයෝ ද, මහාමාත්‍යයෝ ද, හමුදා බල ප්‍රධානීහු ද, දොරටුපාලකයෝ ද, උපදේශකයෝ ද, රැස් වී ඔටුනු පළන් ක්ෂත්‍රීය රජු වෙත එළැඹ මෙය කීවාහු ය.

“දේවයනි, තමන්ගේ හිතුමතයට ජනපදය පාලනය කරන විට කලින් සිටි රජවරුන් ආර්ය චක්‍රවර්තී පිළිවෙතින් පාලනය කළ කාලයෙහි මෙන් ඔබවහන්සේගේ ජනපදයෝ දියුණු නොවෙති. දේවයනි, යම්බඳු අපි ආර්ය චක්‍රවර්තී පිළිවෙත දරමු නම් එසේ වූ අප ද, අන්‍ය වූ ඇමතිවරු ද, රජ පිරිස ද, ගණකයෝ ද, මහාමාත්‍යයෝ ද, හමුදා බල ප්‍රධානීහු ද, දොරටුපාලකයෝ ද, උපදේශකයෝ ද ඔබවහන්සේගේ විජිතයෙහි සිටිති. එහෙනම් දේවයනි, ඔබවහන්සේ අපගෙන් ආර්ය වූ චක්‍රවර්තී පිළිවෙත අසන්න. ඔබ විසින් අසන ලද ඒ අපි ආර්ය වූ චක්‍රවර්තී පිළිවෙත පවසන්නෙමු.

ඉක්බිති මහණෙනි, ඔටුනු පළන් ක්ෂත්‍රීය රජු ඇමතියන් ද, රාජ පිරිස ද, ගණකයන් ද, මහාමාත්‍යයන් ද, බලප්‍රධානීන් ද, ද්වාර පාලකයන් ද, උපදේශකයන් ද රැස් කරවා ආර්ය චක්‍රවර්තී පිළිවෙත ඇසුවේ ය.

ඒ රජු විසින් අසන ලද ඔවුහු ආර්ය චක්‍රවර්තී පිළිවෙත කියාදුන්හ. ඔවුන්ගේ වචනය ඇසූ ඒ රජු ධාර්මික රක්ෂාවරණ ආරක්ෂාව යෙදවී ය. එසේ නමුත් ධනය නැති උදවියට ධනය නොදුන්නේ ය. ධනය නැති උදවියට ධනය නොලැබෙන කල්හී දිළිඳුබව බොහෝ වැඩිවී ගියේ ය. දිළිඳු බව බොහෝ වැඩි වී ගිය කල්හී එක්තරා පුරුෂයෙක් අනුන්ට අයත්, තමාට නුදුන් දෙයක් සොර සිතින් ගත්තේ ය. මිනිස්සු ඔහු ව අල්ලා ගත්හ. අල්ලාගෙන ඔටුනු පළන් ක්ෂත්‍රිය රජුට දැක්වූහ.

“දේවයිනි, මේ පුරුෂයා අනුන්ට අයත්, තමාට නුදුන් දෙයක් සොර සිතින් ගත්තේ ය.”

මෙසේ කී කල්හී මහණෙනි, ඔටුනු පළන් ක්ෂත්‍රීය රජු ඒ පුරුෂයාට මෙය පැවසුවේ ය.

“එම්බා පුරුෂය, සැබෑවක් ද? අනුන්ට අයත්, තමාට නුදුන් දෙයක් ඔබ සොර සිතින් ගත්තෙහි ද?”

“සැබෑවකි දේවයිනි.”

“එසේ ගන්නට කාරණාව කුමක් ද?”

“දේවයිනි, ජීවත්වෙන්නට නොහැක්කෙමි.”

එකල්හී මහණෙනි, ඔටුනු පළන් ක්ෂත්‍රිය රජු ඒ පුරුෂයාට ධනය දුන්නේය.

“එම්බා පුරුෂය, ඔබ මේ ධනයෙන් තමනුත් ජීවත් වෙව. මව්පියන් ද පෝෂණය කරව. අඹුදරුවන් ද පෝෂණය කරව. කර්මාන්ත කටයුතුවල ත් යොදවාලව. සුගතියෙහි උපතට හේතුවන, සුගතිය පිණිස පවතින, සැප විපාක දෙන පරිදි ශ්‍රමණ බ්‍රාහ්මණයන්ට ත් දන් වැටක් පිහිටුවව.” මහණෙනි, “එසේ ය, දේවයිනි” යි ඒ පුරුෂයා ඔටුනු පළන් ක්ෂත්‍රිය රජුට පිළිතුරු දුන්නේ ය.

මහණෙනි, තව පුරුෂයෙකුත් අනුන්ට අයත්, තමාට නුදුන් දෙයක් සොර සිතින් ගත්තේ ය. මිනිස්සු ඔහු ව අල්ලා ගත්හ. අල්ලාගෙන ඔටුනු පළන් ක්ෂත්‍රිය රජුට දැක්වූහ.

“දේවයිනි, මේ පුරුෂයා අනුන්ට අයත්, තමාට නුදුන් දෙයක් සොර සිතින් ගත්තේ ය.”

මෙසේ කී කල්හී මහණෙනි, ඔටුනු පළන් ක්ෂත්‍රීය රජු ඒ පුරුෂයාට මෙය පැවසුවේ ය.

“එම්බා පුරුෂය, සැබෑවක් ද? අනුන්ට අයත්, තමාට නුදුන් දෙයක් ඔබ සොර සිතින් ගත්තෙහි ද?”

“සැබෑවකි දේවයිනි.”

“එසේ ගන්නට කාරණාව කුමක් ද?”

“දේවයිනි, ජීවත්වෙන්නට නොහැක්කෙමි.”

එකල්හී මහණෙනි, ඔටුනු පළන් ක්ෂත්‍රිය රජු ඒ පුරුෂයාට ධනය දුන්නේය.

“එම්බා පුරුෂය, ඔබ මේ ධනයෙන් තමනුත් ජීවත් වෙව. මව්පියන් ද පෝෂණය කරව. අඹුදරුවන් ද පෝෂණය කරව. කර්මාන්ත කටයුතුවල ත් යොදවාලව. සුගතියෙහි උපතට හේතුවන, සුගතිය පිණිස පවතින, සැප විපාක දෙන පරිදි ශ්‍රමණ බ්‍රාහ්මණයන්ට ත් දන් වැටක් පිහිටුවව.” මහණෙනි, “එසේ ය, දේවයිනි” යි ඒ පුරුෂයා ඔටුනු පළන් ක්ෂත්‍රිය රජුට පිළිතුරු දුන්නේ ය.

මහණෙනි, ‘භවත්නි, යම් කෙනෙක් අනුන්ට අයත්, තමන්ට නුදුන් දෙයක් සොර සිතින් ගනිත් නම්, ඔවුන්ට රජු ධනය දෙන්නේලු!’ යි මිනිස්සු ඇසූහ. අසා ඔවුන්ට මේ අදහස ඇතිවූයේ ය. ‘එසේ නම් අපි ත් අනුන්ට අයත්, තමන්ට නොදුන් දේ සොර සිතින් ගන්නෙමු නම් යෙහෙකි’ යි.

ඉක්බිති මහණෙනි, තවත් පුරුෂයෙක් අනුන්ට අයත්, තමාට නුදුන් දෙයක් සොර සිතින් ගත්තේ ය. මිනිස්සු ඔහු ව අල්ලා ගත්හ. අල්ලාගෙන ඔටුනු පළන් ක්ෂත්‍රිය රජුට දැක්වූහ.

“දේවයිනි, මේ පුරුෂයා අනුන්ට අයත්, තමාට නුදුන් දෙයක් සොර සිතින් ගත්තේ ය.”

මෙසේ කී කල්හී මහණෙනි, ඔටුනු පළන් ක්ෂත්‍රීය රජු ඒ පුරුෂයාට මෙය පැවසුවේ ය.

“එම්බා පුරුෂය, සැබෑවක් ද? අනුන්ට අයත්, තමාට නුදුන් දෙයක් ඔබ සොර සිතින් ගත්තෙහි ද?”

“සැබෑවකි දේවයිනි.”

“එසේ ගන්නට කාරණාව කුමක් ද?”

“දේවයිනි, ජීවත්වෙන්නට නොහැක්කෙමි.”

එකල්හී මහණෙනි, ඔටුනු පළන් ක්ෂත්‍රිය රජුට මෙසේ සිතුණේ ය. ‘ඉදින් යමෙක් යමෙක් අනුන්ට අයත්, තමන්ට නොදුන් දේ සොරකම් කරන්නේ නම්, මම ඒ ඒ කෙනාට ධනය ද දෙන්නෙම් නම්, මෙසේ මේ අන්සතු දේ පැහැර ගැනීම වැඩෙන්නේ ය. එහෙයින් මම මේ පුරුෂයා යළි සොරකම් කරන්නට බැරි වන සෙයින් නැති කරන්නෙම් නම්, මුලින් ම සිඳින්නෙම් නම්, මොහුගේ හිස සිඳින්නෙම් නම් මැනැවි’ යි.

ඉක්බිති මහණෙනි, ඔටුනු පළන් ක්ෂත්‍රිය රජු රාජපුරුෂයන් ඇමතුවේ ය.

“එසේ වී නම් සගයෙනි, මේ පුරුෂයා දැඩි වූ වරපටින් දෑත් පිටුපසට කොට තද කොට බැඳ, හිස මුඩු කොට බැගෑ හඬ ඇති පණා බෙර වයමින්, පාරක් පාරක් ගානේ, හන්දියක් හන්දියක් ගානේ ගෙන ගොස් දකුණු දොරටුවෙන් නික්මී නුවරට දකුණින් නැවත සොරකම් කරන්නට බැරි වන ලෙස, නැති කරව්. මුලින් ම සිඳ දමව්. මොහුගේ හිස සිඳිව්.”

මහණෙනි, “එසේ ය, දේවයිනි” යි ඒ රාජ පුරුෂයෝ ඔටුණු පළන් ක්ෂත්‍රිය රජු හට පිළිවදන් දී අර පුරුෂයා දැඩි වූ වරපටින් දෑත් පිටුපසට කොට තද කොට බැඳ, හිස මුඩු කොට බැගෑ හඬ ඇති පණා බෙර වයමින්, පාරක් පාරක් ගානේ, හන්දියක් හන්දියක් ගානේ ගෙන ගොස් දකුණු දොරටුවෙන් නික්මී නුවරට දකුණින් නැවත සොරකම් කරන්නට බැරි වන ලෙස, නැති කොට දැමූහ. මුලින් ම සිඳ දැමූහ. ඔහුගේ හිස ගසා දැමූහ.

මහණෙනි, මිනිස්සු මෙය ඇසූහ. ‘භවත්නි, යම්කෙනෙක් අනුන්ට අයත්, තමන්ට නොදුන් දේ සොරසිතින් ගනිත් නම්, රජු නැවත සොරකම් කළ නොහැකි වන සේ ඔවුහු නැතිකොට දමයි. මුලින් ම සිඳ දමයි. ඔවුන්ගේ හිස් ගසා දමයි.’ එය ඇසූ ඔවුන්ට මේ අදහස ඇතිවූයේ ය. ‘එසේ නම් අපිත් තියුණු අවි ආයුධ කරවන්නෙමු. තියුණු අවි ආයුධ කරවා යම් අය සතු දේ සොර සිතින් පැහැර ගන්නෙමු නම්, අප ගැන කියන්නට බැරි වන සේ ඔවුන් නැති කොට දමන්නෙමු. මුලින් ම සිඳින්නෙමු. ඔවුන්ගේ හිස් ගසා දමන්නෙමු’ යි.

ඔවුහු තියුණු අවි ආයුධ තැනෙව්වාහු ය. තියුණු අවි ආයුධ තනවා ගම්වැසියන් නසා, බඩු පැහැර ගන්නට පටන් ගත්හ. නියම්ගම්වැසියන් නසා බඩු පැහැර ගන්නට පටන් ගත්හ. නගරවැසියන් නසා බඩු පැහැර ගන්නට පටන් ගත්හ. පාරේ යන මිනිසුන් නසා බඩු පැහැර ගන්නට පටන් ගත්හ. ඔවුහු යම්කෙනෙකුන් සතු බඩුමුට්ටු පැහැර ගත්තාහු ද, ඒ අයිතිකාරයින්ට සාක්ෂි දී ගන්නට නොහැකි වන සෙයින් නැති කොට දමත්. මුලින් ම සිඳ දමත්. ඔවුන්ගේ හිස් ගසා දමත්.

මෙසේ මහණෙනි, ධනය නැති උදවියට ධනය ලැබෙන පිළිවෙලක් නැති කල්හි දිළිදු බව බොහෝ පැතිරී ගියේ ය. දිළිදු බව බොහෝ පැතිරී ගිය කල්හී අන්සතු දේ පැහැර ගැනීම බොහෝ පැතිරී ගියේ ය. අන්සතු දේ පැහැර ගැනීම බොහෝ පැතිරී ගිය කල්හී අවි ආයුධ ගැනීම බොහෝ පැතිරී ගියේ ය. අවි ආයුධ බොහෝ පැතිරී ගිය කල්හී මනුෂ්‍ය ඝාතන බොහෝ වැඩි වී ගියේ ය. මනුෂ්‍ය ඝාතන බොහෝ වැඩිවී ගිය කල්හී ඒ සත්වයන්ගේ ආයුෂ ත් පිරිහී ගියේ ය. පැහැය ත් පිරිහී ගියේ ය. ඔවුන්ගේ ආයුෂ ත් පිරිහී යන විට, පැහැයත් පිරිහී යන විට, අසූ දහසක් අවුරුදු ආයුෂ ඇති මිනිසුන්ගේ දරුවෝ සතළිස් දහසක් අවුරුදු ආයුෂ ඇත්තෝ වූහ.

මහණෙනි, මිනිසුන්ගේ ආයුෂ අවුරුදු සතළිස් දහසක් වූ කල්හී එක්තරා පුරුෂයෙක් අනුන් සතු, තමාට නොදුන් දෙයක් සොර සිතින් ගත්තේ ය. මිනිස්සු ඔහු ව අල්ලා ගත්හ. අල්ලා ගෙන ඔටුනු පළන් ක්ෂත්‍රීය රජු වෙත දැක්වූහ.

“දේවයිනි, මේ පුරුෂයා අනුන්ට අයත්, තමාට නුදුන් දෙයක් සොර සිතින් ගත්තේ ය.”

මෙසේ කී කල්හී මහණෙනි, ඔටුනු පළන් ක්ෂත්‍රීය රජු ඒ පුරුෂයාට මෙය පැවසුවේ ය.

“එම්බා පුරුෂය, සැබෑවක් ද? අනුන්ට අයත්, තමාට නුදුන් දෙයක් ඔබ සොර සිතින් ගත්තෙහි ද?”

“නැත දේවයන් වහන්ස” යි දැන දැන බොරු කිව්වේ ය.

මහණෙනි, මෙසේ ධනය නැති උදවියට ධනය ලැබෙන පිළිවෙලක් නැති කල්හි දිළිදු බව බොහෝ පැතිරී ගියේ ය. දිළිදු බව බොහෝ පැතිරී ගිය කල්හී අන්සතු දේ පැහැර ගැනීම බොහෝ පැතිරී ගියේ ය. අන්සතු දේ පැහැර ගැනීම බොහෝ පැතිරී ගිය කල්හී අවි ආයුධ ගැනීම බොහෝ පැතිරී ගියේ ය. අවි ආයුධ බොහෝ පැතිරී ගිය කල්හී මනුෂ්‍ය ඝාතන බොහෝ වැඩි වී ගියේ ය. මනුෂ්‍ය ඝාතන බොහෝ වැඩිවී ගිය කල්හී බොරු කීම බොහෝ පැතිරී ගියේ ය. බොරු කීම බොහෝ පැතිරී ගිය කල්හී ඒ සත්වයන්ගේ ආයුෂ ත් පිරිහී ගියේ ය. පැහැය ත් පිරිහී ගියේ ය. ඔවුන්ගේ ආයුෂ ත් පිරිහී යන විට, පැහැයත් පිරිහී යන විට, හතළිස් දහසක් අවුරුදු ආයුෂ ඇති මිනිසුන්ගේ දරුවෝ විසි දහසක් අවුරුදු ආයුෂ ඇත්තෝ වූහ.

මහණෙනි, මිනිසුන්ගේ ආයුෂ අවුරුදු විසි දහසක් වූ කල්හී එක්තරා පුරුෂයෙක් අනුන් සතු, තමාට නොදුන් දෙයක් සොරකම් කළේ ය. එවිට තවත් පුරුෂයෙක් ඔටුනු පළන් ක්ෂත්‍රිය රජු වෙත ගොස් මෙය සැළ කළේ ය.

“දේවයනි, අසවල් නම් ඇති පුරුෂයා අනුන් සතු, තමාට නොදුන් දෙයක් සොරකම් කළේ ය” යි කේළාම් කීවේ ය.

මහණෙනි, මෙසේ ධනය නැති උදවියට ධනය ලැබෙන පිළිවෙලක් නැති කල්හි දිළිදු බව බොහෝ පැතිරී ගියේ ය. දිළිදු බව බොහෝ පැතිරී ගිය කල්හී අන්සතු දේ පැහැර ගැනීම බොහෝ පැතිරී ගියේ ය. අන්සතු දේ පැහැර ගැනීම බොහෝ පැතිරී ගිය කල්හී අවි ආයුධ ගැනීම බොහෝ පැතිරී ගියේ ය. අවි ආයුධ බොහෝ පැතිරී ගිය කල්හී මනුෂ්‍ය ඝාතන බොහෝ වැඩි වී ගියේ ය. මනුෂ්‍ය ඝාතන බොහෝ වැඩිවී ගිය කල්හී බොරු කීම බොහෝ පැතිරී ගියේ ය. බොරු කීම බොහෝ පැතිරී ගිය කල්හී කේළාම් කීම බොහෝ පැතිරී ගියේ ය. කේළාම් කීම බොහෝ පැතිරී ගිය කල්හී ඒ සත්වයන්ගේ ආයුෂ ත් පිරිහී ගියේ ය. පැහැය ත් පිරිහී ගියේ ය. ඔවුන්ගේ ආයුෂ ත් පිරිහී යන විට, පැහැයත් පිරිහී යන විට, විසි දහසක් අවුරුදු ආයුෂ ඇති මිනිසුන්ගේ දරුවෝ දස දහසක් අවුරුදු ආයුෂ ඇත්තෝ වූහ.

මහණෙනි, මිනිසුන්ගේ ආයුෂ අවුරුදු දස දහසක් වූ කල්හී ඇතැම් සත්වයෝ මනා පැහැපත් වෙති. ඇතැම් සත්වයෝ කිලිටි පැහැ ඇත්තෝ වෙති. එහිදී ඔවුන් අතර යම් ඒ සත්වයෝ කිලිටි පැහැ ඇති ව සිටියාහු ද, ඔවුහු මනා පැහැ ඇති සත්වයන් දෙස සරාගී සිතින් බලමින්, අනුන්ගේ අඹුවන් සමඟ වැරදි කාම සේවනයට පැමිණියාහු ය.

මහණෙනි, මෙසේ ධනය නැති උදවියට ධනය ලැබෙන පිළිවෙලක් නැති කල්හි දිළිදු බව බොහෝ පැතිරී ගියේ ය. දිළිදු බව බොහෝ පැතිරී ගිය කල්හී අන්සතු දේ පැහැර ගැනීම බොහෝ පැතිරී ගියේ ය. අන්සතු දේ පැහැර ගැනීම බොහෝ පැතිරී ගිය කල්හී අවි ආයුධ ගැනීම බොහෝ පැතිරී ගියේ ය. අවි ආයුධ බොහෝ පැතිරී ගිය කල්හී මනුෂ්‍ය ඝාතන බොහෝ වැඩි වී ගියේ ය. මනුෂ්‍ය ඝාතන බොහෝ වැඩිවී ගිය කල්හී බොරු කීම බොහෝ පැතිරී ගියේ ය. බොරු කීම බොහෝ පැතිරී ගිය කල්හී කේළාම් කීම බොහෝ පැතිරී ගියේ ය. කේළාම් කීම බොහෝ පැතිරී ගිය කල්හී වැරදි කාම සේවනය බොහෝ පැතිරී ගියේ ය. වැරදි කාම සේවනය බොහෝ පැතිරී ගිය කල්හී ඒ සත්වයන්ගේ ආයුෂ ත් පිරිහී ගියේ ය. පැහැය ත් පිරිහී ගියේ ය. ඔවුන්ගේ ආයුෂ ත් පිරිහී යන විට, පැහැයත් පිරිහී යන විට, දස දහසක් අවුරුදු ආයුෂ ඇති මිනිසුන්ගේ දරුවෝ පන් දහසක් අවුරුදු ආයුෂ ඇත්තෝ වූහ.

මහණෙනි, මිනිසුන්ගේ ආයුෂ අවුරුදු පන් දහසක් වූ කල්හී ඔවුන් අතර කරුණු දෙකක් බොහෝ සේ වැඩි වී ගියේ ය. එනම්, දරුණු වචනයෙන් බැණ වැදීම ත්, හිස් වචන කතා කිරීම ත් ය. මේ කරුණු දෙක බොහෝ වැඩි වී ගිය කල්හී ඒ සත්වයන්ගේ ආයුෂ ත් පිරිහී ගියේ ය. පැහැය ත් පිරිහී ගියේ ය. ඔවුන්ගේ ආයුෂ ත් පිරිහී යන විට, පැහැයත් පිරිහී යන විට, පන් දහසක් අවුරුදු ආයුෂ ඇති මිනිසුන්ගේ ඇතැම් දරුවෝ දෙදහස් පන්සියයක් අවුරුදු ආයුෂ ඇත්තෝ වූහ. ඇතැම් දරුවෝ දෙදහස් වසරක ආයුෂ ඇත්තෝ වූහ.

මහණෙනි, දෙදහස් පන්සිය වසරක් ආයුෂ ඇති මිනිසුන් අතර අනුන් සතු දේ තමාට අයත් කරගැනීමේ ආශාව ත්, ද්වේෂය ත් බොහෝ වැඩි වී ගියේ ය. අනුන් සතු දේ තමන් සතු කරගැනීමේ ආශාව ත්, ද්වේෂය ත් බොහෝ වැඩි වී ගිය කල්හී ඒ සත්වයන්ගේ ආයුෂ ත් පිරිහී ගියේ ය. පැහැය ත් පිරිහී ගියේ ය. ඔවුන්ගේ ආයුෂ ත් පිරිහී යන විට, පැහැයත් පිරිහී යන විට, දෙදහස් පන්සියයක් අවුරුදු ආයුෂ ඇති මිනිසුන්ගේ දරුවෝ දහසක් අවුරුදු ආයුෂ ඇත්තෝ වූහ.

මහණෙනි, දහස් වසරක ආයුෂ ඇති මිනිසුන් අතර මිථ්‍යා දෘෂ්ටිය බොහෝ සේ වැඩි වී ගියේ ය. මිථ්‍යා දෘෂ්ටිය බොහෝ පැතිරී ගිය කල්හී ඒ සත්වයන්ගේ ආයුෂ ත් පිරිහී ගියේ ය. පැහැය ත් පිරිහී ගියේ ය. ඔවුන්ගේ ආයුෂ ත් පිරිහී යන විට, පැහැයත් පිරිහී යන විට, දහසක් අවුරුදු ආයුෂ ඇති මිනිසුන්ගේ දරුවෝ පන්සියයක් අවුරුදු ආයුෂ ඇත්තෝ වූහ.

මහණෙනි, පන්සිය වසරක් ආයුෂ ඇති මිනිසුන් අතර තුන් කරුණක් බොහෝ පැතිරී ගියේ ය. අධර්ම රාගය, විෂම ලෝභය සහ මිථ්‍යා ධර්මය යි. මේ තුන් කරුණ බොහෝ පැතිරී ගිය කල්හී ඒ සත්වයන්ගේ ආයුෂ ත් පිරිහී ගියේ ය. පැහැය ත් පිරිහී ගියේ ය. ඔවුන්ගේ ආයුෂ ත් පිරිහී යන විට, පැහැයත් පිරිහී යන විට, පන්සියයක් අවුරුදු ආයුෂ ඇති මිනිසුන්ගේ ඇතැම් දරුවෝ දෙසිය පනසක් අවුරුදු ආයුෂ ඇත්තෝ වූහ. ඇතැම් දරුවෝ දෙසිය වසරක් ආයුෂ ඇත්තෝ වූහ.

මහණෙනි, දෙසිය පනස් වසරක් ආයුෂ ඇති මිනිසුන් අතර මේ කරුණු බොහෝ පැතිර ගියේ ය. මව්ට නොසැළකීම, පියාට නොසැළකීම, ශ්‍රමණයන්ට ගරු නොකිරීම, බ්‍රාහ්මණයන්ට ගරු නොකිරීම, ගුරුවරාදී කුලදෙටුවන්ට ගරු නොකිරීම ය.

මහණෙනි, මෙසේ ධනය නැති උදවියට ධනය ලැබෙන පිළිවෙලක් නැති කල්හි දිළිදු බව බොහෝ පැතිරී ගියේ ය. දිළිදු බව බොහෝ පැතිරී ගිය කල්හී අන්සතු දේ පැහැර ගැනීම බොහෝ පැතිරී ගියේ ය. අන්සතු දේ පැහැර ගැනීම බොහෝ පැතිරී ගිය කල්හී අවි ආයුධ ගැනීම බොහෝ පැතිරී ගියේ ය. අවි ආයුධ බොහෝ පැතිරී ගිය කල්හී මනුෂ්‍ය ඝාතන බොහෝ වැඩි වී ගියේ ය. මනුෂ්‍ය ඝාතන බොහෝ වැඩිවී ගිය කල්හී බොරු කීම බොහෝ පැතිරී ගියේ ය. බොරු කීම බොහෝ පැතිරී ගිය කල්හී කේළාම් කීම බොහෝ පැතිරී ගියේ ය. කේළාම් කීම බොහෝ පැතිරී ගිය කල්හී වැරදි කාම සේවනය බොහෝ පැතිරී ගියේ ය. වැරදි කාම සේවනය බොහෝ පැතිරී ගිය කල්හී දරුණු වචනයෙන් බැණ වැදීම ත්, හිස් වචන කතා කිරීම ත් යන මේ කරුණ දෙක බොහෝ පැතිරී ගියේ ය. මේ කරුණු දෙක බොහෝ පැතිරී ගිය කල්හී අන්සතු දෙය තමා සතු කරගැනීමේ ආශාව ත්, ද්වේෂය ත් බොහෝ පැතිරී ගියේ ය. අන්සතු දෙය තමා සතු කරගැනීමේ ආශාව ත්, ද්වේෂය ත් බොහෝ පැතිරී ගිය කල්හී මිථ්‍යා දෘෂ්ටිය බොහෝ පැතිරී ගියේ ය. මිථ්‍යා දෘෂ්ටිය බොහෝ පැතිරී ගිය කල්හී අධර්ම රාගය, විෂම ලෝභය, මිථ්‍යා ධර්මය යන කරුණු තුන බොහෝ පැතිරී ගියේ ය. මේ කරුණු තුන බොහෝ පැතිරී ගිය කල්හී, මව්ට නොසැළකීම, පියාට නොසැළකීම, ශ්‍රමණයන්ට ගරු නොකිරීම, බ්‍රාහ්මණයන්ට ගරු නොකිරීම, ගුරුවරාදී කුලදෙටුවන්ට ගරු නොකිරීම යන මේ කරුණු බොහෝ පැතිරී ගියේ ය. මේ කරුණු බොහෝ පැතිරී ගිය කල්හී ඒ සත්වයන්ගේ ආයුෂ ත් පිරිහී ගියේ ය. පැහැය ත් පිරිහී ගියේ ය. ඔවුන්ගේ ආයුෂ ත් පිරිහී යන විට, පැහැයත් පිරිහී යන විට, දෙසිය පනසක් අවුරුදු ආයුෂ ඇති මිනිසුන්ගේ දරුවෝ සියයක් අවුරුදු ආයුෂ ඇත්තෝ වූහ.

මහණෙනි, මේ මිනිසුන්ගේ දරුවෝ දස වර්ෂයක ආයුෂ ඇත්තෝ වන්නාහු ද, එබඳු කාලයක් එන්නේ ය. මහණෙනි, දස වසරක් ආයුෂ ඇති මිනිසුන් අතර, පස් හැවිරිදි කුමරියෝ පතිකුලයට යෑමට සුදුසු වන්නෝ ය. මහණෙනි, දස වසක් ආයු ඇති මිනිසුන් අතර මේ රසයෝ අතුරුදහන් වන්නාහු ය. එනම්, ගිතෙල් රස ය, වෙඬරු රස ය, තල තෙල් රස ය, මී පැණි රස ය, පැණි රස ය. ලුණු රසය ය.

මහණෙනි, දස වසක් ආයු ඇති මිනිසුන් අතර කුරහන් වලින් සැකසූ ආහාරය බොජුන් අතර අග්‍ර වන්නේ ය. මහණෙනි, මෙකල මස් සහිත ඇල් හාලේ බත බොජුන් අතර අග්‍ර වන්නේ යම් සේ ද, එසෙයින් ම මහණෙනි, දසවසක් ආයු ඇති මිනිසුන් අතර කුරහන් වලින් සැකසූ ආහාරය බොජුන් අතර අග්‍ර වන්නේ ය. මහණෙනි, දස වසක් ආයු ඇති මිනිසුන් අතර දස කුසල කර්මපථ සහමුලින් ම අතුරුදහන් වන්නේ ය. දස අකුසල කර්ම පථ අතිශයින් ම ඉස්මතු ව එන්නේ ය. මහණෙනි, දස වසක් ආයු ඇති මිනිසුන් අතර කුසලය යන නමවත් අසන්නට නොලැබෙන්නේ ය. කුසල් කරන්නෙක් කොයින් නම් ලබන්න ද?

මහණෙනි, දසවස් ආයු ඇති මිනිසුන් අතර යම් කෙනෙක් මවට නොසළකත් ද, පියාට නොසළකත් ද, ශ්‍රමණයින්ට ගරු නොකරත් ද, බ්‍රාහ්මණයින්ට ගරු නොකරත් ද, කුල දෙටුවන්ට අවනත නොවෙත් ද, ඔවුහු පිදුම් ද ලබන්නාහ. ප්‍රශංසා ද ලබන්නාහ. මහණෙනි, මෙකල යම් කෙනෙක් මව්ට සළකත් නම්, පියාට සළකත් නම්, ශ්‍රමණයින්ට ගරු කරත් නම්, බ්‍රාහ්මණයින්ට ගරු කරත් නම්, කුල දෙටුවන්ට අවනත වෙත් නම්, ඔවුහු යම් සේ පුද ලබත් ද, ප්‍රශංසා ලබත් ද, එසෙයින් ම මහණෙනි, දසවස් ආයු ඇති මිනිසුන් අතර යම් කෙනෙක් මවට නොසළකත් ද, පියාට නොසළකත් ද, ශ්‍රමණයින්ට ගරු නොකරත් ද, බ්‍රාහ්මණයින්ට ගරු නොකරත් ද, කුල දෙටුවන්ට අවනත නොවෙත් ද, ඔවුහු පිදුම් ද ලබන්නාහ. ප්‍රශංසා ද ලබන්නාහ.

මහණෙනි, දස වස් ආයු ඇති මිනිසුන් අතර ‘මව්තුමිය ය, මෑණියන්ගේ සොහොයුරියෝ ය, නැන්දණියෝ ය, ආචාර්යවරයන්ගේ බිරින්දෑවරු ය, ගරු කළ යුත්තන්ගේ බිරින්දෑවරුන් ය වශයෙන් ගරුසරු හැඟීම් නැති වන්නේ ය. එළු බැටළුවෝ, කුකුළෝ ඌරෝ, බලු සිවල්ලු යම් සේ හැසිරෙත් ද, එසෙයින් ම ලෝක සත්වයෝ යහපත් කුලාචාර ධර්ම නොතකා, සිඳබිඳ දමා හිතුමනාපයේ හැසිරෙන්නාහ.

මහණෙනි, මිනිසුන්ගේ ආයුෂ දස වසක් ව ඇති කල්හී ඒ සත්වයන් අතර එකිනෙකා කෙරෙහි දරුණු වෛරයක් පිහිටන්නේ ය. දරුණු ද්වේෂයක්, දරුණු මානසික ආවේගයක්, දරුණු වධක චිත්තයක් පිහිටන්නේ ය. පුතු කෙරෙහි මව තුළ ත්, මව කෙරෙහි පුතු තුළ ත්, පුතු කෙරෙහි පියා තුළ ත්, පියා කෙරෙහි පුතු තුළ ත්, සොයුරා කෙරෙහි සොයුරා තුළ ත්, සොයුරිය කෙරෙහි සොයුරා තුළ ත්, සොයුරා කෙරෙහි සොයුරිය තුළ ත්, දරුණු වෛරයක් පිහිටන්නේ ය. දරුණු ද්වේෂයක්, දරුණු මානසික ආවේගයක්, දරුණු වධක චිත්තයක් පිහිටන්නේ ය.

මහණෙනි, යම් සේ මුවන් මරන්නෙකුට මුවෙකු දැක්ක විට දරුණු වෛරයක පිහිටීමක් වෙයි ද, දරුණු ද්වේෂයක, දරුණු මානසික ආවේගයක, දරුණු වධක චිත්තයක පිහිටීමක් වෙයි ද, එසෙයින් ම මහණෙනි, මිනිසුන්ගේ ආයුෂ දස වසක් ව ඇති කල්හී ඒ සත්වයන් අතර එකිනෙකා කෙරෙහි දරුණු වෛරයක් පිහිටන්නේ ය. දරුණු ද්වේෂයක්, දරුණු මානසික ආවේගයක්, දරුණු වධක චිත්තයක් පිහිටන්නේ ය. පුතු කෙරෙහි මව තුළ ත්, මව කෙරෙහි පුතු තුළ ත්, පුතු කෙරෙහි පියා තුළ ත්, පියා කෙරෙහි පුතු තුළ ත්, සොයුරා කෙරෙහි සොයුරා තුළ ත්, සොයුරිය කෙරෙහි සොයුරා තුළ ත්, සොයුරා කෙරෙහි සොයුරිය තුළ ත්, දරුණු වෛරයක් පිහිටන්නේ ය. දරුණු ද්වේෂයක්, දරුණු මානසික ආවේගයක්, දරුණු වධක චිත්තයක් පිහිටන්නේ ය.

මහණෙනි, දස වස් ආයු ඇති මිනිසුන් අතර සත් දිනක ආයුධ අන්තඃකල්පය වන්නේ ය. ඔවුහු ඔවුනොවුන් කෙරෙහි මෘග හැඟීම ලබන්නේ ය. ඔවුන්ගේ අත්වල තියුණු ආයුධ පහළ වන්නේ ය. ඔවුහු ඒ තියුණු ආයුධයෙන් ‘මූ මුර්ගයෙක්, මූ මුර්ගයෙක්’ යනුවෙන් ඔවුනොවුන් මරාගන්නාහු ය.

එකල්හී මහණෙනි, ඒ සත්වයන් අතර ඇතැම් කෙනෙකුට මේ අදහස වන්නේ ය. ‘අපි කිසිවෙකු ත් නොමරමු. කිසි කෙනෙක් අප ව ද නොමරත්වා. යම් හෙයකින් අපි තණ වදුලකට හෝ වන වදුලකට හෝ රුක් වදුලකට හෝ නදී දුර්ගයකට හෝ විෂම පර්වතයකට හෝ පිවිස වන මුල් ගෙඩි ආදියෙන් යැපෙන්නෙමු නම් යෙහෙකි’ යි. ඔවුහු තණ වදුලකට හෝ වන වදුලකට හෝ රුක් වදුලකට හෝ නදී දුර්ගයකට හෝ විෂම පර්වතයකට හෝ පිවිස වන මුල් ගෙඩි ආදියෙන් යැපෙන්නාහ. ඒ සත් දින ඇවෑමෙන් ඔවුහු තෘණ වදුලෙන්, වන වදුලෙන්, රුක් වදුලෙන්, නදී දුර්ගයෙන්, විෂම පර්වතයෙන් නික්ම අවුත් ඔවුනොවුන් වැළඳගෙන සතුටු වන්නාහ. සනසා ගන්නාහ. ‘භවත් සත්වය, දකින ලද්දේ ය. ජීවත් වෙහි? භවත් සත්වය, දකින ලද්දේ ය. ජීවත් වෙහි?’ යි.

ඉක්බිති මහණෙනි, ඒ සත්වයන් හට මේ අදහස ඇතිවන්නේ ය. ‘අපි අකුසල් දහම් සමාදන් ව සිටි නිසාවෙන් මෙබඳු වූ මහත් වූ ඥාති ව්‍යසනයකට පත් වුණෙමු. යම් හෙයකින් අපි කුසල් කරන්නෙමු නම් මැනැව.

කුමන කුසලයක් කරමු ද? යම් හෙයකින් අපි මනුෂ්‍ය ඝාතනයෙන් වැළකෙමු නම්, මේ කුසල ධර්මය සමාදන්ව පවතින්නෙමු නම් මැනැව’ යි ඔවුහු මනුෂ්‍ය ඝාතනයෙන් වළකින්නාහ. මේ කුසල ධර්මය සමාදන් ව පවතින්නාහ. ඔවුහු කුසල ධර්මයන්ගේ සමාදන් වීම හේතුවෙන් ආයුෂයෙන් ද වැඩෙන්නාහු ය. පැහැයෙන් ද වැඩෙන්නාහු ය. ආයුෂයෙන් ද වැඩෙන, මනා පැහැයෙන් ද වැඩෙන, ඒ දස වස් ආයු ඇති මිනිසුන්ගේ දරුවෝ විසි වස් ආයුෂ ඇත්තෝ වන්නාහ.

එකල්හී මහණෙනි, ඒ සත්වයන්ට මේ අදහස ඇතිවන්නේ ය. ‘අපි වනාහී කුසල් දහම් සමාදන් වීම හේතුවෙන් ආයුෂයෙනුත් වැඩෙමු. මනා පැහැයෙනුත් වැඩෙමු. යම් හෙයකින් අපි බොහෝ සෙයින් කුසල් කරන්නෙමු නම් මැනැව. කුමන කුසලයක් කරමු ද? එසේ නම් අපි සොරකමින් වැළකෙමු නම්, මේ කුසල ධර්මය සමාදන්ව පවතින්නෙමු නම් මැනැව’ යි ඔවුහු ප්‍රාණඝාතයෙන් වළකින්නාහ. සොරකමින් වළකින්නාහ. මේ කුසල ධර්මය සමාදන් ව පවතින්නාහ. ඔවුහු කුසල ධර්මයන්ගේ සමාදන් වීම හේතුවෙන් ආයුෂයෙන් ද වැඩෙන්නාහු ය. පැහැයෙන් ද වැඩෙන්නාහු ය. ආයුෂයෙන් ද වැඩෙන, මනා පැහැයෙන් ද වැඩෙන, ඒ විසි වස් ආයු ඇති මිනිසුන්ගේ දරුවෝ සතළිස් වස් ආයුෂ ඇත්තෝ වන්නාහ.

එකල්හී මහණෙනි, ඒ සත්වයන්ට මේ අදහස ඇතිවන්නේ ය. ‘අපි වනාහී කුසල් දහම් සමාදන් වීම හේතුවෙන් ආයුෂයෙනුත් වැඩෙමු. මනා පැහැයෙනුත් වැඩෙමු. යම් හෙයකින් අපි බොහෝ සෙයින් කුසල් කරන්නෙමු නම් මැනැව. කුමන කුසලයක් කරමු ද? එසේ නම් අපි කාමයේ වරදවා හැසිරීමෙන් වැළකෙමු නම්, මේ කුසල ධර්මය සමාදන්ව පවතින්නෙමු නම් මැනැව’ යි ඔවුහු ප්‍රාණඝාතයෙන් වළකින්නාහ. සොරකමින් වළකින්නාහ. කාමයේ වරදවා හැසිරීමෙන් වළකින්නාහ. මේ කුසල ධර්මය සමාදන් ව පවතින්නාහ. ඔවුහු කුසල ධර්මයන්ගේ සමාදන් වීම හේතුවෙන් ආයුෂයෙන් ද වැඩෙන්නාහු ය. පැහැයෙන් ද වැඩෙන්නාහු ය. ආයුෂයෙන් ද වැඩෙන, මනා පැහැයෙන් ද වැඩෙන, ඒ සතළිස් වස් ආයු ඇති මිනිසුන්ගේ දරුවෝ අසූ වස් ආයුෂ ඇත්තෝ වන්නාහ.

එකල්හී මහණෙනි, ඒ සත්වයන්ට මේ අදහස ඇතිවන්නේ ය. ‘අපි වනාහී කුසල් දහම් සමාදන් වීම හේතුවෙන් ආයුෂයෙනුත් වැඩෙමු. මනා පැහැයෙනුත් වැඩෙමු. යම් හෙයකින් අපි බොහෝ සෙයින් කුසල් කරන්නෙමු නම් මැනැව. කුමන කුසලයක් කරමු ද? එසේ නම් අපි බොරු කීමෙන් වළකිමු නම්, මේ කුසල ධර්මය සමාදන්ව පවතින්නෙමු නම් මැනැව’ යි ඔවුහු ප්‍රාණඝාතයෙන් වළකින්නාහ. සොරකමින් වළකින්නාහ. කාමයේ වරදවා හැසිරීමෙන් වළකින්නාහ. බොරු කීමෙන් වළකින්නාහ. මේ කුසල ධර්මය සමාදන් ව පවතින්නාහ. ඔවුහු කුසල ධර්මයන්ගේ සමාදන් වීම හේතුවෙන් ආයුෂයෙන් ද වැඩෙන්නාහු ය. පැහැයෙන් ද වැඩෙන්නාහු ය. ආයුෂයෙන් ද වැඩෙන, මනා පැහැයෙන් ද වැඩෙන, ඒ අසූ වස් ආයු ඇති මිනිසුන්ගේ දරුවෝ එකසිය හැට වස් ආයුෂ ඇත්තෝ වන්නාහ.

එකල්හී මහණෙනි, ඒ සත්වයන්ට මේ අදහස ඇතිවන්නේ ය. ‘අපි වනාහී කුසල් දහම් සමාදන් වීම හේතුවෙන් ආයුෂයෙනුත් වැඩෙමු. මනා පැහැයෙනුත් වැඩෙමු. යම් හෙයකින් අපි බොහෝ සෙයින් කුසල් කරන්නෙමු නම් මැනැව. කුමන කුසලයක් කරමු ද? එසේ නම් අපි කේළාම් කීමෙන් වැළකෙමු නම්, මේ කුසල ධර්මය සමාදන්ව පවතින්නෙමු නම් මැනැව’ යි ඔවුහු ප්‍රාණඝාතයෙන් වළකින්නාහ. සොරකමින් වළකින්නාහ. කාමයේ වරදවා හැසිරීමෙන් වළකින්නාහ. බොරු කීමෙන් වළකින්නාහ. කේළාම් කීමෙන් වළකින්නාහ. මේ කුසල ධර්මය සමාදන් ව පවතින්නාහ. ඔවුහු කුසල ධර්මයන්ගේ සමාදන් වීම හේතුවෙන් ආයුෂයෙන් ද වැඩෙන්නාහු ය. පැහැයෙන් ද වැඩෙන්නාහු ය. ආයුෂයෙන් ද වැඩෙන, මනා පැහැයෙන් ද වැඩෙන, ඒ එකසිය හැට වස් ආයු ඇති මිනිසුන්ගේ දරුවෝ තුන්සිය විසි වස් ආයුෂ ඇත්තෝ වන්නාහ.

එකල්හී මහණෙනි, ඒ සත්වයන්ට මේ අදහස ඇතිවන්නේ ය. ‘අපි වනාහී කුසල් දහම් සමාදන් වීම හේතුවෙන් ආයුෂයෙනුත් වැඩෙමු. මනා පැහැයෙනුත් වැඩෙමු. යම් හෙයකින් අපි බොහෝ සෙයින් කුසල් කරන්නෙමු නම් මැනැව. කුමන කුසලයක් කරමු ද? එසේ නම් අපි දරුණු වචනයෙන් බැණ වැදීමෙන් වැළකෙමු නම්, මේ කුසල ධර්මය සමාදන්ව පවතින්නෙමු නම් මැනැව’ යි ඔවුහු ප්‍රාණඝාතයෙන් වළකින්නාහ. සොරකමින් වළකින්නාහ. කාමයේ වරදවා හැසිරීමෙන් වළකින්නාහ. බොරු කීමෙන් වළකින්නාහ. කේළාම් කීමෙන් වළකින්නාහ. දරුණු වචනයෙන් බැණ වැදීමෙන් වළකින්නාහ. මේ කුසල ධර්මය සමාදන් ව පවතින්නාහ. ඔවුහු කුසල ධර්මයන්ගේ සමාදන් වීම හේතුවෙන් ආයුෂයෙන් ද වැඩෙන්නාහු ය. පැහැයෙන් ද වැඩෙන්නාහු ය. ආයුෂයෙන් ද වැඩෙන, මනා පැහැයෙන් ද වැඩෙන, ඒ තුන්සිය විසි වස් ආයු ඇති මිනිසුන්ගේ දරුවෝ හයසිය හතළිස් වස් ආයුෂ ඇත්තෝ වන්නාහ.

එකල්හී මහණෙනි, ඒ සත්වයන්ට මේ අදහස ඇතිවන්නේ ය. ‘අපි වනාහී කුසල් දහම් සමාදන් වීම හේතුවෙන් ආයුෂයෙනුත් වැඩෙමු. මනා පැහැයෙනුත් වැඩෙමු. යම් හෙයකින් අපි බොහෝ සෙයින් කුසල් කරන්නෙමු නම් මැනැව. කුමන කුසලයක් කරමු ද? එසේ නම් අපි හිස් වචන කීමෙන් වැළකෙමු නම්, මේ කුසල ධර්මය සමාදන්ව පවතින්නෙමු නම් මැනැව’ යි ඔවුහු ප්‍රාණඝාතයෙන් වළකින්නාහ. සොරකමින් වළකින්නාහ. කාමයේ වරදවා හැසිරීමෙන් වළකින්නාහ. බොරු කීමෙන් වළකින්නාහ. කේළාම් කීමෙන් වළකින්නාහ. දරුණු වචනයෙන් බැණ වැදීමෙන් වළකින්නාහ. හිස් වචන කීමෙන් වළකින්නාහ. මේ කුසල ධර්මය සමාදන් ව පවතින්නාහ. ඔවුහු කුසල ධර්මයන්ගේ සමාදන් වීම හේතුවෙන් ආයුෂයෙන් ද වැඩෙන්නාහු ය. පැහැයෙන් ද වැඩෙන්නාහු ය. ආයුෂයෙන් ද වැඩෙන, මනා පැහැයෙන් ද වැඩෙන, ඒ හයසිය සතළිස් වස් ආයු ඇති මිනිසුන්ගේ දරුවෝ දෙදහස් වස් ආයුෂ ඇත්තෝ වන්නාහ.

එකල්හී මහණෙනි, ඒ සත්වයන්ට මේ අදහස ඇතිවන්නේ ය. ‘අපි වනාහී කුසල් දහම් සමාදන් වීම හේතුවෙන් ආයුෂයෙනුත් වැඩෙමු. මනා පැහැයෙනුත් වැඩෙමු. යම් හෙයකින් අපි බොහෝ සෙයින් කුසල් කරන්නෙමු නම් මැනැව. කුමන කුසලයක් කරමු ද? එසේ නම් අපි අනුන් සතු තමන් සතු කරගැනීමේ ආශාව අත්හරින්නෙමු නම්, මේ කුසල ධර්මය සමාදන්ව පවතින්නෙමු නම් මැනැව’ යි ඔවුහු ප්‍රාණඝාතයෙන් වළකින්නාහ. සොරකමින් වළකින්නාහ. කාමයේ වරදවා හැසිරීමෙන් වළකින්නාහ. බොරු කීමෙන් වළකින්නාහ. කේළාම් කීමෙන් වළකින්නාහ. දරුණු වචනයෙන් බැණ වැදීමෙන් වළකින්නාහ. හිස් වචන කීමෙන් වළකින්නාහ. අනුන් සතු දෙය තමන් සතු කරගැනීමේ ආශාව අත්හරින්නාහ. මේ කුසල ධර්මය සමාදන් ව පවතින්නාහ. ඔවුහු කුසල ධර්මයන්ගේ සමාදන් වීම හේතුවෙන් ආයුෂයෙන් ද වැඩෙන්නාහු ය. පැහැයෙන් ද වැඩෙන්නාහු ය. ආයුෂයෙන් ද වැඩෙන, මනා පැහැයෙන් ද වැඩෙන, ඒ දෙදහස් වස් ආයු ඇති මිනිසුන්ගේ දරුවෝ හාරදහස් වස් ආයුෂ ඇත්තෝ වන්නාහ.

එකල්හී මහණෙනි, ඒ සත්වයන්ට මේ අදහස ඇතිවන්නේ ය. ‘අපි වනාහී කුසල් දහම් සමාදන් වීම හේතුවෙන් ආයුෂයෙනුත් වැඩෙමු. මනා පැහැයෙනුත් වැඩෙමු. යම් හෙයකින් අපි බොහෝ සෙයින් කුසල් කරන්නෙමු නම් මැනැව. කුමන කුසලයක් කරමු ද? එසේ නම් අපි ද්වේෂය දුරු කරන්නෙමු නම්, මේ කුසල ධර්මය සමාදන්ව පවතින්නෙමු නම් මැනැව’ යි ඔවුහු ප්‍රාණඝාතයෙන් වළකින්නාහ. සොරකමින් වළකින්නාහ. කාමයේ වරදවා හැසිරීමෙන් වළකින්නාහ. බොරු කීමෙන් වළකින්නාහ. කේළාම් කීමෙන් වළකින්නාහ. දරුණු වචනයෙන් බැණ වැදීමෙන් වළකින්නාහ. හිස් වචන කීමෙන් වළකින්නාහ. අනුන් සතු දෙය තමන් සතු කරගැනීමේ ආශාව අත්හරින්නාහ. ද්වේෂය දුරුකරන්නාහ. මේ කුසල ධර්මය සමාදන් ව පවතින්නාහ. ඔවුහු කුසල ධර්මයන්ගේ සමාදන් වීම හේතුවෙන් ආයුෂයෙන් ද වැඩෙන්නාහු ය. පැහැයෙන් ද වැඩෙන්නාහු ය. ආයුෂයෙන් ද වැඩෙන, මනා පැහැයෙන් ද වැඩෙන, ඒ හාරදහස් වස් ආයු ඇති මිනිසුන්ගේ දරුවෝ අටදහස් වස් ආයුෂ ඇත්තෝ වන්නාහ.

එකල්හී මහණෙනි, ඒ සත්වයන්ට මේ අදහස ඇතිවන්නේ ය. ‘අපි වනාහී කුසල් දහම් සමාදන් වීම හේතුවෙන් ආයුෂයෙනුත් වැඩෙමු. මනා පැහැයෙනුත් වැඩෙමු. යම් හෙයකින් අපි බොහෝ සෙයින් කුසල් කරන්නෙමු නම් මැනැව. කුමන කුසලයක් කරමු ද? එසේ නම් අපි මිථ්‍යා දෘෂ්ටිය දුරු කරන්නෙමු නම්, මේ කුසල ධර්මය සමාදන්ව පවතින්නෙමු නම් මැනැව’ යි ඔවුහු ප්‍රාණඝාතයෙන් වළකින්නාහ. සොරකමින් වළකින්නාහ. කාමයේ වරදවා හැසිරීමෙන් වළකින්නාහ. බොරු කීමෙන් වළකින්නාහ. කේළාම් කීමෙන් වළකින්නාහ. දරුණු වචනයෙන් බැණ වැදීමෙන් වළකින්නාහ. හිස් වචන කීමෙන් වළකින්නාහ. අනුන් සතු දෙය තමන් සතු කරගැනීමේ ආශාව අත්හරින්නාහ. ද්වේෂය දුරුකරන්නාහ. මිථ්‍යා දෘෂ්ටිය දුරුකරන්නාහ. මේ කුසල ධර්මය සමාදන් ව පවතින්නාහ. ඔවුහු කුසල ධර්මයන්ගේ සමාදන් වීම හේතුවෙන් ආයුෂයෙන් ද වැඩෙන්නාහු ය. පැහැයෙන් ද වැඩෙන්නාහු ය. ආයුෂයෙන් ද වැඩෙන, මනා පැහැයෙන් ද වැඩෙන, ඒ අටදහස් වස් ආයු ඇති මිනිසුන්ගේ දරුවෝ විසිදහස් වස් ආයුෂ ඇත්තෝ වන්නාහ.

එකල්හී මහණෙනි, ඒ සත්වයන්ට මේ අදහස ඇතිවන්නේ ය. ‘අපි වනාහී කුසල් දහම් සමාදන් වීම හේතුවෙන් ආයුෂයෙනුත් වැඩෙමු. මනා පැහැයෙනුත් වැඩෙමු. යම් හෙයකින් අපි බොහෝ සෙයින් කුසල් කරන්නෙමු නම්, කුමන කුසලයක් කරමු ද? එසේ නම් අපි මේ අකුසල් තුන දුරු කරන්නෙමු නම් මැනැව. එනම් අධර්ම රාගය ත්, විෂම ලෝභය ත්, මිථ්‍යා ධර්මය ත් ය. මේ අකුසල් දුරු කිරීම නම් කුසල ධර්මය සමාදන්ව පවතින්නෙමු නම් මැනැව’ යි ඔවුහු ප්‍රාණඝාතයෙන් වළකින්නාහ. සොරකමින් වළකින්නාහ. කාමයේ වරදවා හැසිරීමෙන් වළකින්නාහ. බොරු කීමෙන් වළකින්නාහ. කේළාම් කීමෙන් වළකින්නාහ. දරුණු වචනයෙන් බැණ වැදීමෙන් වළකින්නාහ. හිස් වචන කීමෙන් වළකින්නාහ. අනුන් සතු දෙය තමන් සතු කරගැනීමේ ආශාව අත්හරින්නාහ. ද්වේෂය දුරුකරන්නාහ. මිථ්‍යා දෘෂ්ටිය දුරුකරන්නාහ. මේ තුන් අකුසලය දුරු කරන්නාහ. එනම් අධර්ම රාගය ත්, විෂම ලෝභය ත්, මිථ්‍යා ධර්මය ත් ය. මේ කුසල ධර්මය සමාදන් ව පවතින්නාහ. ඔවුහු කුසල ධර්මයන්ගේ සමාදන් වීම හේතුවෙන් ආයුෂයෙන් ද වැඩෙන්නාහු ය. පැහැයෙන් ද වැඩෙන්නාහු ය. ආයුෂයෙන් ද වැඩෙන, මනා පැහැයෙන් ද වැඩෙන, ඒ විසිදහස් වස් ආයු ඇති මිනිසුන්ගේ දරුවෝ සතළිස් දහස් වස් ආයුෂ ඇත්තෝ වන්නාහ.

එකල්හී මහණෙනි, ඒ සත්වයන්ට මේ අදහස ඇතිවන්නේ ය. ‘අපි වනාහී කුසල් දහම් සමාදන් වීම හේතුවෙන් ආයුෂයෙනුත් වැඩෙමු. මනා පැහැයෙනුත් වැඩෙමු. යම් හෙයකින් අපි බොහෝ සෙයින් කුසල් කරන්නෙමු නම් මැනැව. කුමන කුසලයක් කරමු ද? එසේ නම් අපි මව්ට සළකන්නෙමු. පියාට සළකන්නෙමු. ශ්‍රමණයින්ට සළකන්නෙමු. බ්‍රාහ්මණයින්ට සළකන්නෙමු. කුල දෙටුවන්ට අවනත වෙමු නම්, මේ කුසල ධර්මය සමාදන්ව පවතින්නෙමු නම් මැනැව’ යි ඔවුහු ප්‍රාණඝාතයෙන් වළකින්නාහ. සොරකමින් වළකින්නාහ. කාමයේ වරදවා හැසිරීමෙන් වළකින්නාහ. බොරු කීමෙන් වළකින්නාහ. කේළාම් කීමෙන් වළකින්නාහ. දරුණු වචනයෙන් බැණ වැදීමෙන් වළකින්නාහ. හිස් වචන කීමෙන් වළකින්නාහ. අනුන් සතු දෙය තමන් සතු කරගැනීමේ ආශාව අත්හරින්නාහ. ද්වේෂය දුරුකරන්නාහ. මිථ්‍යා දෘෂ්ටිය දුරුකරන්නාහ. මේ තුන් අකුසලය දුරු කරන්නාහ. එනම් අධර්ම රාගය ත්, විෂම ලෝභය ත්, මිථ්‍යා ධර්මය ත් ය. මව්ට සළකන්නාහ. පියාට සළකන්නාහ. ශ්‍රමණයින්ට සළකන්නාහ. බ්‍රාහ්මණයින්ට සළකන්නාහ. කුල දෙටුවන්ට අවනත වන්නාහ. මේ කුසල ධර්මය සමාදන් ව පවතින්නාහ. ඔවුහු කුසල ධර්මයන්ගේ සමාදන් වීම හේතුවෙන් ආයුෂයෙන් ද වැඩෙන්නාහු ය. පැහැයෙන් ද වැඩෙන්නාහු ය. ආයුෂයෙන් ද වැඩෙන, මනා පැහැයෙන් ද වැඩෙන, ඒ සතළිස් දහස් වස් ආයු ඇති මිනිසුන්ගේ දරුවෝ අසූ දහස් වස් ආයුෂ ඇත්තෝ වන්නාහ.

මහණෙනි, අසූ දහසක් අවුරුදු ආයු ඇති මිනිසුන් අතර පන්සියයක් අවුරුදු වයසැති කුමරියෝ පතිකුලයට යෑමට සුදුසු වන්නාහ. මහණෙනි, අසූ දහස් වස් ආයු ඇති මිනිසුන් අතර රෝග තුනක් වන්නේ ය. එනම්, ආහාර තෘෂ්ණාව ත්, ආහාර නැතිවීමෙන් වන ක්ලාන්තය ත් සහ ජරා ජීර්ණ වීම ත් ය.

මහණෙනි, මිනිසුන්ගේ ආයුෂ අවුරුදු අසූ දහසක් වූ කල්හී මේ දඹදිව ඉතා සමෘද්ධිමත් ව, සැප සම්පත් ඇති වන්නේ ය. ගම් නියම්ගම්, ජනපද, රාජධානිවල වහළින් වහළට කුකුලෙකුට යා ගත හැකි තරම් බොහෝ ගේ දොර ඇතිවන්නේ ය. මහණෙනි, මිනිසුන්ගේ ආයුෂ අවුරුදු අසු දහසක් වූ කල්හී මේ දඹදිව උණ ගස් වනයක් සෙයින්, බට ගස් වනයක් සෙයින්, අවීචි මහා නරකාදිය සෙයින් බොහෝ මිනිසුන්ගෙන් පිරී ඉතිරී යන්නේ ය.

මහණෙනි, මිනිසුන්ගේ ආයුෂ වසර අසූදහසක් වූ කල්හී මේ බරණැස් නුවර ඉතා සමෘද්ධිමත් සැප සම්පත් ඇති, බොහෝ ජනයා සිටින, මිනිසුන්ගෙන් ගැවසී ගත්, සුලභ ආහාරපාන ඇති, කේතුමතී නම් රාජධානියක් වන්නේ ය.

මහණෙනි, මිනිසුන් අතර අසූ දහස් වසරක් ආයු ඇති කල්හී මේ දඹදිව කේතුමතී රාජධානිය ප්‍රමුඛ අසූ හාර දහසක් නගරයෝ වන්නාහ. මහණෙනි, මිනිසුන් අතර අසූ දහස් වසරක් ආයු ඇති කල්හී කේතුමතී රාජධානියෙහි සිව් මහා සමුදුරු සීමා කොට ගත්, සිව් මහා දිවයිනට අධිපති, සතුරන් දිනා ජයගත්, ජනපදයන්හි තහවුරු බවට පත්, සප්ත රත්නයෙන් සමන්විත, ධාර්මික වූ, ධර්මරාජ වූ සංඛ නම් චක්‍රවර්තී රජෙක් පහළ වන්නේ ය. ඔහුට මේ සප්ත රත්නයෝ වන්නාහ. එනම්; චක්‍ර රත්නය ය, හස්ති රත්නය ය, අශ්ව රත්නය ය, මාණික්‍ය රත්නය ය, ස්ත්‍රී රත්නය ය, ගෘහපති රත්නය ය සහ සත්වෙනි පරිනායක රත්නය යි. ඔහුට ශූර වීර වූ පරසෙන් මඬින දහසකට වැඩි පුත්‍රයෝ වන්නාහ. ඔහු සයුර කෙළවර කොට ගත් මේ මහා පොළොව දඬුවමින් තොර ව, ආයුධයෙන් තොර ව, ධාර්මික ව ජයගෙන, අධිපති ව වසන්නේ ය.

මහණෙනි, මිනිසුන්ගේ ආයුෂ වසර අසූදහසක් වූ කල්හී අරහත් සම්මා සම්බුදු, විජ්ජා චරණ සම්පන්න, සුගත, ලෝකවිදූ, අනුත්තරෝ පුරිසදම්ම සාරථී, සත්ථා දේවමනුස්සානං, බුද්ධ, භගවා යන ගුණැති මෛත්‍රේය නම් භාග්‍යවතුන් වහන්සේ ලෝකයෙහි පහළ වන්නාහ. මෙකල්හී ලෝකයෙහි අරහත් සම්මා සම්බුදු, විජ්ජා චරණ සම්පන්න, සුගත, ලෝකවිදූ, අනුත්තරෝ පුරිසදම්ම සාරථී, සත්ථා දේවමනුස්සානං, බුද්ධ, භගවා යන ගුණැති මම ලොව පහළ වූයෙම් යම් සේ ද, එසේ ය.

ඒ මෛත්‍රේය භාග්‍යවතුන් වහන්සේ දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙව් මිනිස් ප්‍රජාවෙන් යුතු, මේ ලෝකය ස්වකීය විශිෂ්ට ඥානයෙන් සාක්ෂාත් කොට ප්‍රකාශ කරන්නාහ. මෙකල්හී මම දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙව් මිනිස් ප්‍රජාවෙන් යුතු, මේ ලෝකය ස්වකීය විශිෂ්ට ඥානයෙන් සාක්ෂාත් කොට යම් සේ ප්‍රකාශ කරම් ද, එසේ ය.

ඒ මෛත්‍රේය භාග්‍යවතුන් වහන්සේ ධර්මය දේශනා කරන්නාහ. මුල කල්‍යාණ වූ, මැද කල්‍යාණ වූ, අවසානය කල්‍යාණ වූ, අර්ථ සහිත, ව්‍යංජන සහිත, මුළුමනින් ම පිරිපුන් පිරිසිදු මාර්ග බ්‍රහ්මචරියාව ප්‍රකාශ කරන්නාහ. මෙකල්හී මම යම් අයුරින් දහම් දෙසම් ද, යම් අයුරින් මුල කල්‍යාණ වූ, මැද කල්‍යාණ වූ, අවසානය කල්‍යාණ වූ, අර්ථ සහිත, ව්‍යංජන සහිත, මුළුමනින් ම පිරිපුන් පිරිසිදු මාර්ග බ්‍රහ්මචරියාව ප්‍රකාශ කරම් ද, එසේ ය.

ඒ මෛත්‍රේය භාග්‍යවතුන් වහන්සේ නොයෙක් සිය දහස් ගණන් භික්ෂු සංඝයා පරිහරණය කරන්නාහ. මෙකල්හී මම යම් සේ නොයෙක් සියගණන් භික්ෂු සංඝයා පරිහරණය කරම් ද, එසේ ය.

එකල්හී මහණෙනි, මහා පනාද නම් රජු විසින් කරවන ලද යම් ඒ ප්‍රාසාදයක් ගංගා නදියෙහි ගිලී ඇත්තේ ද, ඒ ප්‍රාසාදය ගොඩට ගෙන සංඛ නම් සක්විති රජු එහි වාසය කොට එය අත්හැර ශ්‍රමණ බ්‍රාහ්මණ දුගී මගී යාචකාදීන්ට දන් දී, අරහත් සම්මා සම්බුදු මෛත්‍රේය භාග්‍යවතුන් වහන්සේ සමීපයෙහි කෙස් රැවුල් බහා, කසට පෙවූ වත් හැඳ, ගිහි ගෙයින් නික්ම අනගාරික ව පැවිදි වන්නේ ය. ඔහු එසේ පැවිදි වූයේ, හුදෙකලාව, තනි ව, අප්‍රමාදී ව, කෙලෙස් තවන වීරිය ඇති ව, දහමට දිවි පුදා වාසය කරන්නේ, නොබෝ කලකින් ම යම් අරුතක් උදෙසා කුලපුත්‍රයෝ මනාකොට ගිහි ගෙයින් නික්ම අනගාරික ව පැවිදි වෙත් ද, ඒ බඹසරෙහි අවසානය වූ අනුත්තර වූ රහත් බව මේ ජීවිතයේ දී ම සිය විශිෂ්ට නුවණින් සාක්ෂාත් කොට පැමිණ වාසය කරන්නේ ය.

මහණෙනි, තමා දූපතක් බඳු කොට වාසය කරව්. තමා සරණට ගනිව්. අන් කෙනෙකු සරණට නොගනිව්. ධර්මය දූපතක් බඳු කොට වාසය කරව්. ධර්මය සරණට ගනිව්. අන් දෙයක් සරණට නොගනිව්.

මහණෙනි, භික්ෂුවක් තමා ව දූපතක් බඳු කොට, තමා සරණට ගෙන, අන් කෙනෙකු සරණට නොගෙන වාසය කරන්නේ කෙසේ ද? ධර්මය දූපතක් බඳු කොට, ධර්මය සරණට ගෙන, අන් දෙයක් සරණට නොගෙන වාසය කරන්නේ කෙසේ ද?

මහණෙනි, මෙහි භික්ෂුව කෙලෙස් තවන වීර්යයෙන් යුතුව, නුවණින් යුතුව, මනා සිහියෙන් යුතුව, ලෝකයෙහි ඇලීම් ගැටීම් දුරුකොට කය පිළිබඳ ව කායානුපස්සනාවෙන් වාසය කරයි. කෙලෙස් තවන වීර්යයෙන් යුතුව, නුවණින් යුතුව, මනා සිහියෙන් යුතුව, ලෝකයෙහි ඇලීම් ගැටීම් දුරුකොට විඳීම් පිළිබඳ ව වේදනානුපස්සනාවෙන් වාසය කරයි. කෙලෙස් තවන වීර්යයෙන් යුතුව, නුවණින් යුතුව, මනා සිහියෙන් යුතුව, ලෝකයෙහි ඇලීම් ගැටීම් දුරුකොට සිත පිළිබඳ ව චිත්තානුපස්සනාවෙන් වාසය කරයි. කෙලෙස් තවන වීර්යයෙන් යුතුව, නුවණින් යුතුව, මනා සිහියෙන් යුතුව, ලෝකයෙහි ඇලීම් ගැටීම් දුරුකොට ධර්මයන් පිළිබඳ ව ධම්මානුපස්සනාවෙන් වාසය කරයි.

මහණෙනි, භික්ෂුව තමා දූපතක් බඳු කොට, තමා ව සරණට ගෙන, අන් කෙනෙකු සරණට නොගෙන, ධර්මය දූපතක් බඳු කොට, ධර්මය සරණට ගෙන, අන් දෙයක් සරණට නොගෙන වාසය කරන්නේ මෙසේ ය.

මහණෙනි, තම පියාගෙන් ලද උරුමය වන සතර සතිපට්ඨානය නම් වූ තමන් සිටිය යුතු තැනෙහි හැසිරෙව්. මහණෙනි, තම පියාගෙන් ලද උරුමය වන සතර සතිපට්ඨානය නම් වූ, තමන් සිටිය යුතු තැන හැසිරෙන විට ආයුෂයෙනුත් වැඩෙන්නහු ය. වර්ණයෙනුත් වැඩෙන්නහු ය. සැපයෙනුත් වැඩෙන්නහු ය. භෝගයෙනුත් වැඩෙන්නහු ය. බලයෙනුත් වැඩෙන්නහු ය.

මහණෙනි, භික්ෂුවගේ ආයුෂයෙහිලා වැඩීම යනු කුමක් ද? මහණෙනි, මෙහිලා භික්ෂුව ඡන්ද සමාධි පධාන සංඛාරයෙන් යුතුව ඉර්ධිපාදය වඩයි. විරිය සමාධි ….(පෙ)…. චිත්ත සමාධි ….(පෙ)…. වීමංසා සමාධි පධාන සංඛාරයෙන් යුතුව ඉර්ධිපාදය වඩයි. ඒ භික්ෂුව මේ සතර ඉර්ධිපාදයන් භාවිත කළ බැවින්, බහුල කළ බැවින්, කැමති වන්නේ නම් කල්පයක් හෝ කල්පයකට වැඩි කලක් හෝ සිටින්නේ ය. මහණෙනි, මේ වනාහී භික්ෂුවගේ ආයුෂයට කරුණ යි.

මහණෙනි, භික්ෂුවගේ වර්ණයෙහි වැඩීම යනු කුමක් ද? මහණෙනි, මෙහිලා භික්ෂුව සිල්වත් වෙයි. ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවර වූයේ වෙයි. මනා ඇවැතුම් පැවතුමෙන් යුක්ත වූයේ වෙයි. අනුමාත්‍ර වූ වරදෙහි ත් භය දකින්නේ, සික පදයන්හි සමාදන් ව හික්මෙයි. මහණෙනි, මෙය වනාහී භික්ෂුවගේ වර්ණයට කරුණ යි.

මහණෙනි, භික්ෂුවගේ සැපයෙහි වැඩීම යනු කුමක් ද? මහණෙනි, මෙහිලා භික්ෂුව කාමයන්ගෙන් වෙන් ව, අකුසල් දහමෙන් වෙන් ව, විතර්ක විචාර සහිත, විවේකයෙන් හටගත් ප්‍රීති සැපය ඇති පළමු ධ්‍යානය උපදවාගෙන වාසය කරයි. විතර්ක විචාරයන්ගේ සංසිඳීමෙන් ….(පෙ)…. දෙවෙනි ධ්‍යානය ….(පෙ)…. තුන්වෙනි ධ්‍යානය ….(පෙ)…. සිව්වෙනි ධ්‍යානය උපදවා ගෙන වාසය කරයි. මහණෙනි, මෙය වනාහී භික්ෂුවගේ සැපයට කරුණ යි.

මහණෙනි, භික්ෂුවගේ භෝගයෙහි වැඩීම කුමක් ද? මහණෙනි, මෙහිලා භික්ෂුව මෛත්‍රී සහගත සිතින් එක් දිශාවක් පතුරුවා වාසය කරයි. එසේ ම දෙවෙනි දිශාව ත්, එසේ ම තුන්වෙනි දිශාව ත්, එසේ ම සිව්වෙනි දිශාවත් ය. මෙසේ උඩ – යට – සරස හැමතන්හි තමා හා සමකොට සියළු ලෝක සත්වයා කෙරෙහි විපුල වූ, මහද්ගත වූ, අප්‍රමාණ වූ, අවෛරී වූ, තරහ නැති මෛත්‍රී සහගත සිතින් පතුරුවා වාසය කරයි. මහණෙනි, මෙහිලා භික්ෂුව කරුණා සහගත සිතින් ….(පෙ)…. මුදිතා සහගත සිතින් ….(පෙ)…. උපේක්ෂා සහගත සිතින් එක් දිශාවක් පතුරුවා වාසය කරයි. එසේ ම දෙවෙනි දිශාව ත්, එසේ ම තුන්වෙනි දිශාව ත්, එසේ ම සිව්වෙනි දිශාවත් ය. මෙසේ උඩ – යට – සරස හැමතන්හි තමා හා සමකොට සියළු ලෝක සත්වයා කෙරෙහි විපුල වූ, මහද්ගත වූ, අප්‍රමාණ වූ, අවෛරී වූ, තරහ නැති උපේක්ෂා සහගත සිතින් පතුරුවා වාසය කරයි. මහණෙනි, මෙය වනාහී භික්ෂුවගේ භෝගයෙහි වැඩීම යි.

මහණෙනි, භික්ෂුවගේ බලයෙහි වැඩීම යනු කුමක් ද? මහණෙනි, මෙහිලා භික්ෂුව ආශ්‍රවයන්ගේ ක්ෂය වීමෙන් අනාශ්‍රව වූ චිත්ත විමුක්තිය ත්, ප්‍රඥා විමුක්තිය ත්, මෙලොව දී ම සිය විශිෂ්ට නුවණින් සාක්ෂාත් කොට පැමිණ වාසය කරයි. මහණෙනි, මෙය වනාහී භික්ෂුව බලයෙන් වැඩීම යි.

මහණෙනි, යමක් මෙසේ දුක සේ මැඩලිය යුත්තේ ද, මහණෙනි, යම් බඳු මේ මාර බලය තරම් අන්‍ය වූ එක් බලයක් වත් මම නොදකිමි. මහණෙනි, කුසල් දහම්හි සමාදන් ව යෙදී සිටීම හේතුවෙන් මෙසේ මේ පින වැඩෙයි.”

භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සතුටු සිත් ඇති ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේගේ භාෂිතය සතුටින් පිළිගත්තාහු ය.

සාධූ! සාධූ! සාධූ!
`;

export default ChakkawaththiSinhala;