const GirimanandSinhala = `
මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවත් බුදුරජාණන් වහන්සේ සැවැත් නුවර ජේතවන නම් ආරාමයෙහි වැඩ වසන සේක. එකල්හි ගිරිමානන්ද ස්ථවිර තෙමේ හටගත් ආබාධ ඇත්තේ, දුකට පැමිණියේ, දැඩි ගිලන් බව ඇත්තේ වෙයි. 

එකල්හි ආයුෂ්මත් ආනන්ද ස්ථවිර තෙමේ භාග්‍යවතුන් වහන්සේ කරා එළඹියේ ය. එළඹ, භාග්‍යවතුන් වහන්සේ සකසා වැඳ එකත් පස්ව හුන්නේය. එකත්පසව හුන් ආනන්ද ස්ථවිර තෙමේ භාග්‍යවතුන් වහන්සේට මෙසේ කීයේ ය.

භාග්‍යවතුන් වහන්ස, ආයුෂ්මත් ගිරිමානන්ද ස්ථවිර තෙමේ උපන් ආබාධ ඇත්තේ, පැමිණි දුක් ඇත්තේ, දැඩිව ගිලන් වූයේ වෙයි. භාග්‍යවතුන් වහන්සේ අනුකම්පා පිණිස ආයුෂ්මත් ගිරිමානන්ද තෙරුන් කරා වඩනා සේක් නම් මැනවි.

ආනන්දයෙනි, ඉදින් තෙපි ගිරිමානන්ද මහණහු වෙත එළඹ දශ සංඥා කියහු නම්, යම් හෙයකින් දශ සංඥා අසා ගිරිමානන්ද මහණහු ගේ ඒ ආබාධය හේතු වශයෙන් සංසිඳෙන්නේය. කවර දශයෙක් (දහයක්) ද යත්?

අනිත්‍ය සංඥාය, අනාත්ම සංඥාය, අශුභ සංඥාය, ආදීනව සංඥාය, ප්‍රහාණ සංඥාය, විරාග සංඥාය, නිරෝධ සංඥාය, සියලු ලෝකයෙහි කලකිරීම් සංඛ්‍යාත සංඥාය, සියලු සංස්කාරයන්හි අනිත්‍ය සංඥාය, ආනපාන සතිය යන දශයයි.

ආනන්දයෙනි, අනිත්‍ය සංඥාව කවරී ද?

ආනන්දයෙනි, මෙ සස්නෙහි මහණ වලට ගියේ වේවයි, රුක් මුලට ගියේ වේවයි, ශූන්‍යාගාරයට ගියේ වේවයි මෙසේ නුවණින් සලකන්නේ ය. රූපය අනිත්‍යය, වේදනා අනිත්‍යය, සංඥා අනිත්‍යය, සංස්කාරයෝ අනිත්‍යයහ, විඥානය අනිත්‍යය, මෙසේ මේ පඤ්චොපාදානස්ඛන්ධයන්හි අනිත්‍යානුදර්ශීව වසයි.

ආනන්දයෙනි, මේ අනිත්‍යසංඥායයි කියනු ලැබේ.

ආනන්දයෙනි, අනාත්ම සංඥා කවරයත්?

ආනන්දයෙනි, මෙ සස්නෙහි මහණ වලට ගියේ වේවයි, ………………… මෙසේ නුවණින් සලකන්නේ ය.  චක්ෂුව අනාත්මය. රූප අනාත්මය, ශ්‍රොතස අනාත්මය, ශබ්ද අනාත්මය, ඝ්‍රාණය අනාත්මය, ගන්ධය අනාත්මය, ජිව්හා අනාත්මය, රස අනාත්මය, කය අනාත්මය, ධර්ම අනාත්මයයි මෙසේ සැවැදෑරුම් අධ්‍යාත්මික බාහිර ආයතනයන්හි අනාත්මානුදර්ශීව වාසය කරයි. 

ආනන්දයෙනි, මේ අනාත්ම සංඥා යයි කියනු ලැබේ.

ආනන්දයෙනි, අශුභ සංඥා කවර යත්?

ආනන්දයෙනි, මේ සස්නෙහි මහණ පා තලින් උඩ කෙස් මතුයෙන් සම හිම්කොට ඇති නානාප්‍රකාර අශුචියෙන් පිරි මෙම කය ප්‍රත්‍යවේක්ෂා කරන්නේ ය. මේ කයෙහි කේශයෝ ය, රෝමයෝ ය, නිය ය, දත් ය, සම් ය, මාංශ ය, නහර ය, ඇට ය, ඇට මිදුලු ය, වකුගඩු ය, හෘදය, අක්මා ය, දලබුය, බඩදිව ය, පපු කැණය, අතුනු ය, අතුනු බහනය, ඖදර්‍ය්‍යය, පුරීෂය, පිත් ය, ශ්ලෙස්මා ය, පූයා ය, ලේ ය, සෝදි ය, මේදස් ය, කඳුළු ය, වුරුණු තෙල් ය, කෙල ය, මුකුනු ය, සඳ මුදුලු ය, මූ ය යන මොහු ඇතැයි මෙසේ මේ කයෙහි අශුභානුදර්ශීව වාසය කරයි. 

ආනන්දයෙනි, මේ අශුභ සංඥා යයි කියනු ලැබේ.

ආනන්දයෙනි, ආදීනව සංඥා කවර යත්?

ආනන්දයෙනි, මේ සස්නෙහි මහණ වලට යියේ වේවයි, රුක්මුලට ගියේ වේවයි, ශුන්‍යාගාරයට ගියේ වේවයි, මෙසේ සලකන්නේය. බොහෝ දුක් ඇති මේ කාය බොහෝ ආදීනව ඇත්තේය. මෙසේ මේ කයෙහි විවිධ ආබාධයෝ උපදනාහ. ඔහු කවරහ යත්? චක්ඛු රෝග ය, සොත රෝග ය, ඝාන රෝග ය, ජිව්හා රෝග ය, කාය රෝග ය, සිස රෝග ය, කණ්ණ රෝග ය, මුඛ රෝග ය, දන්ත රෝග ය, කාස ය, ශ්වාස ය, පිනස ය, දාහ ය,  ජ්වර ය, කුච්ඡි රෝග ය, මුර්ජා ය, පක්ඛන්දිකා ය, ශූලා ය, විශුවිකා ය, කුෂ්ට ය, ගණ්ඩය, කිලාස ය, ස්වාස ය, අපස්මාර ය, දද්දු ය, කණ්ඩු ය, රඛසා ය, විතච්ඡිකා ය, ලෝහිත පිත්ත ය, මධුමේහ ය, අංස ය, පිළිකා ය, භගන්දරා ය, පිතින් උපදනා ආබාධ ය, වාතයෙන් උපදනා ආබාධ ය, සන්නිපාතික ආබාධ ය, සෘතුපරිණාමයෙන් වන ආබාධ ය, විෂම පරිහාරයෙන් උපදනා ආබාධ ය, උපක්‍රමයෙන් උපදනා ආබාධ ය, කර්මවිපාකයෙන් උපදනා ආබාධ ය, ශීත ය, උෂ්ණ ය, සා ය, පවස ය, උච්චාර ය, පස්සාව ය යි, මෙසේ මේ කයෙහි ආදීනවානුදර්ශිව වෙසෙයි.

ආනන්දයෙනි මේ ආදිනවානුසංඥායයි කියනු ලැබේ.

ආනන්දයෙනි, ප්‍රහාණ සංඥා කවරයත්?

ආනන්දයෙනි, මේ සස්නෙහි මහණ උපන් කාම විතර්ක නො ඉවසයි, දුරලයි, වෙසෙසින් දුරු කෙරෙයි, අභාවයට පමුණුවයි. උපන් විහිංසා විතර්කය නො ඉවසයි, දුරලයි, වෙසෙසින් දුරු කෙරෙයි, අභාවයට පමුණුවයි. 

ආනන්දයෙනි මේ ප්‍රහාණ සංඥාවයයි කියනු ලැබේ.

ආනන්දයෙනි, විරාග සංඥා කවරයත්?

ආනන්දයෙනි, මේ සස්නෙහි මහණ වලට ගියේ වේවයි, රුක්මුලට ගියේ වේවයි, ශුන්‍යාගාරයට ගියේ වේවයි, මෙසේ සලකන්නේ ය. සර්ව සංස්කාරයන් ගේ යම්බඳු සමථයෙක් සර්වෝපධීන් ගේ දුරලීමෙක් තෘෂ්ණාක්ෂයෙක් විරාගයෙක් නිර්වාණයෙක් වේ නම් එය ශාන්ත ය. එය ප්‍රණීතය. 

ආනන්දයෙනි මේ විරාග සංඥාය යි කියනු ලැබේ.

ආනන්දයෙනි, නිරෝධ සංඥා කවරයත්?

ආනන්දයෙනි, මේ සස්නෙහි මහණ වලට ගියේ වේවයි, රුක්මුලට ගියේ වේවයි, ශුන්‍යාගාරයට ගියේ වේවයි, මෙසේ සලකන්නේ ය. සර්ව සංස්කාරයන් ගේ යම්බඳු සමථයෙක් සර්වෝපධීන් ගේ දුරලීමෙක් තෘෂ්ණාක්ෂයෙක් විරාගයෙක් නිර්වාණයෙක් වේ නම් එය ශාන්ත ය. එය ප්‍රණීතය. 

ආනන්දයෙනි මේ නිරෝධ සංඥාය යි කියනු ලැබේ.

ආනන්දයෙනි, සර්වලෝකයෙහි අනභිරත සංඥා කවරයත්?

ආනන්දයෙනි, මේ සස්නෙහි භික්ෂුනමක් ලෝකයෙහි පඤ්චස්ඛන්දය පිළිබඳ් දැඩි ගැනීමක් හෝ සිත පිළිබඳ අරමුණු අනුව ඇතිවන කෙලෙස් හෝ වෙත් නම් ඔවුන් දුරු කරන්නේ වේද? දැඩිව අල්වා නොගන්නේ වේද, මෙය ලෝකයෙහි කලකිරීම් සහගත හැඟීම යයි කියනු ලැබේ.

ආනන්දයෙනි, සියලු සංස්කාරයන් කෙරෙහි අනිත්‍යසංඥාව කවරයත්?

ආනන්දයෙනි, මේ සසුනෙහි මහණ තෙම හැම ප්‍රත්‍යුත්පන්ත ධර්මයන්ගෙන් පෙළෙයි. ලජ්ජා වෙයි. පිළිකුල් කෙරෙයි. ආනන්දයෙනි, මේ සර්වසංස්කාරයන්ගේ අනිත්‍ය සංඥාවයයි කියනු ලැබේ.

ආනන්දයෙනි, ආනාපානාසති කවරයත්?

ආනන්දයෙනි, මේ සසුනෙහි මහණ වලට ගියේ වේවයි, රුක්මුලට ගියේ වේවයි ශුන්‍යාගාරයට ගියේ වෙවයි කය සෘජුකොට තබා සිහි පෙරට කොට එළවා පලක් බැඳ හිඳියි. ඒ සිහි ඇතිසේම ආශ්වාස කෙරෙයි, සිහි ඇතිසේ ම ප්‍රාශ්වාස කෙරෙයි.

දීර්ඝ කොට ආශ්වාස කරනුයේ හෝ දීර්ඝ කොට ආශ්වාස කෙරෙමියි දනී. දීර්ඝකොට ප්‍රශ්වාස කරනුයේ හෝ දීර්ඝකොට ප්‍රශ්වාස කරමියි දනී.
ලඝු කොට ආශ්වාස කරනුයේ හෝ ලඝු කොට ආශ්වාස කෙරෙමියි දනී. ලඝු කොට ප්‍රශ්වාස කරනුයේ හෝ ලඝු කොට ප්‍රශ්වාස කරමියි දනී.
සකල ආශ්වාස කායය මුල මැද අග පහළ කරමින් ආශ්වාස කරමි යි හික්මෙයි. සකල ප්‍රශ්වාස කාය මුල මැද අග පහළ කරමින් ප්‍රශ්වාස කරමියි හික්මෙයි.
ඖදාරික ප්‍රශ්වාස කාය සංස්කාරය සන්හිඳුවමින් ප්‍රශ්වාස කරමින් හික්මෙයි.

ප්‍රීතිය මොනවට දන්නේ ආශ්වාස කෙරෙමියි හික්මෙයි. ප්‍රීතිය මොනවට දන්නේ ප්‍රශ්වාස කෙරෙමියි හික්මෙයි.
සුඛය මොනවට දන්නේ ආශ්වාස කෙරෙමියි හික්මෙයි. සුඛය මොනවට දන්නේ ප්‍රශ්වාස කෙරෙමියි හික්මෙයි.
චිත්තසංස්කාරය දන්නේ ආශ්වාස කරමියි හික්මෙයි. චිත්තසංස්කාර දන්නේ ප්‍රශ්වාස කරමියි හික්මෙයි.
ඖදාරික චිත්තසංස්කාර සංහිඳුවමින් ආශ්වාස කරමියි හික්මෙයි. ඖදාරික චිත්තසංස්කාර සංහිඳුවමින් ප්‍රශ්වාස කරමියි හික්මෙයි.
සිත දන්නේ ආශ්වාස කෙරෙමියි හික්මෙයි. සිත දන්නේ ප්‍රශ්වාස කෙරෙමියි හික්මෙයි.
සිත පහන් කරවමින් ආශ්වාස කෙරෙමියි හික්මෙයි. සිත පහන් කරවමින් ප්‍රශ්වාස කෙරෙමියි හික්මෙයි.
සිත අරමුණෙහි සමව තබමින් ආශ්වාස කෙරෙමියි හික්මෙයි. සිත අරමුණෙහි සමව තබමින් ප්‍රශ්වාස කෙරෙමියි හික්මෙයි.
නීවරණයෙන් සිත මුදමින් ආශ්වාස කෙරෙමියි හික්මෙයි. නීවරණයෙන් සිත මුදමින් ප්‍රශ්වාස කෙරෙමියි හික්මෙයි.

අනිත්‍යානුදර්ශී වූයෙම් ආශ්වාස කෙරෙමියි හික්මෙයි. අනිත්‍යානුදර්ශී වූයෙම් ප්‍රශ්වාස කෙරෙමියි හික්මෙයි.
විරාගානුදර්ශී වූයෙම් ආශ්වාස කෙරෙමියි හික්මෙයි. විරාගනුදර්ශී වූයෙම් ප්‍රශ්වාස කෙරෙමියි හික්මෙයි.
නිරෝධානුදර්ශී වූයෙම් ආශ්වාස කෙරෙමිහි හික්මෙයි. නිරෝධානුදර්ශී වූයෙම් ප්‍රශ්වාස කෙරෙමියි හික්මෙයි.
ප්‍රතිනිඃසර්ගානුදර්ශී වුයෙම් හික්මෙයි ආශ්වාස කෙරෙමිහි හික්මෙයි. ප්‍රතිනිඃසර්ගානුදර්ශී වූයෙම් ප්‍රශ්වාස කෙරෙමියි හික්මෙයි.

මේ ආනාපාන සතිය යි කියනු ලැබේ.

ආනන්දයෙනි, ඉදින් තෙපි ගිරිමානන්ද මහණනු වෙත ගොස් මේ දස සංඥා කියවු නම් යම් හෙයකින් මේ දශ සංඥා අසා ගිරිමානන්ද මහණහු ගේ ඒ ආබාධය හේතු විසින් සංහිඳෙන්නේ ය, යන කාරණය ඇත.

එකල්හි ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේ හමුවෙහි මේ දශ සංඥා උගෙන ආයුෂ්මත් ගිරිමානන්ද තෙරුන් කරා එළඹියහ. එළඹ ආයුෂ්මත් ගිරිමානන්ද තෙරුන්ට මේ දශ සංඥා කීහ.

ඉක්බිති මේ දශ සංඥා අසා ආයුෂ්මත් ගිරිමානන්ද තෙරුණුවෝත් ඒ ආබාධයෙන් නැගී සිටියේ ය. ආයුෂ්මත් ගිරිමානන්ද තෙරුන් ගේ ඒ ආබාධය එසේ ප්‍රහීණ වූයේ ය.
`;

export default GirimanandSinhala;