const ParabawaSinhala = `
<
පරාභව සූත්‍රය මංගල සූත්‍රයේ ප්‍රතිවිරෝධතාව සේ සැලකිය හැකියි. බුදුරදුන් වෙත පැමිණ පරිහානියට හේතුවන කාරණා විමසූ එක්තරා දේවතාවකුට වදාරණ ලද්දකි. කෙනෙකු දහමට ඇළුම් කරතොත් හේ උන්නතියට ද දහමට ද්වේෂ කරතොත් අවනතියට ද පත්වේය යන ආදී කරුණු මෙහි අන්තර්ගත වේ
>

<
මා විසින් මෙසේ අසන ලදී. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත් නුවර දෙව්රම් නම් අනේපිඬු සිටුහු ගේ ආරාමයෙහි වැඩ වසන සේක. එකල එක්තරා දෙවියෙක් රෑ පෙරයම ඉක්ම ගිය කල්හි විශිෂ්ට වර්ණ ඇත්තේ සියලු ජේතවනය එකලු කෙරෙමින් භාග්‍යවතුන් වහන්සේ වෙත එළඹි යේ ය. එළැඹ, භාග්‍යවතුන් වහන්සේ සකසා වැඳ එකත්පසව සිටියේය. එකත්පසව සිටි ඒ දෙවි භාග්‍යවතුන් වහන්සේට ගාථායෙන් මෙසේ සැළ කළේය.
>

<
අපි පින්වත් ගෞතමයන් වහන්සේ ගෙන් පිරිහෙන පුද්ගලයා කෙබඳුදැයි විචාරමු. අපි පිරිහීමේ කරුණු මොනවදැ යි දැනගනු පිණිස පැමිණියෙමු.
>

<
දියුණුවන පුද්ගලයා ද, ඒ ඒ කරුණුවලින් දත හැකි වෙයි. පිරිහෙණ පුද්ගලයා ද එසේම දත හැකි වෙයි. දශ කුශල ධර්මයට කැමැති වූ පුද්ගල තෙමේ දියුණු වෙයි. ධර්මයට ද්වේෂ කරන තැනැත්තේ පිරිහෙයි.
>

<
භාග්‍යවතුන් වහන්සේ විසින් වදාළ පරිද්දෙන් මේ කාරණය දනිමු. හේ පළමුවන පිරිහීමේ දොරටුවයි. පිරිහීමට හේතුවන දෙවන කාරණය වදාළ මැනවි.
>

<
මොහුට අන්‍ය ශාස්තෲහු ප්‍රිය වෙත්ද, බුද්ධාදී සත් පුරුෂයන් ප්‍රිය නොකෙරෙත් ද දෙසැටක් මිථ්‍යා දෘෂ්ටි ඇති අසත්පුරුෂ ධර්මයට ප්‍රිය කෙරෙත් ද? මේ කරුණු තුන පිරිහීමේ දෙවන දොරටුව ය.
>

<
මෙසේ දෙවන පරිහානිය දනිමි. භාග්‍යවතුන් වහන්ස, පිරිහීමට හේතුවන තෙවන කාරණය කුමක්දැයි ප්‍රකාශ කරනු මැනවි.
>

<
යම් මිනිසෙක් නිදන සුලුවේද, ගණයා කෙරෙහි ඇලෙන සුලු වේද, උට්ඨානවීර්‍ර්ය්‍ය නැත්තේද, උපතින් ම අලස වේද, ක්‍රෝධය ලක්ෂණ කොට ඇතිවේද, මේවා පිරිහීමට හේතුවන කාරණාය.
>

<
මෙසේ තෙවන පරිහානි කාරණය දැන ගතිමු. භාග්‍යවතුන් වහන්ස, පිරිහීමට හේතුවන හතරවන කාරණය කුමක්දැයි ප්‍රකාශ කරනු මැනවි.
>

<
යමෙක් පොහොසත් වූයේ ජරාවෙන් දිරාගිය ඉක්ම වූ යොවුන් බව ඇති මව හෝ පියා පෝෂණය නො කරයිද, එය පිරිහීමට කරුණෙකි.
>

<
මෙසේ සිවුවන පරිහානි කාරණය දැන ගතිමු. භාග්‍යවතුන් වහන්ස, පිරිහීමට හේතුවන පස්වන කාරණය කුමක්දැයි ප්‍රකාශ කරනු මැනවි.
>

යමෙක් බමුණෙකු වෙව යි, මහණකු වෙව යි, අන්කිසි යදියෙකු වෙව යි, මුසාවෙන් රවටානම් එය පිරිහීමට කරුණුය. 
>
<
මෙසේ පස්වන පරිහානි කාරණය දැන ගතිමු. භාග්‍යවතුන් වහන්ස, පිරිහීමට හේතුවන සයවන කාරණය කුමක්දැයි ප්‍රකාශ කරනු මැනවි.
>
<
බොහෝ රන් රුවන් කහවණු ඇති සූපව්‍යඤ්ජන භෝජනයෙන් සමෘඬ වූ පුරුෂයා තනිවම පිණිබොජුන් වළදානම් එය පිරිහීමේ කාරණාවෙකි.
>
<
මෙසේ සයවන පරිහානි කාරණය දැන ගතිමු. භාග්‍යවතුන් වහන්ස, පිරිහීමට හේතුවන සත්වන කාරණය කුමක්දැයි ප්‍රකාශ කරනු මැනවි.

>
<
යම් මිනිහෙක් ජාතිමානයෙන් තද වූයේ, ධන මානයෙන් තද වූයේ, කුලමානයෙන් තද වූයේ, සිය නෑයන් ඉක්මවා සිතා ද, එය පිරිහීමට කරුණු ය.
>
<
මෙසේ සත්වන පරිහානි කාරණය දැන ගතිමු. භාග්‍යවතුන් වහන්ස, පිරිහීමට හේතුවන අටවන කාරණය කුමක්දැයි ප්‍රකාශ කරනු මැනවි.
>
<
යම් මිනිසෙක් ස්ත්‍රී ධුරත වූයේ, සුරා ධූරත වූයේ, අක්ෂ ධූර්ත වූයේ ලද ලද දෑ වනසයි ද, එය පිරිහීමට කරුණුය.
>
<
මෙසේ අටවන පරිහානි කාරණය දැන ගතිමු. භාග්‍යවතුන් වහන්ස, පිරිහීමට හේතුවන නවවන කාරණය කුමක්දැයි ප්‍රකාශ කරනු මැනවි.

>
<
සිය බිරියන් විසින් නො සතුටුවූයේ වෛශ්‍යාවන් කරා පැමිණේද, එය පිරිහීමට කරුණුය.

>
<
මෙසේ නවවන පරිහානි කාරණය දැන ගතිමු. භාග්‍යවතුන් වහන්ස, පිරිහීමට හේතුවන දහවන කාරණය කුමක්දැයි ප්‍රකාශ කරනු මැනවි.
>
<
ඉක්ම ගිය යොවුන් බව ඇති පුරුෂයා තිඹිරිපල බඳු පියුවුරු ඇති තුරුණු දැරියන් ආවාහ කොට ගනීද, හේ ඇයට ඊර්ෂ්‍යාවෙන් නො නිදා ද, ඒ පිරිහීමේ කරුණුය.
>
<
මෙසේ දහවන පරිහානි කාරණය දැන ගතිමු. භාග්‍යවතුන් වහන්ස, පිරිහීමට හේතුවන එකොළොස්වන කාරණය කුමක්දැයි ප්‍රකාශ කරනු මැනවි.
>
<
මත්ස්‍ය මාංස මද්‍යපාන ආදියෙහි ලොල් වූ ඒ සඳහා ධනය විසුරුවන මාගමක් හෝ එබඳු පුරුෂයෙකු ආධිපත්‍යයෙහි තබා ද එය පිරිහීමේ කරුණුය.
>
<
මෙසේ එකොළොස්වන පරිහානි කාරණය දැන ගතිමු. භාග්‍යවතුන් වහන්ස, පිරිහීමට හේතුවන දොළොස්වන කාරණය කුමක්දැයි ප්‍රකාශ කරනු මැනවි.
>
<
අල්ප භෝග ඇති, මහත් භෝග තෘෂ්ණා ඇති යමෙක් ක්ෂත්‍රිය කුලයෙහි උපදී ද, හේ රාජ්‍යය පතානම් ඒ පිරිහීමට කරුණු ය.
>
<
පණ්ඩිත වූ ඒ පරාභවය දක්නා නුවණැති ඒ ආර්ය්‍ය පුද්ගලයා ලෝකයේ එම පරිහාණි කාරණා පිරිසිඳ දැන දෙව්ලොවට පැමිණෙයි.
>
`;

export default ParabawaSinhala;