const RathnamaliSinhala = `
<
සසර සඬ පහර නවතා නිවන්          වැද
පැතිර නැණති දිරිමත් රන් පතක්   ලෙද
නිතර දිලෙන තුම් සදහම් දෙසන     ලද
වැතිර වඳිමි මගෙ සම්බුදු මහිම        සඳ
>
<
සැක තැන් දුරු කරන එලෙසින් මෝ      නසන
යුදදුම් ලෙසින් මර යුදයෙහි දිවි               රකින
ඇසුරින් සතුට දෙන කෙලෙසුන් ඇති      නසන
නමදිමි බැතින් සිරි සදහම් මිණි               පහන
>
<
සඟ සැප දෙන නැසිය යුතු පව් හැම         නසන
බව බැමි සුණු විසුණු කර නිති ගුණ          පුරණ
ලත් සැප දමා පර තෙර වෙත නෙත      යොමන
වඳිනෙමි නිති පතා පින්සරු මහ               සඟන
>
`;

export default RathnamaliSinhala;
