const WasalaSinhala = `

මා විසින් මෙසේ අසන ලදී.

එක් සමයෙක භාග්‍යවත් බුදුරජාණන් වහන්සේ සැවැත් නුවර ජේතවන නම් වූ අනේපිඬු සිටුතුමා ගේ ආරාමයෙහි වැඩසිටි සේක. එකල්හී භාග්‍යවතුන් වහන්සේ පෙරවරුවෙහි සිවුරු හැඳ පොරවා ගෙන සිවුරත් පාත්‍රයත් රැගෙන සැවැත් නුවරට පිඩු සිඟා වැඩි සේක. එසමයෙහි (ගිනි පුදන බ්‍රාහ්මණයෙක් වූ) අග්ගිකභාරද්වාජ නම් බ්‍රාහ්මණයා ගේ නිවසෙහි ගිනි දල්වන ලද්දේ ය. එකල්හී භාග්‍යවතුන් වහන්සේ සැවැත් නුවර ගෙ පිළිවෙළින් පිඬු පිණිස වැඩම කරනා සේක් අග්ගික භාරද්වාජ බ්‍රාහ්මණයා ගේ නිවසට ද වැඩම කළ සේක. අග්ගික භාරද්වාජ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේ වඩිනු දුර දී ම දුටුවේ ය. එසේ දැක භාග්‍යවතුන් වහන්සේට මෙසේ පවසා සිටියේ ය.

<
“එම්බා හිස මුඩු කළ තැනැත්ත, ඔතැනම සිටිනු.
එම්බා ශ්‍රමණය, ඔතැනම සිටිනු.
එම්බා වසලය, ඔතැනම සිටිනු.”
>
<
මෙසේ කී කල්හී භාග්‍යවතුන් වහන්සේ අග්ගිකභාරද්වාජ බ්‍රාහ්මණයා හට මෙසේ වදාළ සේක.
පින්වත් බ්‍රාහ්මණය, වසලයෙකු වීම ගැන හෝ වසලයෙකු බවට පත් කරවන්නා වූ කාරණා ගැන ඔබ දන්නවා ද?

පින්වත් ගෞතමයාණෙනි, වසලයෙකු වීම ගැන හෝ වසලයෙකු බවට පත් කරවන කාරණා ගැන මම නම් නො දන්නෙමි. පින්වත් ගෞතමයාණන් වහන්සේ මා හට දහම් දෙසනු මැනව. එවිට වසලයෙකු වීම ගැන ද වසලයෙකු බවට පත් කරවන කාරණා ගැන ද මම දැන ගන්නෙමි.

එසේ වී නම් පින්වත් බ්‍රාහ්මණය, හොඳින් අසා ගෙන සිටිය යුත්තේ ය. සිත මනා කොට යොමු කර විය යුත්තේ ය. එය කියා දෙන්නෙමි.
>
<
එසේය පින්වතාණෙනි යි කියා අග්ගිකභාරද්වාජ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්නේ ය.
භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක.
>
<

ක්‍රෝධයෙන් යුතු වෛර බඳිනා
පවිටු ලාමක ගුණ ද මකනා
මිසදිටුව මායාව පානා
කෙනා දත යුතු වසල ලෙසිනා
>
<
මව් කුසින් බිජුවටින් ඉපදුන
සතුන් මෙලොවේ යමෙක් වනසන
දයාවක් නැති එම සතුන් ගැන
දත යුතු ය ඔහු වසල විලසින
>
<
ගම් නියම් ගම් ගොදුරු කරගෙන
පැහැර ගෙන ඒ ගම් ද වනසන
ලබයි ගැරහුම් ‘මහ සොරෙකු’ යන
දත යුතු ය වසලයෙකු විලසින
>
<
ගමක හෝ වන අරණෙ තිබෙනා
යමක් වෙද හිමිකරු ද සිටිනා
නුදුන් එය සොරකම් ද කරනා
කෙනා දත යුතු වසල ලෙසිනා
>
<
ගෙවමි කියමින් ණයක් අරගෙන
ඉල්ලු කල එය නො දී පැන යන
“මොන ණයක් වෙ ද ගෙවිය යුතු තට?”
කියන මොහු වසලයෙකි හැම විට
>
<
මහමගක යන පිරිස නසමින
ඔවුන් ගෙන යන බඩු ද රැගෙමින
සුළු දෙයක් හෝ පැහැරගෙන යන
කෙනා වසලය ලොවේ හඳුනන
>
<
තමා හෝ වෙන කෙනෙකු වෙනුවෙන්
ධනය හෝ වෙන දෙයක් වෙනුවෙන්
අසන විට රවටයි ද බොරුවෙන්
ඒ කෙනා වසලයෙකි මෙලෙසින්
>
<
ඤාති මිතුරන්ගේ අඹුන් වෙත
සැහැසි ලෙස හෝ කැමැත්තෙන් යන
කුල සිරිත් බිඳ වරදෙ හැසිරෙන
කෙනා දත යුතු වසල විලසින
>
<
හොඳට කා බී වසන රිසි සේ
දරුවො පමණක් සිටිති සුව සේ
දිරන මව්පියො වසති දුක සේ
මොවුන් වසලය දනුව මෙලෙසේ
>
<
මාපියන් හෝ සොහොයුරන් ගැන
නෑ සියන් හට හෝ දුකක් දෙන
කෝපයෙන් දොස් පරොස් පවසන
කෙනා වසලය දනුව මෙලෙසින
>
<
අසන විට දිවි මගට අරුතක්
කියා දෙන්නේ හැමට විපතක්
දොඩයි සැඟ වී සිටින විලසක්
මොහුට ඇත්තේ වසල සිරිතක්
>
<   
යමෙක් පව් කම් කරන රහසේ
“නොම දකීවා මාව මෙලෙසේ”
සිතා සඟවයි පව් ද රිසි සේ
දත යුතුය වසලයා මෙලෙසේ
>
<
යමෙක් පිට ගෙදරකට ගිය විට
හොඳට කා බී සතුටු වී සිට
යළි ඔවුන් තම ගෙදර ආ විට
වසලයා ම ය නොසළකන විට
>
<
ශ්‍රමණ බමුණන් නිවස වෙත එන
දුගී යදියන් පවා පැමිණෙන
රවටයි ද බොරු බස් ද කියමින
ඔහුව දත යුතු වසල විලසින
>
<
යමෙක් බොජුනක් කන වෙලාවට
ශ්‍රමණ බමුණන් ගෙදර ආ විට
කිසිත් නො දෙනා දොස් නඟා සිට
වසලයකු වේ ඔහු ද මෙලෙසට
>
<
යමක් ලැබුමට කැමැති වෙමිනා
දැන දැන ම බොරු බස් ම කියනා
මිසදිටුව වෙත වෙලී සිටිනා
වසලයෙකි මොහු ලොවේ සිටිනා
>
<
තමා ගැන මොහු හිතා ලොකුවට
අනෙක් හැම දෙන හෙළන පහළට
හීන ගති හරවමින් මානෙට
වසලයෙක් වෙයි ඔහු හැබෑවට
>
<
කෝප සිත ලෝභයෙන් වෙළුනේ
මසුරු ලාමක පැතුම් පිරුනේ
කපටි ලැජ්ජා බිය ද නැසුණේ
වසලයෙකි ඔහු දකිනු සොඳිනේ
>
<
යමෙක් සම්මා සම්බුදුන් හට
ගිහි පැවිදි තම ගෝල පිරිසට
කරයි නම් නින්දා අනුන් හට
වසලයෙක් වේ ඔහු ද මෙලෙසට
>
<   
යමෙක් හිත කෙලෙසුන් පුරෝගෙන
රහත් බව රඟපා සිටී නම්
බඹුන් සහිත වු ලොවම රවටන
මහ සොරෙක් වේ ඔහු ද නිතියෙන
මෙය දත යුත්තේය සොඳින
අධම වසල දෙයක් ලෙසින
කියන ලදි මා මෙසේ ඔබ හට
දත යුතුය වසලයා මෙලෙසට
>
<
උපතකින් වසලයෙකු නොම වේ
උපතකින් බමුණෙකුත් නොම වේ
තමාගේ වරදින් වසල වේ
තම යහපතින් බමුණෙකුත් වේ
>
<
දනුව නිදසුන දැන් කියා දෙන
වී ය දරුවෙක් සැඩොල් ගෙදර
උයන බලු මස් පරපුරෙන් එන
ඔහුගෙ නම විය ‘මාතංග’ යන
>
<
‘මාතංග’ සුපතලව ගිය සඳ
ලොව දුලබ වූ කිත් යසස් මැද
රජුන් බමුණන් පැමිණ රොද බැඳ
කළෝ උවටැන් සිය පිරිස් මැද
>
<
දෙව්ලොවට යන යානයටනැග
යමින් කෙලෙසුන් නො මැති මහමඟ
සිඳලමින් කම් සුවය සිතළඟ
ගියේ හෙතෙමේ බඹලොවටඅග
>
<
උපත බඹලොව වළක්වන්නට
නොහැකි විය තම සැඩොල් කුලයට
වේද මතුරන බමුණු පිරිසට
කිව යුතුය එක දෙයක් මෙලෙසට
>
<
ඔවුන් අතරේ නිතර දිස් වෙති
කරන පව්කම් නොමැති අනුමැති
ඔවුන් හට මේ ලොව ම ගරහති
පරලොව ද දුගතියක් වෙත යති
නොහැකි ම ය තම බමුණු කුලයට
දුගති ගැරහිලි වළක්වන්නට
>
<
උපතකින් වසලයෙකු නොම වේ
උපතකින් බමුණෙකුත් නොම වේ
තමාගේ වරදින් වසල වේ
තම යහපතින් බමුණෙකුත් වේ
>
<
මෙය වදාළ විට අග්ගික භාරද්වාජ බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය.
>
<
“පින්වත් ගෞතමයාණෙනි, හරිම අපූරුයි! පින්වත් ගෞතමයාණෙනි, හරිම අගෙයි!
යටට හැරී තිබූ දෙයක් උඩට හරවා තැබුවා වැනි ය. සැඟවී තිබූ දෙයක් සොයාගෙන පෙන්නුවාක් වැනි ය. අතරමං වී ගිය කෙනෙකුට සැබෑ ම මාවත පෙන්වා දුන්නාක් වැනි ය. ඇස් පෙනෙන උදවියට රූප දකින්නට අඳුරේ තෙල් පහනක් ගත්තාක් වැනි ය.

පින්වත් ගෞතමයන් වහන්සේ විසින් නොයෙක් ආකාරයෙන් දහම් දෙසන ලදී. මම් ද පින්වත් ගෞතමයන් වහන්සේව සරණ යමි. ඒ සද්ධර්මය ද, භික්ෂු සංඝයා ද සරණ යමි.

පින්වත් ගෞතමයන් වහන්සේ අද පටන් මා ගැන ද දිවි තිබෙන තුරා ම තෙරුවන් සරණ ගිය උපාසකයෙකු වශයෙන් පිළිගන්නා සේක්වා!” යි.>
`;

export default WasalaSinhala;
