const BuddhaAndBodhi = `
<
1. නමස්කාරය
 
ඒ භාග්‍යවත් අරහත් සම්‍යක් සම්බුදු රජාණන් වහන්සේට මාගේ නමස්කාරය වේවා.
ඒ භාග්‍යවත් අරහත් සම්‍යක් සම්බුදු රජාණන් වහන්සේට මාගේ නමස්කාරය වේවා.
ඒ භාග්‍යවත් අරහත් සම්‍යක් සම්බුදු රජාණන් වහන්සේට මාගේ නමස්කාරය වේවා.
>
<
2. තිසරණ සරණයාම
 

මම බුදුරජාණන් වහන්සේ සරණ යමි.
මම ශ්‍රී සද්ධර්මය සරණ යමි.
මම ආර්ය මහා සංඝරත්නය සරණ යමි.

දෙවනුව ද මම බුදුරජාණන් වහන්සේ සරණ යමි.
දෙවනුව ද මම ශ්‍රී සද්ධර්මය සරණ යමි.
දෙවනුව ද මම ආර්ය මහා සංඝරත්නය සරණ යමි.

තෙවනුව ද මම බුදුරජාණන් වහන්සේ සරණ යමි.
තෙවනුව ද මම ශ්‍රී සද්ධර්මය සරණ යමි.
තෙවනුව ද මම ආර්ය මහා සංඝරත්නය සරණ යමි.
>
<
3. පංචශීලය සමාදන්වීම
 

මම සතුන් මැරීමෙන් වෙන්වීමේ සිල්පදය සමාදන් වෙමි.
මම සොරකම් කිරීමෙන් වෙන්වීමේ සිල්පදය සමාදන් වෙමි.
මම කාමයෙහි වරදවා හැසිරීමෙන් වෙන්වීමේ සිල්පදය සමාදන් වෙමි.
මම බොරු කීමෙන්, කේලාම් කීමෙන් වෙන්වීමේ සිල්පදය සමාදන් වෙමි.
මම මදයට, ප්‍රමාදයට කරුණුවන මත්කුඩු, රහ මෙර, සුරාපානය කිරීමෙන් වෙන්වීමේ සිල්පදය සමාදන් වෙමි.
>
<

4. බුදු ගුණ සිහි කිරීම
 

ස්වාමීණී! වාසනා සහිත සකල ක්ලේෂයන් දුරු කළ හෙයින්ද, සියලු කෙලෙස් සතුරන් නැසූ හෙයින්ද, සංසාර චක්‍රයේ අරටු සිඳලූ හෙයින්ද, ලෝවැසියන්ගේ ආමිස පූජා, ප්‍රතිපත්ති පූජා පිළිගැනීමට සුදුසු වන හෙයින් ද, රහසින්වත් පව් නොකළ හෙයින් ද අරහත් නම් වන සේක.

ඒ භාග්‍යවතුන් වහන්සේ චතුරාර්‍ය සත්‍ය ධර්මයන් තමන් වහන්සේ විසින්ම අවබෝධ කළ හෙයින් සම්මා සම්බුද්ධ නම් වන සේක.

ඒ භාග්‍යවතුන් වහන්සේ අෂ්ඨ විද්‍යාවෙන් හා පසළොස්චරණ ධර්මයන්ගෙන් යුක්ත වූ හෙයින් විජ්ඡාචරණ සම්පන්න නම් වන සේක.

ඒ භාග්‍යවතුන් වහන්සේ ශෝභන වූ ගමන් ඇති හෙයින් ද, සුන්දර වූ තැනට පැමිණි හෙයින් ද සුභාශිත වචන වදාළ හෙයින් සුගත නම් වන සේක.

ඒ භාග්‍යවතුන් වහන්සේ සියලු ලෝකයන් තත්වූ පරිද්දෙන් දන්නා හෙයින් ලෝකවිදු නම් වන සේක.

ඒ භාග්‍යවතුන්වහන්සේ සියල්ලන් දමනය කළ හෙයින් අනුත්තර පුරිස දම්ම සාරථී නම් වන සේක.

දමනය කර නිවන කරා පමුණුවන හෙයින් ඒ භග්‍යවතුන් වහන්සේ දෙව් මිනිසුන් ප්‍රධාන සත්වයන්ට අනුශාසනා කරන හෙයින් සත්ථා නම් වන සේක.
ඒ භාග්‍යවතුන්වහන්සේ සංසාර ස්වභාවය සම්පූර්ණයෙන්ම දැන වදාළ හෙයින් බුද්ධ නම් වන සේක.

ඒ භාග්‍යවතුන් වහන්සේ භග ධර්මයන් ඇති හෙයින් ද, සියලු කෙළෙස් මුලිනිපුටා දැමූ හෙයින් ද, සසර ගමන සිඳලූ හෙයින් ද, නාම රූප ධර්මයන් විභාග කොට දෙසූ හෙයින් ද, භගවා නම් වන සේක.
>
<
5. දහම් වැඳීම
භාග්‍යවතුන් වහන්සේ විසින් ඒ නව ලෝකෝත්තර ශ්‍රී සද්ධර්මය මනා කොට දේශනා කරන ලදී. එහෙයින් ස්වාක්ඛාත නම් වන සේක.
ඒ නව ලෝකෝත්තර ශ්‍රී සද්ධර්මය තමා විසින් ම අවබෝධ කර ගත යුතු හෙයින් සන්දිට්ඨික නම් වන සේක.
ඒ නව ලෝකෝත්තර ශ්‍රී සද්ධර්මය මාර්ග සිතට අනතුරුව ම කල් නොයොවා ඵල සිත පහළ වන හෙයින් අකාලික නම් වන සේක. 
ඒ නව ලෝකෝත්තර ශ්‍රී සද්ධර්මය සිතෙහි පිහිටුවා ගත යුතු හෙයින් ඕපනයික නම් වන සේක.
ඒ නව ලෝකෝත්තර ශ්‍රී සද්ධර්මය නුවණැත්තන් විසින් තම තමන්ම දත යුතු හෙයින් පච්චත්තවේදිතබ්බ නම් වන සේක.
>
<
6. සඟුන් වැඳීම
භාග්‍යවතුන් වහන්සේ ආර්ය මහා සංඝරත්නය සසුන් මගට මනාව පිළිපන් හෙයින් සුපටිපන්න නම් වන සේක. මධ්‍යම ප්‍රතිපදාවට පිළිපන් හෙයින් උජුපටිපන්න නම් වන සේක. නිවන් පිළිස මනාව පිලිපන් හෙයින් ඤායපටිපන්න නම් වන සේක. සසර දුක නැති කරන ප්‍රතිපදාවන්ට මනාව පිලිපන් හෙයින් සාමීචිපටිපන්න නම් වන සේක. දුර බැහැර සිට පූජා ද්‍රව්‍යයන් ගෙනවුත් පිදීමට සුදුසු වන හෙයින් ආහුණ්‍යෙය නම් වන සේක. දුර බැහැරින් එන ඤාතීන්ට පිළියෙල කළ භෝජන පූජා කිරීමට සුදුසු වන හෙයින් පාහුණ්‍යෙය නම් වන සේක. දෙඅත් මුදුනෙහි තබා වැඳීමට සුදුසු වන හෙයින් අඤ්ජලිකරණීය නම් වන සේක. ලෝකයාට උසස් වු පින් කෙතක් වන හෙයින් අනුත්තර පිඤ්ඤඛෙත්ත නම් වන සේක.
>
<
7. චෛත්‍ය වන්දනාව
සියලු ස්ථානයන්හි පිහිටි චෛත්‍යයන්ද, ශාරීරික ධාතුන් වහන්සේලා ද, සියලු බුද්ධ ප්‍රතිමාවන් ද, මම සැමදා වඳිමි.
>
<
8. බෝධි වන්දනාව
යම්කිසි වෘක්ෂ මූලයක වැඩහිඳ දසමරුන් පරදා අප ශාස්තෘ වූ බුදුරජාණන් වහන්සේ, උතුම් සර්වඥතා ඤාණය උපදවා ගත්තේද, ඒ උතුම් බෝධි වෘක්ෂ රාජයාණන් වහන්සේට මාගේ නමස්කාරය වේවා! වන්දනාමාන වේවා!
ලෝකනාථ වූ මාගේ බුදුරජාණන් වහන්සේ සත් දිනක් අනිමිස ලෝචන පූජාවෙන් පිදුම් කළා වූ ඒ උතුම් බෝධිරාජයාණන් වහන්සේට මම ද ගෞරවයෙන් යුතුව මෙසේ නමස්කාර කරමි.
ඉඳුනිල් මාණික්‍ය වැනි පත්‍ර වලින් හා සුදුපාට කඳින් බබලන්නා වූත්, මාගේ බුදුරජාණන් වහන්සේගේ නෙත් පියුම් වලින් පූජා ලැබුවා වූත්, අග්‍ර මිහිර ගෙන දෙන අග්‍ර බෝධි නම් සුන්දර වූ දෙව් රුකක් සේ වර්ණිත විශාල, එම බෝධි වෘක්ෂ රාජයාණන් වහන්සේ මම හැම කල්හිම වඳිමි.
>
<
9. බුද්ධ පූජා ආරාධනාව
වීතරාග මහා මුණි වූ, ලෝකාග්‍ර වූ, නර ශ්‍රේෂ්ඨ වූ, සුගත වූ, සම්බුදුරජාණන් වහන්සේට ආරාධනා කරමි.
>
<
10. පහන් පූජාව
ශ්‍රද්ධාවෙන් දල්වන ලද අඳුර දුරලන්නාවූ මේ පහන් ආලෝකයෙන් තුන් ලොවට මහා පහන් කණුවක් වැනි වූ මෝහන්ධකාරය දුරු කරන ලද බුදුරජාණන් වහන්සේ පුදමි.
>
<
11. සුවඳ දුම් පූජාව
පූජාවන්ට සුදුසු වූ, පූජා ලැබුවා වූ, උතුම් බුදුරජාණන් වහන්සේට මේ සුවඳ දුමින් පුදමි.
අපමණ ගුණ සුවඳවත් වදන් ඇති, තථාගතයන් වහන්සේට සුවඳින් පුදමි.
>
<
12. මල් පූජාව
පැහැයෙන් හා සුවඳින් යුත් මේ මල් රැස මුනිඳුන් සිරිපා පියුමට පුදනෙමි.
මේ කුසුමින් බුදුන් පුදමි. මේ පිනෙන් මොක් සුවට ලබමි! මේ මල් මැලවී යන්නා සේ මාගේ සිරුරද විනාශයට පත් වේයි.
>
<
13. පැන් පූජාව
භාග්‍යවතුන් වහන්ස, පිළිගැනුමට යෝග්‍ය වූ මේ පැන් අනුකම්පා පෙරදැරිව ඉවසා වදාරන සේක්වා!
>
<
14. ආහාර පූජාව
භාග්‍යවතුන් වහන්ස, පිළිගැනුමට යෝග්‍ය වූ මේ බොජුන් අනුකම්පා පෙරදැරිව ඉවසා වදාරන සේක්වා!
>
<
15. ගිලන්පස පූජාව
භාග්‍යවතුන් වහන්ස, පිළිගැනුමට යෝග්‍ය වූ මේ ගිලන් පස අනුකම්පා පෙරදැරිව ඉවසා වදාරන සේක්වා!
>
<
15. දැහැත් පූජාව
බුලතින් හා හුණු පුවක් කප්‍රින් යුත්, මේ දැහැත්, තථාගතයන් වහන්සේ ඉවසා වදාරණ සේක්වා !
>
<
16. සියල්ල එකවිට පූජා කිරීම
භාග්‍යවතුන් වහන්ස, පිළිගැනුමට යෝග්‍ය වූ සැදැහෙන් පුදන ලද මේ සියල්ල අනුකම්පා පෙරදැරිව ඉවසා වදාරන සේක්වා !
>
`;
export default BuddhaAndBodhi;