const Angulimala_Piritha_Pali = `
<පරිත්තං යං භණන්තස්ස නිසින්නට්ඨාන ධොවනං

උදකම්පි විනාසෙසි සබ්බ මෙව පරිස්සයං

සොත්ථිනා ගබ්භවුට්ඨානං යඤ්ච සාදෙති තං ඛණෙ

ථේරස්සංගුලිමාලස්ස ලොකනාථෙන භාසිතං

කප්පට්ඨායිං මහාතෙජං පරිත්තං තං භණාමහෙ>

යතොහං භගිනි ආරියාය ජාතියා ජාතො

නාභිජානාමි සංචිච්ච පාණං ජීවිතා වොරො පෙතා

තෙන සච්චෙන සොථිතෙ හොතු සොත්ථි ගබ්භස්සාති

යතොහං භගිනි ආරියාය ජාතියා ජාතො

නාභිජානාමි සංචිච්ච පාණං ජීවිතා වොරො පෙතා

තෙන සච්චෙන සොථිතෙ හොතු සොත්ථි ගබ්භස්සාති

යතොහං භගිනි ආරියාය ජාතියා ජාතො

නාභිජානාමි සංචිච්ච පාණං ජීවිතා වොරො පෙතා

තෙන සච්චෙන සොථිතෙ හොතු සොත්ථි ගබ්භස්සාති>
`;

export default Angulimala_Piritha_Pali;
