const Budhu_Guna_Piritha_Pali = `
<1) නමෝ තස්ස භගවතෝ අරහතෝ සම්මා සම්බුද්ධස්ස.
    නමෝ තස්ස භගවතෝ අරහතෝ සම්මා සම්බුද්ධස්ස.
    නමෝ තස්ස භගවතෝ අරහතෝ සම්මා සම්බුද්ධස්ස.>

<2) සෝ භගවා ඉතිපි අරහං
 අරහං වත සෝ භගවා
 තං භගවන්තං අරහන්තං සරණං ගච්ඡාමි
 තං භගවන්තං අරහන්තං සිරසා නමාමි.
 තේන අරහං බුද්ධ ගුණ තේජසා සොත්ථි මේ හෝතු සබ්බදා.>   

 <3)සෝ භගවා ඉතිපි සම්මා සම්බුද්ධෝ
සම්මා සම්බුද්ධෝ වත සෝ භගවා
තං භගවන්තං සම්මා සම්බුද්ධං සරණං ගච්ඡාමි.
තං භගවන්තං සම්මා සම්බුද්ධං සිරසා නමාමි.
තේන සම්මා සම්බුද්ධ බුද්ධ ගුණ තේජසා සොත්ථි මේ හොතු සබ්බදා.>

<4) සෝ භගවා ඉතිපි විජ්ජාචරණ සම්පන්නෝ
විජ්ජාචරණ සම්පන්නෝ වත සො භගවා
තං භගවන්තං විජ්ජාචරණ සම්පන්නං සරණං ගච්ඡාමි
තං භගවන්තං විජ්ජාචරණ සම්පන්නං සිරසා නමාමි
තේන විජ්ජාචරණ සම්පන්න බුද්ධ ගුණ තේජසා සොත්ථි මේ හෝතු සබ්බදා>

<5) සෝ භගවා ඉතිපි සුගතෝ
සුගතෝ වත සෝ භගවා
තං භගවන්තං සුගතං සරණං ගච්ඡාමි
තං භගවන්තං සුගතං සිරසා නමාමි
තේන සුගත බුද්ධ ගුණ තේජසා සොත්ථි මෙ හෝතු සබ්බදා>

<6) සෝ භගවා ඉතිපි ලෝකවිදූ
ලෝකවිදූ වත සෝ භගවා
තං භගවන්තං ලෝකවිදූං සරණං ගච්ඡාමි
තං භගවන්තං ලෝකවිදුං සිරසා නමාමි
තෙන ලෝකවිදූ බුද්ධ ගුණ තේජසා සොත්ථි මෙ හෝතු සබ්බදා>

<7) සෝ භගවා ඉතිපි අනුත්තරෝ පුරිස දම්ම සාරථි
අනුත්තරෝ පුරිස දම්ම සාරථි වත සෝ භගවා
තං භගවන්තං අනුත්තරං පුරිස දම්ම සාරථිං සරණං ගච්ඡාමි
තං භගවන්තං අනුත්තරං පුරිස දම්ම සාරථි සිරසා නමාමි
තේන අනුත්තර පුරිස දම්ම සාරථි බුද්ධ ගුණ තේජසා සොත්ථි මෙ හෝතු සබ්බදා>

<8)  සෝ භගවා ඉතිපි සත්ථා දේවමනුස්සානං
සත්ථා දේවමනුස්සානං වත සෝ භගවා
තං භගවන්තං සත්ථාරං දේව මනුස්සානං සරණං ගච්ඡාමි
තං භගවන්තං සත්ථාරං දේව මනුස්සානං සිරසා නමාමි
තේන සත්ථා දේව මනුස්සානං බුද්ධ ගුණ තේජසා සොත්ථි මෙ හෝතු සබ්බදා>

<9) සෝ භගවා ඉතිපි බුද්ධෝ
බුද්ධෝ වත සෝ භගවා
තං භගාවන්තං බුද්ධං සරණං ගච්ඡාමි
තං භගවන්තං බුද්ධං සිරසා නමාමි
තේන බුද්ධං බුද්ධ ගුණ තේජසා සොත්ථි මේ හෝතු සබ්බදා>

<10) සෝ භගවා ඉතිපි භගවා
භගවා වත සෝ භගවා
තං භගවන්තං භගවන්තං සරණං ගච්ඡාමි
තං භගවන්තං භගවන්තං සිරසා නමාමි
තේන භගවා බුද්ධ ගුණ තේජසා සොත්ථි මේ හෝතු සබ්බදා>

`;

export default Budhu_Guna_Piritha_Pali;
