const Chanda_Piritha_Pali = `
<ඒවං මේ සුතං. ඒකං සමයං භගවා සාවත්ථියං විහරති ජේතවනේ 
අනාථපිණ්ඩිකස්ස ආරාමේ. තේන ඛෝ පන සමයේන, චන්දිමා 
දේවපුත්තෝ රාහුනා අසුරින්දේන ගහිතෝ හෝති. අථ ඛෝ 
චන්දිමා දේවපුත්තෝ භගවන්තං අනුස්සරමානෝ, තායං වේලායං 
ඉමං ගාථාං අභාසි.>

<නමෝ තේ බුද්ධවීරත්ථු – විප්පමුත්තෝසි සබ්බධි
සම්බාධපටිපන්නෝස්මි – තස්ස මේ සරණං භවාති.>

<අථ ඛෝ භගවා චන්දිමං දේවපුත්තං ආරබ්භ
රාහුං අසුරින්දං ගාථාය අජ්ඣභාසි.>

<තථාගතං අරහන්තං චන්දිමා සරණං ගතෝ
රාහු චන්දං පමුඤ්චස්සු – බුද්ධා ලෝකානුකම්පකාති.>

අථ ඛෝ රාහු අසුරින්දෝ චන්දිමං දේවපුත්තං මුඤ්චිත්වා 
තරමානරූපෝ යේන වේපවිත්ති අසුරින්දෝ තේනුපසංකමි. 
උපසංකමිත්වා සංවිග්ගෝ ලෝම හට්ඨජාතෝ ඒකමන්තං 
අට්ඨාසි. ඒකමන්තං ඨීතං ඛෝ රාහුං අසුරින්දං චේපවිත්ති 
අසුරින්දෝ ගාථාය අජ්ඣ්භාසී.>

<කින්නුසන්තරමානෝ ව – රාහු චන්දං පමුඤ්වසි.
සංවිග්ගරූපෝ ආගම්ම – කින්නුභීතෝව තිට්ඨසීති.>

<සත්තධා මේ ඵලේ මුද්ධා – ජීවන්තෝ න සුඛං ලභේ. 
බුද්ධබාථාභිගීතෝම්හි – නෝ චේ මුඤ්චෙය්‍ය චන්දිමන්ති.>
`;

export default Chanda_Piritha_Pali;
