const Dajagga_Piritha_Pali = `
<1) ඒවං මේ සුතං ඒකං සමයං භගවා සාවත්ථියං විහරති ජේතවනේ 
අනාථපිණ්ඩිකස්ස ආරාමේ තත්‍ර ඛෝ භගවා භික්ඛු ආමන්තේසි 
භික්ඛවෝ’ති භදන්තේ’ති තේ භික්ඛු භගවතෝ පච්චස්සෝසුං 
භගවා ඒතදවෝච.>
<2) භූතපුබ්බං භික්ඛවේ දේවාසුරසංගාමෝ සමූපබ්බුළ්හෝ අහෝසි. 
අථඛෝ භික්ඛවේ සක්කෝ දේවානමින්දෝ දේවේ තාවතීසේ 
ආමංතේසි.>

<3) සචේ මාරිසා දේවානං සංගාමගතානං උප්පජ්ජෙය්‍ය භයං වා 
ජම්භිතත්තංවා ලෝමහංසෝ වා මමේව තස්මිං සමයේ ධජග්ගං 
උල්ලෝකෙය්‍යාථ, මමං හි වෝ ධජග්ගං උල්ලෝකයතං, යං 
භවිස්සති භයං වා ජම්භිතත්තං වා ලෝමහංසෝ වා සෝ 
පහීයිස්සති.>

<4) නෝ චේ මේ ධජග්ගං උල්ලෝකෙය්‍යාථ, අථ පජාපතිස්ස 
දේවරාජස්ස ධජග්ගං උල්ලෝකෙය්‍යාථ, පජාපතිස්ස හි වෝ 
දේවරාජස්ස ධජග්ගං උල්ලෝකයතං’ යං භවිස්සති භයං වා 
ජම්භිතත්තං වා ලෝමහංසෝ වා සෝ පහීයිස්සති.>

<5) නෝ චේ පජාපතිස්ස දේවරාජස්ස ධජග්ගං උල්ලෝකෙය්‍යාථ, අථ 
වරුණස්ස දේවරාජස්ස ධජග්ගං උල්ලෝකෙය්‍යාථ, 
වරුණස්සහිවෝ දේවරාජස්ස ධජග්ගං උල්ලෝකයතං’ යං 
භවිස්සති භයං වා ජම්භිතත්තං වා ලෝමහංසෝ වා සෝ 
පහීයිස්සති.>
<6) නෝ චේ වරුණස්ස දේවරාජස්ස ධජග්ගං උල්ලෝකෙය්‍යාථ, අථ 
ඊසානස්ස දේවරාජස්ස ධජග්ගං උල්ලෝකෙය්‍යාථ, ඊසානස්ස හි 
වෝ දේවරාජස්ස ධජග්ගං උල්ලෝකයතං’ යං භවිස්සති භයං වා 
ජම්භිතත්තං වා ලෝමහංසෝ වා සෝ පහීයිස්සති.>

<7) තං ඛෝ පන භික්ඛවේ සක්කස්ස වා දේවානමින්දස්ස ධජග්ගං 
උල්ලෝකයතං, වරුණස්ස වා දේවරාජස්ස ධජග්ගං 
උල්ලෝකයතං, ඊසානස්ස වා දේවරාජස්ස ධජග්ගං උල්ලෝකයතං 
යං භවිස්සති භයං වා ජම්භිතත්තං වා ලෝමහංසෝ වා සෝ 
පහීයේථා’පි නෝ’පි පහීයේථ, තං කිස්ස හේතු?>

<8) සක්කෝ භික්ඛවේ දේවාන මින්දෝ අවීතරාගෝ 
අවිතදෝසෝ අවිතමෝහෝ භීරුච්ඡ්ම්භි උත්‍රාසි පලායී’ති.>

<9) අහංච ඛෝ භික්ඛවේ ඒවං වදාමි. සචේ තුම්හාකං භික්ඛවේ 
අරඤ්ඤගතානං වා රුක්ඛමුලගතානං වා සුඤ්ඤාගාරගතානං 
වා උප්පජ්ජෙය්‍ය භයං වා ජම්භිතත්තං වා ලෝමහංසෝ වා මමේව 
තස්මිං සමයේ අනුස්සරෙය්‍යාථ.>

<10) ඉතිපි සෝ භගවා අරහං සම්මාසම්බුද්ධෝ විජ්ජාචරණ 
සම්පන්නෝ සුගතෝ ලෝකවිදූ අනුත්තරෝ පුරිසධම්මසාරථී 
සත්ථා දේවමනුස්සානං බුද්ධෝ භගවා’ති.>

<11) මමංහි වෝ භික්ඛවේ අනුස්සරතං. යං භවස්සති භයං වා 
ජම්භිතත්තං වා ලෝමහංසෝ වා සෝ පහීයිස්සති.>

<12) නෝ චේ මං අනුස්සරෙය්‍යාථ. අථ ධම්මං අනුස්සරෙය්‍යාථ. 
ස්වාක්ඛාතෝ භගවතා ධම්මෝ සන්දිට්ඨිකෝ අකාලිකෝ 
ඒහිපස්සිකෝ ඕපනයිකෝ පච්චත්තං වේදිතබ්බෝ විඤ්ඤූහීති. 
ධම්මං හි වෝ භික්ඛවේ අනුස්සරතං, යං භවිස්සති භයං වා 
ජම්භිතත්තං වා ලෝමහංසෝ වා සෝ පහීයිස්සති.>

<13) නෝ චේ ධම්මං අනුස්සරෙය්‍යථ. අථ සංඝං අනුස්සරෙය්‍යාථ.>

<14) සුපටිපන්නෝ භගවතෝ සවකසංඝෝ. උජුපටිපන්නෝ භගවතෝ 
සාවකසංඝෝ. ඤායපටිපන්නෝ භගවතෝ සාවක සංඝෝ. 
සාමීචිපටිපන්නෝ භගවතෝ සාවක සංඝෝ’ යදිදං 
චත්තාරිපුරිසයුගානි අට්ඨපුරිසපුග්ගලා ඒස භගවතෝ සාවක 
සංඝෝ. ආහුනෙය්‍යෝ පාහුනෙය්‍යෝ දක්ඛිණෙය්‍යෝ 
අඤ්ජලිකරණීයෝ පුඤ්ඤක්ඛෙත්තං ලෝකස්සාති.>

<15) සංඝං හි වෝ භික්ඛවේ අනුස්සරතං. යං භවිස්සති භයං වා 
ජම්භිතත්තං වා ලෝමහංසෝ වා සෝ පහීයිස්සති, තං 
කිස්සහේතු?>

<16) තථාගතෝ භික්ඛවේ අරහං සම්මාසම්බුද්ධෝ වීතරාගෝ 
වීතදෝසෝ වේතමෝහෝ අභිරු අච්ඡම්භි අනුත්‍රාසි අපලායීති.>

<17) ඉදමවෝච භගවා. ඉදං වත්වා සුගතෝ අථාපරං ඒතදවෝච 
සත්ථා.

18) අරඤ්ඤේ රුක්ඛමූලේ වා සුඤ්ඤාගාරේව භික්ඛවෝ අනුස්සරේථ 
සම්බුද්ධං – භයං තුම්හාක නෝ සියා.>

19) නෝ චේ බුද්ධං සරෙය්‍යාථ – ලෝකජෙට්ඨං නරාසභං අථ ධම්මං 
සරෙය්‍යාථ – නීයා ණිකං සුදේසිතං>

<20) නෝ චේ ධම්මං සරෙය්‍යාථ – නියා ණිකං සුදේසිතං අථ සංඝං 
සරෙය්‍යාථ – පුඤ්ඤක්ඛෙත්තං අනුත්තරං>

<21) ඒවං බුද්ධං සරන්තානං – ධම්මං සංඝඤ්ච භික්ඛවෝ භයං වා 
ජම්භිතත්තං වා – ලෝමහංසෝ න හෙස්සතී’ති.>




`;

export default Dajagga_Piritha_Pali;
