const Jaya_Piritha_Pali = `
<1) සිරි ධිති මති තේජෝ ජයසිද්ධි මහිද්ධි මහා ගුණං අපරිමිත 
පුඤ්ඤාධිකාරස්ස සබ්බන්තරාය නිවාරණ සමත්ථස්ස. භගවතෝ 
අරහතෝ සම්මාසම්බුද්ධස්ස.>

<2) ද්වත්තිංස මහා පුරිසලක්ඛණානුභාවේන අසිත්‍යනුව්‍යඤ්ජන 
ලක්ඛණානුභාවේන අට්ඨුත්තරසතමංගල ලක්ඛණානුභාවේන, 
ජබ්බණ්​ණ රංස්‍යනුභාවේන, කෙතුමාලානුභාවේන, 
දසපාරමිතානුභාවේන, දසඋප පාරමිතානුභාවේන, 
දසපරමත්ථපාරමිතානුභාවේන, සීලසමාධිපඤ්ඤානුභාවේන 
බුද්ධානුභාවේන, ධම්මානුභාවේන, සංඝානුභාවේන, 
තේජානුභාවේන, ඉධ්‍යානුභාවේන, බලානුභාවේන,  
ඤ්‍යෙය්‍යධම්මානුභාවේ​න , චතුරාසිතිසහස්ස 
ධම්මක්ඛන්ධානුභාවේන, නවලොකුත්තරධම්මානුභාවේන 
අට්ඨංගිකමග්ගානුභාවේන, අට්ඨසමාපත්ත්‍යානුභාවේන, 
ජලභිඤ්ඤානුභාවේන, මෙත්තා, කරුණා, මුදිතා, 
උපෙක්ඛානුභාවේන, සබ්බපාරමිතානුභාවේන, රතනත්තය 
සරණානුභාවේන, තුය්හං සබ්බරෝග සෝක උපද්දව 
දුක්ඛදෝමනස්සුපායාසා විනස්සන්තු. සබ්බසංකප්පා තුය්හං 
සමිජ්ඣන්තු දීඝායුකෝ හෝතු සතවස්සජීවේන සමංගිකෝ 
හෝතු සබ්බදා.>

<3) ආකාස පබ්බත වනභූමිතටාකගංගා මහාසමුද්ද ආරක්ඛක 
දේවතා සදා තුම්හෙ අනුරක්ඛන්තු සබ්බබුද්ධානුභාවේන සබ්බ 
ධම්මානුභාවේන සබ්බසංඝානුභාවේන බුද්ධරතනං ධම්මරතනං 
සංඝරතනං තින්නං රතනානං ආනුභාවේන චතුරාසීති 
සහස්සධම්මක්ඛන්ධානුභාවේන, පිටකත්තයානුභාවේන, 
ජිනසාවකානුභාවේන, සබ්බේ තෙ රෝගා, සබ්බේ තේ භයා, 
සබ්බේ තෙ අන්තරායා, සබ්බේ තෙ උපද්දවා, සබ්බේ තෙ 
දුන්නිමිත්තා, සබ්බේ තෙ අවමංගලා විනස්සන්තු.>

<4) ආයුවඩ්ධකෝ, ධනවඩ්ඪකෝ, සිරිවඩ්ඪකෝ, යසවඩ්ඪකෝ, 
බලවඩ්ඪකෝ, වණ්ණවඩ්ඪකෝ, සුඛවඩ්ඪකෝ, හෝතු සබ්බදා.>

<5) දුක්ඛරෝගභයාවේරා – සෝකා සබ්බේ උපද්දවා
අනේකා අන්තරායාපි – විනස්සන්තූ ච තේජසා
ජය සිද්ධි ධනං ලාභං – සොත්ථිභාග්‍යං සුඛං බලං
සිරි ආයුච වණ්ණො ච – භොගං චුද්ධි ච යසවා
සත්වස්සා ච ආයු ච – ජීවසිද්ධිභවන්තු තේ.>
`;

export default Jaya_Piritha_Pali;
