const Kanda_Piritha_Pali = `
<1) ඒවං මේ සුතං, ඒකං සමයං භගවා සාවත්ථියං විහරති
ජේතවනේ අනාථපිණ්ඩිකස්සා ආරාමේ.
තේන ඛෝ පන සමයේන සාවත්ථියං අඤ්ඤතරෝ
භික්ඛු අහිනා දට්ඨෝ කාලකතෝ හෝති.>

<2) අථ ඛෝ සබ්බහූලා භික්ඛු යේන භගවා
තෙනුපසංකමිංසු උපසංකමිත්වා භගවන්තං
අභිවාදෙත්වා ඒකමන්තං නිසීදිංසු. ඒකමන්තං
නිසින්නා ඛෝ තේ භික්ඛු භගවන්තං ඒතදවෝචුං>

<3) ඉධ භන්තේ සාවත්ථියං අඤ්ඤතරෝ භික්ඛු
අහිනාදට්ඨෝ කාලකතෝති. නහ නූන් සෝ
භික්ඛවේ භික්ඛූ චත්තාරි අහිරාජකුලානි
මෙත්තේනචිත්තේනඵරි. සචේ හි සො
භික්ඛවේ භික්ඛු චත්තාරි අහිරාජකුලානි
මෙත්තේන චිත්තේන ඵරෙය්‍ය, නහි සෝ භික්ඛවේ
භික්ඛු අහිනා දට්ඨෝ දට්ඨෝ කාලංකරෙය්‍ය.>

<4) කතමානි චත්තාරි අහිරාජකුලානි? විරූපක්ඛං
අහිරාජකුලං, ඒරාපථං අහිරාජකුලං ජබ්‍යා
පුත්තං අහිරාජකුලං කණ්හා ගෝතමකං
අහිරාජකුලං>

<5) නහ නූන සෝ භික්ඛවේ භික්ඛූ ඉමානි චත්තාරි
අභිරාජකුලානි මෙත්තේන චිත්තේන එරි.
සචෙ හි සෝ භික්ඛවේ භික්ඛු ඉමානි චත්තාරි
අහිරාජකුලානි මෙත්තේන චිත්තේන ඵරෙය්‍ය
න හිසෝ භික්ඛවේ භික්ඛු අහිනා දට්ඨෝ කාලං කරෙය්‍ය.>

<6) අනුජානාමි භික්ඛවේ භික්ඛූ ඉමානි චත්තාරි
අහිරාජකුලානි මෙත්තේන චිත්තේන එරිතුං
අත්තගුත්තියා අත්තරක්ඛාය අත්තපරිත්තායාති.>

<7) ඉදමවෝච භගවා, ඉදං වත්වා සුගතෝ
අථාපරං ඒතදවෝච සත්ථා>

<8) විරූපක්ඛේහි මේ මෙත්තං – මෙත්තං ඒරපථේහි මේ,
ජඛ්‍යාපුත්තේහි මේ මෙත්තං – මෙත්තං කණ්හාගෝතමකේහි ච.>

<9) ආපාදකේහි මේ මෙත්තං – මෙත්තං දිපාදකේහි මේ,
චතුප්පදේහි මේ මෙත්තං – මෙත්තං බහුප්පදේහි මේ.>

<10) මා මං අපාදකෝ හිංසි – මා මං හිංසි දිපාදකෝ,
මා මං චතුප්පදෝ හිංසි – මා මං හිංසි බහුප්පදෝ.>

<11) සබ්බේ සත්තා සබ්බේ පාණා – සබ්බේ භූතා ච කේවලා,
සබ්බේ භද්‍රානි පස්සන්තු – මා කඤ්චි පාපමාගමා.>

<12) අප්පමාණෝ බුද්ධෝ’ අප්පමාණෝ ධම්මෝ’ 
අප්පමාණෝ සංඝෝ, පමාණවන්තානි සිරිංසපානි අභිවිච්ඡිකා සතපදී’ උණ්ණානාභි’ 
සරබූ මූසිකා, කතා මේ රක්ඛා කතා මේ පරිත්තා, පටික්කමන්තු 
භූතානි, සෝහං නමෝ භගවතෝ නමෝ සත්තන්නං 
සම්මාසම්බුද්ධානන්ති.>
`;

export default Kanda_Piritha_Pali;
