const Maha_Kassapa_Thero_Bojjanga_Piritha_Pali = `
<1) ඒවං මේ සුතං, ඒකං සමයං භගවා
රාජගහේ විහරති වේලුවනේ 
කාලන්දකනිවාපේ, තේන ඛෝ පන 
සමයේන ආයස්මා මහා කස්සපෝ 
පිප්ඵලිගුහායං විහරති ආබාධිකෝ 
දුක්ඛිතෝ බාළ්හගිලානෝ.>


<2) අථ ඛෝ භගවා සායණ්හසමයං 
පතිසල්ලානා වුට්ඨිතෝ යේනායස්මා 
මහාකස්සපෝ තේනුපසංකමි. 
උපසංකමිත්වා පඤ්ඤත්තේ ආසනේ 
නිසීදි. නිසජ්ජ ඛෝ භගවා 
ආයස්මන්තං මහාකස්සපං 
ඒතදවෝච.>

<3) කච්චි? තේ කස්සප ඛ්මනීයං. කච්චි? 
යාපනීයං. කච්චි දුක්ඛා වේදනා 
පටික්කමන්ති නෝ අභික්කමන්ති. 
පටික්ක මෝසානං පඤ්ඤායති නෝ 
අභික්කමෝති.>

<4)
`;

export default Maha_Kassapa_Thero_Bojjanga_Piritha_Pali;
