const Maha_Kassapa_Thero_Bojjanga_Piritha_Pali = `
<1) ඒවං මේ සුතං, ඒකං සමයං භගවා
රාජගහේ විහරති වේලුවනේ 
කාලන්දකනිවාපේ, තේන ඛෝ පන 
සමයේන ආයස්මා මහා කස්සපෝ 
පිප්ඵලිගුහායං විහරති ආබාධිකෝ 
දුක්ඛිතෝ බාළ්හගිලානෝ.>


<2) අථ ඛෝ භගවා සායණ්හසමයං 
පතිසල්ලානා වුට්ඨිතෝ යේනායස්මා 
මහාකස්සපෝ තේනුපසංකමි. 
උපසංකමිත්වා පඤ්ඤත්තේ ආසනේ 
නිසීදි. නිසජ්ජ ඛෝ භගවා 
ආයස්මන්තං මහාකස්සපං 
ඒතදවෝච.>

<3) කච්චි? තේ කස්සප ඛ්මනීයං. කච්චි? 
යාපනීයං. කච්චි දුක්ඛා වේදනා 
පටික්කමන්ති නෝ අභික්කමන්ති. 
පටික්ක මෝසානං පඤ්ඤායති නෝ 
අභික්කමෝති.>

<4) න මේ භන්තේ ඛමනීයං න යාපනීයං. 
ඛාළ්හා මේ දුක්ඛා වේදනා 
අභික්කමන්ති නෝ පටික්කමන්ති. 
අභික්කමෝසානං පඤ්ඤායති නෝ 
පටික්කමෝති.>

<5) සත්තිමෝ කස්සප බොජ්ඣංගා මයා 
සම්මදක්ඛාතා භාවිතා බහුලීකතා 
අභිඤ්ඤාය සම්බෝධාය නිබ්බාණාය 
සංවත්තන්ති’ කතමේ සත්ත?>

<6) සති සම්බෝජ්ඣංගෝ ඛෝ කස්සප 
මයා සම්මදක්ඛාතෝ භාවිතෝ 
බහුලීකතෝ අභිඤ්ඤාය සම්බෝධාය 
නිබ්බාණාය සංවත්තති.>

<7) ධම්මවිචය සම්බොජ්ඣංගෝ ඛෝ 
කස්සප’ මයා සම්මදක්ඛාතෝ 
භාවිතෝ බහුලීකතෝ අභිඤ්ඤාය 
සම්බෝධාය නිබ්බාණාය සංවත්තති.>

<8) විරිය සම්බොජ්ඣංගෝ ඛෝ කස්සප’ 
මයා සම්මදක්ඛාතෝ භාවිතෝ 
බහුලීකතෝ අභිඤ්ඤාය සම්බෝධාය 
නිබ්බාණාය සංවත්තති.>

<9) පීති සම්බොජ්ඣංගෝ ඛෝ කස්සප’ 
මයා සම්මදක්ඛාතෝ භාවිතෝ 
බහුලීකතෝ අභිඤ්ඤාය සම්බෝධාය 
නිබ්බාණාය සංවත්තති.>

10) පස්සද්ධි සම්බොජ්ඣංගෝ ඛෝ 
කස්සප’ මයා සම්මදක්ඛාතෝ 
භාවිතෝ බහුලීකතෝ අභිඤ්ඤාය 
සම්බෝධාය නිබ්බාණාය සංවත්තති.>

11) සමාධි සම්බොජ්ඣංගෝ ඛෝ කස්සප’ 
මයා සම්මදක්ඛාතෝ භාවිතෝ 
බහුලීකතෝ අභිඤ්ඤාය සම්බෝධාය 
නිබ්බාණාය සංවත්තති.>

12) උපෙක්ඛා සම්බොජ්ඣංගෝ ඛෝ 
කස්සප’ මයා සම්මදක්ඛාතෝ 
භාවිතෝ බහුලීකතෝ අභිඤ්ඤාය 
සම්බෝධාය නිබ්බාණාය සංවත්තති.>

13) <ඉමෙ ඛෝ කස්සප සත්ත 
සම්බොජ්ඣංගා මයා සම්මදක්ඛාතා 
භාවිතා බහුලීකතා අභිඤ්ඤාය 
සම්බෝධාය නිබ්බාණාය 
සංවත්තන්ති.>

14) <තග්ඝ භගව බොජ්ඣංගා’ තග්ඝ 
සුගත බොජ්ඣංගාති.>

15) <ඉදමවෝ ච භගවා. අත්තමනෝ 
ආයස්මා මහාකස්සපෝ භගවතෝ 
භාසිතං අභිනන්දි. උට්ඨාහිචායස්මා 
මහා කස්සපෝ තම්හා ආබාධා. තථා 
පහීනෝ චායස්මතෝ මහාකස්සපස්ස 
සෝ ආබාධෝ අහෝසීති.>

`;

export default Maha_Kassapa_Thero_Bojjanga_Piritha_Pali;
