const Mora_Piritha_Pali = `
<1) උදේතයං චක්ඛුමා ඒකරාජා
හරිස්සවණ්ණෝ පඨවිප්පභාසෝ
තං තං නමස්සාමි හරිස්සවණ්ණං පඨවිප්පභාසං
තයජ්ජ ගුත්තා විහරේමු දිවසං.>

<2) යේ බ්‍රාහ්මණා වෙදගූ සබ්බධම්මේ
තේ මේ නමෝ තේච මං පාලයන්තු
නමත්ථු බුද්ධානං නමත්ථු බෝධියා
නමෝ විමුත්තානං නමෝ විමුත්තියා.
ඉමං සෝ පරිත්තං කත්වා මෝරෝ චරති ඒසනා.>

<3)අපේතයං චක්ඛුමා ඒකරාජා
හරිස්සවණ්ණෝ පඨවිප්පභාසෝ
තං තං නමස්සාමි හරිස්සවණ්ණං පඨවිප්පභාසං
තයජ්ජ ගුත්තා විහරේමු රත්තිං>

<4) යේ බ්‍රාහ්මණා වෙදගූ සබ්බධම්මේ
තේ මේ නමෝ තේච මං පාලයන්තු
නමත්ථු බුද්ධානං නමත්ථු බෝධියා
නමෝ විමුත්තානං නමෝ විමුත්තියා.
ඉමං සෝ පරිත්තං කත්වා මෝරෝ වාසමකප්පයීති.>
`;

export default Mora_Piritha_Pali;
