const Suriya_Piritha_Pali = `

<
ඒවං මේ සුතං ඒකං සමයං භගවා සාවත්ථියං විහරති ජේතවනේ අනාථපිණ්ඩිකස්ස ආරාමේ තේන ඛෝ පන සමයේන සුරියෝ දේවපුත්තෝ රාහුනා අසුරින්දේන ගහිතෝ හෝති. අථ ඛෝ සූරියෝ දේවපුත්තෝ භගවන්තං අනුස්සරමානෝ තයං වේලායං ඉමං ගාථාං අභාසි.
>
<
නමෝ තේ බුද්ධවීරත්ථු – විප්පමුත්තෝසි සබ්බධි
සම්බාධපටිපන්නෝස්මි – තස්ස මේ සරණං භවාති
>
<
අථ ඛෝ භගවා සූරියං - දේව පුත්තං ආරබ්භ
රාහුං අසුරින්දං ගාථාහි අජ්ඣභාසි
>
<
තථාගතං අරහන්තං – සූරියෝ සරණං ගතෝ
රාහු සුරියං පමුඤ්චස්සු – බුද්ධා ලෝකානුකම්පකාති.
>
<
යෝ අන්ධකාරේ තමසී පභංකරෝ
වේරෝචනෝ මණ්ඩලී උග්ගතේජෝ
මා රාහු ගිලි චරං අන්තලික්ඛේ
පජං මම රාහු පමුඥ්ච සුරියන්ති.
>
<
අථ ඛෝ රාහු අසුරින්දෝ සුරියං දේවපුත්තං මුඤ්චිත්වා තරමානරූපෝ යේන වේපවිත්ති අසුරින්දෝ තේනුපසංකමි. උපසංකමිත්වා සංවිග්ගෝ ලෝම හට්ඨජාතෝ ඒකමන්තං අට්ඨාසි ඒකමන්තං ඨීතං ඛෝ රාහුං අසුරින්දං චේපවිත්ති අසුරින්දෝ ගාථාය අජ්ඣ්භාසී.

කින්නුසන්තරමානෝ ව – රාහු සුරියං පමුඤ්වසි.
සංවිග්ගරූපෝ ආගම්ම – කින්නුභීතෝව තිට්ඨසීති.
>
<
සත්තධා මේ ඵලේ මුද්ධා – ජීවන්තෝ න සුඛං ලභේ. 
බුද්ධබාථාභිගීතෝම්හි – නෝ චේ මුඤ්චෙය්‍ය සුරියන්ති.
>
`;

export default Suriya_Piritha_Pali;
