const ChakkawaththiPali = `
   
<
චක්කවත්ති සීහනාද සුත්තං
>

<
1.
ඒවං මේ සුතං. ඒකං සමයං භගවා මගධේසු විහරති මාතුලායං. තත්‍ර ඛෝ භගවා භික්ඛූ ආමන්තේසි භික්ඛවෝ’ති. ‘භදන්තේ’ති තේ භික්ඛූ භගවතෝ පච්චස්සෝසුං. භගවා ඒතදවෝච:

අත්තදීපා භික්ඛවේ විහරථ අත්තසරණා අනඤ්ඤසරණා, ධම්මදීපා ධම්මසරණා අනඤ්ඤසරණා. කථඤ්ච පන භික්ඛවේ භික්ඛු අත්තදීපෝ විහරති අත්තසරණෝ අනඤ්ඤසරණෝ, ධම්මදීපෝ ධම්මසරණෝ අනඤ්ඤසරණෝ?

ඉධ භික්ඛවේ භික්ඛු කායේ කායානුපස්සී විහරති, ආතාපී සම්පජානෝ සතිමා විනෙය්‍ය ලෝකේ අභිජ්ඣාදෝමනස්සං. වේදනාසු වේදනානුපස්සී ….(පෙ)…. චිත්තේ චිත්තානුපස්සී ….(පෙ)…. ධම්මේසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානෝ සතිමා විනෙය්‍ය ලෝකේ අභිජ්ඣාදෝමනස්සං. ඒවං ඛෝ භික්ඛවේ භික්ඛු අත්තදීපෝ විහරති අත්තසරණෝ අනඤ්ඤසරණෝ, ධම්මදීපෝ ධම්මසරණෝ අනඤ්ඤසරණෝ.

ගෝචරේ භික්ඛවේ චරථ සකේ පෙත්තිකේ විසයේ. ගෝචරේ භික්ඛවේ චරතං සකේ පෙත්තිකේ විසයේ න ලච්ඡති මාරෝ ඕතාරං, න ලච්ඡති මාරෝ ආරම්මණං. කුසලානං භික්ඛවේ ධම්මානං සමාදානහේතු ඒවමිදං පුඤ්ඤං පවඩ්ඪති.

>
<

2.
භූතපුබ්බං භික්ඛවේ රාජා දළ්හනේමි නාම අහෝසි චක්කවත්තී ධම්මිකෝ රාජා චාතුරන්තෝ විජිතාවී ජනපදත්ථාවරියප්පත්තෝ සත්තරතනසමන්නාගතෝ. තස්සිමානි සත්තරතනානි අහේසුං, සෙය්‍යථීදං: චක්කරතනං හත්ථිරතනං අස්සරතනං මණිරතනං ඉත්ථිරතනං ගහපතිරතනං පරිනායකරතනමේව සත්තමං. පරෝසහස්සං ඛෝ පනස්ස පුත්තා අහේසුං සූරා වීරංගරූපා පරසේනප්පමද්දනා. සෝ ඉමං පඨවිං සාගරපරියන්තං අදණ්ඩේන අසත්ථේන ධම්මේන අභිවිජිය අජ්ඣාවසි. අථ ඛෝ භික්ඛවේ රාජා දළ්හනේමි බහුන්නං වස්සානං බහුන්නං වස්සසතානං බහුන්නං වස්සසහස්සානං අච්චයේන අඤ්ඤතරං පුරිසං ආමන්තේසි: “යදා ත්වං අම්භෝ පුරිස පස්සෙය්‍යාසි දිබ්බං චක්කරතනං ඕසක්කිතං, ඨානා චුතං, අථ මේ ආරෝචෙය්‍යාසී”ති. ‘ඒවං දේවා’ති ඛෝ භික්ඛවේ සෝ පුරිසෝ රඤ්ඤෝ දළ්හනේමිස්ස පච්චස්සෝසි. අද්දසා ඛෝ භික්ඛවේ සෝ පුරිසෝ බහුන්නං වස්සානං බහුන්නං වස්සසතානං බහුන්නං වස්සසහස්සානං අච්චයේන දිබ්බං චක්කරතනං ඕසක්කිතං ඨානා චුතං. දිස්වාන යේන රාජා දළ්හනේමි තේනුපසංකමි, උපසංකමිත්වා රාජානං දළ්හනේමිං ඒතදවෝච: යග්ඝේ දේව ජානෙය්‍යාසි දිබ්බං තේ චක්කරතනං ඕසක්කිතං ඨානා චුතන්ති.

>
<


3.
අථ ඛෝ භික්ඛවේ රාජා දළ්හනේමි ජෙට්ඨපුත්තං කුමාරං ආමන්තෙත්වා ඒතදවෝච: දිබ්බං කිර මේ තාත කුමාර චක්කරතනං ඕසක්කිතං ඨානා චුතං. සුතං ඛෝ පන මේතං ‘යස්ස රඤ්ඤෝ චක්කවත්තිස්ස දිබ්බං චක්කරතනං ඕසක්කති, ඨානා චවති, න’දානි තේන රඤ්ඤා චිරං ජීවිතබ්බං හෝතී’ති. භුත්තා ඛෝ පන මේ මානුසිකා කාමා, සමයෝ’දානි මේ දිබ්බේ කාමේ පරියේසිතුං. ඒහි ත්වං තාත කුමාර ඉමං සමුද්දපරියන්තං පඨවිං පටිපජ්ජ. අහං පන කේසමස්සුං ඕහාරෙත්වා, කාසායානි වත්ථානි අච්ඡාදෙත්වා, අගාරස්මා අනගාරියං පබ්බජිස්සාමී”ති. අථ ඛෝ භික්ඛවේ රාජා දළ්හනේමි ජෙට්ඨපුත්තං කුමාරං සාධුකං රජ්ජේ සමනුසාසිත්වා, කේසමස්සුං ඕහාරෙත්වා, කාසායානි වත්ථානි අච්ඡාදෙත්වා, අගාරස්මා අනගාරියං පබ්බජි. සත්තාහපබ්බජිතේ ඛෝ පන භික්ඛවේ රාජිසිම්හි දිබ්බං චක්කරතනං අන්තරධායි.

අථ ඛෝ භික්ඛවේ අඤ්ඤතරෝ පුරිසෝ යේන රාජා ඛත්තියෝ මුද්ධාභිසිත්තෝ තේනුපසංකමි. උපසංකමිත්වා රාජානං ඛත්තියං මුද්ධාභිසිත්තං ඒතදවෝච: යග්ඝේ දේව ජානෙය්‍යාසි දිබ්බං චක්කරතනං අන්තරහිතන්ති. අථ ඛෝ භික්ඛවේ රාජා ඛත්තියෝ මුද්ධාභිසිත්තෝ දිබ්බේ චක්කරතනේ අන්තරහිතේ අනත්තමනෝ අහෝසි. අනත්තමනතඤ්ච පටිසංවේදේසි. සෝ යේන රාජිසි තේනුපසංකමි. උපසංකමිත්වා රාජිසිං ඒතදවෝච: යග්ඝේ දේව ජානෙය්‍යාසි දිබ්බං චක්කරතනං අන්තරහිතන්ති. ඒවං වුත්තේ භික්ඛවේ රාජිසි රාජානං ඛත්තියං මුද්ධාභිසිත්තං ඒතදවෝච: ‘මා ඛෝ ත්වං තාත දිබ්බේ චක්කරතනේ අන්තරහිතේ අනත්තමනෝ අහෝසි, මා අනත්තමනතඤ්ච පටිසංවේදේසි න හි තේ තාත දිබ්බං චක්කරතනං පෙත්තිකං දායජ්ජං, ඉංඝ ත්වං තාත අරියේ චක්කවත්තිවත්තේ වත්තාහි ඨානං ඛෝ පනේතං විජ්ජති යන්තේ අරියේ චක්කවත්තිවත්තේ වත්තමානස්ස තදහුපෝසථේ පණ්ණරසේ සීසං නහාතස්ස උපෝසථිකස්ස උපරිපාසාදවරගතස්ස දිබ්බං චක්කරතනං පාතුභවිස්සති සහස්සාරං සනේමිකං සනාභිකං සබ්බාකාරපරිපූර”න්ති.

>
<

4.
“කතමං පන තං දේව අරියං චක්කවත්තිවත්තන්ති” ?

“තේන හි ත්වං තාත ධම්මං යේව නිස්සාය ධම්මං සක්කරොන්තෝ ධම්මං ගරුකරොන්තෝ ධම්මං මානෙන්තෝ ධම්මං පූජෙන්තෝ ධම්මං අපචායමානෝ, ධම්මද්ධජෝ ධම්මකේතු ධම්මාධිපතෙය්‍යෝ ධම්මිකං රක්ඛාවරණගුත්තිං සංවිදහස්සු අන්තෝජනස්මිං.

ධම්මං යේව නිස්සාය ….(පෙ)…. බලකායස්මිං

ධම්මං යේව නිස්සාය ….(පෙ)…. ඛත්තියේසු අන්නුස්සුතේසු.

ධම්මං යේව නිස්සාය ….(පෙ)…. බ්‍රාහ්මණගහපතිකේසු,

ධම්මං යේව නිස්සාය ….(පෙ)…. නේගමජානපදේසු,

ධම්මං යේව නිස්සාය ….(පෙ)…. සමණබ්‍රාහ්මණේසු,

ධම්මං යේව නිස්සාය ….(පෙ)….මිගපක්ඛීසු.

මා ච තේ තාත විජිතේ අධම්මකාරෝ පවත්තිත්ථ.

යේ ච තේ තාත විජිතේ අධනා අස්සු, තේසඤ්ච ධනමනුප්පදෙය්‍යාසි.

යේ ච තේ තාත විජිතේ සමණබ්‍රාහ්මණා මදප්පමාදා පටිවිරතා ඛන්තිසෝරච්චේ නිවිට්ඨා ඒකමත්තානං දමෙන්ති, ඒකමත්තානං සමෙන්ති, ඒකමත්තානං පරිනිබ්බාපෙන්ති. තේ කාලේන කාලං උපසංකමිත්වා පරිපුච්ඡෙය්‍යාසි පරිපඤ්හෙය්‍යාසි: කිං භන්තේ කුසලං, කිං අකුසලං, කිං සාවජ්ජං කිං අනවජ්ජං, කිං සේවිතබ්බං කිං න සේවිතබ්බං, කිං මේ කරීයමානං දීඝරත්තං අහිතාය දුක්ඛාය අස්ස, කිං වා පන මේ කරීයමානං දීඝරත්තං හිතාය සුඛාය අස්සා?”ති. තේසං සුත්වා යං අකුසලං තං අභිනිවජ්ජෙය්‍යාසි, යං කුසලං තං සමාදාය වත්තෙය්‍යාසි.

ඉදං ඛෝ තාත අරියං චක්කවත්තිවත්ත”න්ති.

“ඒවං දේවා”ති ඛෝ භික්ඛවේ රාජා ඛත්තියෝ මුද්ධාභිසිත්තෝ රාජිසිස්ස පටිස්සුත්වා අරියේ චක්කවත්තිවත්තේ වත්ති. තස්ස අරියේ චක්කවත්තිවත්තේ වත්තමානස්ස තදහුපෝසථේ පණ්ණරසේ සීසං නහාතස්ස උපෝසථිකස්ස උපරිපාසාදවරගතස්ස දිබ්බං චක්කරතනං පාතුරහෝසි සහස්සාරං සනේමිකං සනාභිකං සබ්බාකාරපරිපූරං. දිස්වාන රඤ්ඤෝ ඛත්තියස්ස මුද්ධාභිසිත්තස්ස ඒතදහෝසි: සුතං ඛෝ පන මේතං යස්ස රඤ්ඤෝ ඛත්තියස්ස මුද්ධාභිසිත්තස්ස තදහුපෝසථේ පණ්ණරසේ සීසං නහාතස්ස උපෝසථිකස්ස උපරිපාසාදවරගතස්ස දිබ්බං චක්කරතනං පාතුභවති. සහස්සාරං සනේමිකං සනාභිකං සබ්බාකාරපරිපූරං, සෝ හෝති රාජා චක්කවත්තී’ති. අස්සං නු ඛෝ අහං රාජා චක්කවත්තී”ති.
>
<

5.
අථ ඛෝ භික්ඛවේ රාජා ඛත්තියෝ මුද්ධාභිසිත්තෝ උට්ඨායාසනා, ඒකංසං උත්තරාසංගං කරිත්වා වාමේන හත්ථේන භිංකාරං ගහෙත්වා දක්ඛිණේන හත්ථේන චක්කරතනං අබ්භුක්කිරි, ‘පවත්තතු භවං චක්කරතනං, අභිවිජිනාතු භවං චක්කරතන’න්ති. අථ ඛෝ තං භික්ඛවේ චක්කරතනං පුරත්ථිමං දිසං පවත්ති, අන්වදේව රාජා චක්කවත්තී සද්ධිං චතුරංගිනියා සේනාය. යස්මිං ඛෝ පන භික්ඛවේ පදේසේ චක්කරතනං පතිට්ඨාසි, තත්ථ රාජා චක්කවත්තී වාසං උපගඤ්ඡි සද්ධිං චතුරංගිනියා සේනාය. යේ ඛෝ පන භික්ඛවේ පුරත්ථිමාය දිසාය පටිරාජානෝ, තේ රාජානං චක්කවත්තිං උපසංකමිත්වා ඒවමාහංසු: ඒහි ඛෝ මහාරාජ, ස්වාගතං තේ මහාරාජ සකන්තේ මහාරාජ, අනුසාස මහාරාජා’ති.

රාජා චක්කවත්තී ඒවමාහ:

පාණෝ න හන්තබ්බෝ. අදින්නං නාදාතබ්බං කාමේසුමිච්ඡා න චරිතබ්බා. මුසා න භාසිතබ්බා. මජ්ජං න පාතබ්බං. යථාභුත්තඤ්ච භුඤ්ජථා’ති.

යේ ඛෝ පන භික්ඛවේ පුරත්ථිමාය දිසාය පටිරාජානෝ තේ රඤ්ඤෝ චක්කවත්තිස්ස අනුයුත්තා අහේසුං.

අථ ඛෝ තං භික්ඛවේ චක්කරතනං පුරත්ථිමං සමුද්දං අජ්ඣෝගාහිත්වා පච්චුත්තරිත්වා දක්ඛිණං දිසං පවත්ති ….(පෙ)…. අනුයුත්තා අහේසුං.

අථ ඛෝ තං භික්ඛවේ චක්කරතනං දක්ඛිණං සමුද්දං අජ්ඣෝගාහිත්වා පච්චුත්තරිත්වා පච්ඡිමං දිසං පවත්ති, අන්වදේව රාජා චක්කවත්තී සද්ධිං චතුරංගිනියා සේනාය. යස්මිං ඛෝ පන භික්ඛවේ පදේසේ දිබ්බං චක්කරතනං පතිට්ඨාසි, තත්ථ රාජා චක්කවත්තී වාසං උපගඤ්ඡි සද්ධිං චතුරංගිනියා සේනාය. යේ ඛෝ පන භික්ඛවේ පච්ඡිමාය දිසාය පටිරාජානෝ, තේ රාජානං චක්කවත්තිං උපසංකමිත්වා ඒවමාහංසු: ඒහි ඛෝ මහාරාජ, ස්වාගතං තේ මහාරාජ, සකන්තේ මහාරාජ, අනුසාස මහාරාජා’ති.

රාජා චක්කවත්තී ඒවමාහ:

පාණෝ න හන්තබ්බෝ, අදින්නං නාදාතබ්බං, කාමේසුමිච්ඡා න චරිතබ්බා, මුසා න භාසිතබ්බා, මජ්ජං න පාතබ්බං, යථාභුත්තඤ්ච භුඤ්ජථා’ති. යේ ඛෝ පන භික්ඛවේ පච්ඡිමාය දිසාය පටිරාජානෝ, තේ රඤ්ඤෝ චක්කවත්තිස්ස අනුයුත්තා අහේසුං.

අථ ඛෝ තං භික්ඛවේ චක්කරතනං පච්ඡිමං සමුද්දං අජ්ඣෝගාහිත්වා පච්චුත්තරිත්වා උත්තරං දිසං පවත්ති, අන්වදේව රාජා චක්කවත්තී සද්ධිං චතුරංගිනියා සේනාය. යස්මිං ඛෝ පන භික්ඛවේ පදේසේ දිබ්බං චක්කරතනං පතිට්ඨාසි, තත්ථ රාජා චක්කවත්තී වාසං උපගඤ්ඡි සද්ධිං චතුරංගිනියා සේනාය. යේ ඛෝ පන භික්ඛවේ උත්තරාය දිසාය පටිරාජානෝ තේ රාජානං චක්කවත්තිං උපසංකමිත්වා ඒවමාහංසු: ඒහි ඛෝ මහාරාජ, ස්වාගතං තේ මහාරාජ, සකන්තේ මහාරාජ, අනුසාස මහාරාජා’ති. රාජා චක්කවත්තී ඒවමාහ: පාණෝ න හන්තබ්බෝ, අදින්නං නාදාතබ්බං, කාමේසුමිච්ඡා න චරිතබ්බා, මුසා න භාසිතබ්බා, මජ්ජං න පාතබ්බං, යථාභුත්තඤ්ච භුඤ්ජථා’ති.

යේ ඛෝ පන භික්ඛවේ උත්තරාය දිසාය පටිරාජානෝ තේ රඤ්ඤෝ චක්කවත්තිස්ස අනුයුත්තා අහේසුං.
>
<
6.
අථ ඛෝ තං භික්ඛවේ චක්කරතනං සමුද්දපරියන්තං පඨවිං අභිවිජිනිත්වා තමේව රාජධානිං පච්චාගන්ත්වා රඤ්ඤෝ චක්කවත්තිස්ස අන්තේපුරද්වාරේ අත්ථකරණප්පමුඛේ අක්ඛාහතං මඤ්ඤේ අට්ඨාසි, රඤ්ඤෝ චක්කවත්තිස්ස අන්තේපුරං උපසෝභයමානං. ….(පෙ)….

දුතියෝ පි ඛෝ භික්ඛවේ රාජා චක්කවත්තී ….(පෙ)…. තතියෝ පි ඛෝ භික්ඛවේ රාජා චක්කවත්තී ….(පෙ)…. චතුත්ථෝ පි ඛෝ භික්ඛවේ රාජා චක්කවත්තී ….(පෙ)…. පඤ්චමෝ පි ඛෝ භික්ඛවේ රාජා චක්කවත්තී ….(පෙ)…. ඡට්ඨෝ පි ඛෝ භික්ඛවේ රාජා චක්කවත්තී ….(පෙ)…. සත්තමෝ පි ඛෝ භික්ඛවේ රාජා චක්කවත්තී බහුන්නං වස්සානං බහුන්නං වස්සසතානං බහුන්නං වස්සසහස්සානං අච්චයේන අඤ්ඤතරං පුරිසං ආමන්තේසි: යදා ත්වං අම්භෝ පුරිස පස්සෙය්‍යාසි දිබ්බං චක්කරතනං ඕසක්කිතං ඨානා චුතං, අථ මේ ආරෝචෙය්‍යාසී’ති. ‘ඒවං දේවා’ති ඛෝ භික්ඛවේ සෝ පුරිසෝ රඤ්ඤෝ චක්කවත්තිස්ස පච්චස්සෝසි. අද්දසා ඛෝ භික්ඛවේ සෝ පුරිසෝ බහුන්නං වස්සානං බහුන්නං වස්සසතානං බහුන්නං වස්සසහස්සානං අච්චයේන දිබ්බං චක්කරතනං ඕසක්කිතං ඨානා චුතං, දිස්වාන යේන රාජා චක්කවත්තී තේනුපසංකමි, උපසංකමිත්වා රාජානං චක්කවත්තිං ඒතදවෝච: යග්ඝේ දේව ජානෙය්‍යාසි දිබ්බන්තේ චක්කරතනං ඕසක්කිතං ඨානා චුතන්ති.
>
<
7.
අථ ඛෝ භික්ඛවේ රාජා චක්කවත්තී ජෙට්ඨපුත්තං කුමාරං ආමන්තෙත්වා ඒතදවෝච: “දිබ්බං කිර මේ තාත කුමාර චක්කරතනං ඕසක්කිතං ඨානා චුතං, සුතං ඛෝ පන මේතං යස්ස රඤ්ඤෝ චක්කවත්තිස්ස දිබ්බං චක්කරතනං ඕසක්කති ඨානා චවති, න’දානි තේන රඤ්ඤා චිරං ජීවිතබ්බං හෝතී’ති. භුත්තා ඛෝ පන මේ මානුසිකා කාමා, සමයෝ’දානි මේ දිබ්බේ කාමේ පරියේසිතුං. ඒහි ත්වං තාත කුමාර, ඉමං සමුද්දපරියන්තං පඨවිං පටිපජ්ජ, අහං පන කේසමස්සුං ඕහාරෙත්වා කාසායානි වත්ථානි අච්ඡාදෙත්වා අගාරස්මා අනගාරියං පබ්බජිස්සාමී”ති. අථ ඛෝ භික්ඛවේ රාජා චක්කවත්තී ජෙට්ඨපුත්තං කුමාරං සාධුකං රජ්ජේ සමනුසාසිත්වා, කේසමස්සුං ඕහාරෙත්වා කාසායානි වත්ථානි අච්ඡාදෙත්වා අගාරස්මා අනගාරියං පබ්බජි. සත්තාහපබ්බජිතේ ඛෝ පන භික්ඛවේ රාජිසිම්හි දිබ්බං චක්කරතනං අන්තරධායි. අථ ඛෝ භික්ඛවේ අඤ්ඤතරෝ පුරිසෝ ….(පෙ)…. අන්තරහිතන්ති. අථ ඛෝ භික්ඛවේ රාජා ඛත්තියෝ මුද්ධාභිසිත්තෝ දිබ්බේ චක්කරතනේ අන්තරහිතේ අනත්තමනෝ අහෝසි, අනත්තමනතඤ්ච පටිසංවේදේසි. නෝ ච ඛෝ රාජිසිං උපසංකමිත්වා අරියං චක්කවත්තිවත්තං පුච්ඡි. සෝ සමතේනේව සුදං ජනපදං පසාසති. තස්ස සමතේන ජනපදං පසාසතෝ පුබ්බේනාපරං ජනපදා න පබ්බන්ති යථා තං පුබ්බකානං රාජූනං අරියේ චක්කවත්තිවත්තේ වත්තමානානං.
>
<
8.
අථ ඛෝ භික්ඛවේ අමච්චා පාරිසජ්ජා ගණකා මහාමත්තා අනීකට්ඨා දෝවාරිකා මන්තස්සාජීවිනෝ සන්නිපතිත්වා රාජානං ඛත්තියං මුද්ධාභිසිත්තං ඒතදවෝචුං: “න ඛෝ තේ දේව සමතේන සුදං ජනපදං පසාසතෝ පුබ්බේනාපරං ජනපදා පබ්බන්ති යථා තං පුබ්බකානං රාජූනං අරියේ චක්කවත්තිවත්තේ වත්තමානානං. සංවිජ්ජන්ති ඛෝ තේ දේව විජිතේ අමච්චා පාරිසජ්ජා ගණකා මහාමත්තා අනීකට්ඨා දෝවාරිකා මන්තස්සාජීවිනෝ, මයඤ්චේව අඤ්ඤේ ච, යේ මයං අරියං චක්කවත්තිවත්තං ධාරේම. ඉංඝ ත්වං දේව අම්හේ අරියං චක්කවත්තිවත්තං පුච්ඡ, තස්ස තේ මයං අරියං චක්කවත්තිවත්තං පුට්ඨා බ්‍යාකරිස්සාමා”ති.

[ ආයුවණ්ණාදිපරිහාණිකථා ]

අථ ඛෝ භික්ඛවේ රාජා ඛත්තියෝ මුද්ධාභිසිත්තෝ අමච්චේ පාරිසජ්ජේ ගණකේ මහාමත්තේ අනීකට්ඨේ දෝවාරිකේ මන්තස්සාජීවිනෝ සන්නිපාතාපෙත්වා අරියං චක්කවත්තිවත්තං පුච්ඡි.

තස්ස තේ අරියං චක්කවත්තිවත්තං පුට්ඨා බ්‍යාකරිංසු. තේසං සුත්වා ධම්මිකඤ්හි ඛෝ රක්ඛාවරණගුත්තිං සංවිදහි. නෝ ච ඛෝ අධනානං ධනමනුප්පදාසි අධනානං ධනේ අනනුප්පදීයමානේ දාළිද්දියං වේපුල්ලමගමාසි. දාළිද්දියේ වේපුල්ලං ගතේ අඤ්ඤතරෝ පුරිසෝ පරේසං අදින්නං ථෙය්‍යසංඛාතං ආදියි. තමේනං අග්ගහේසුං ගහෙත්වා රඤ්ඤෝ ඛත්තියස්ස මුද්ධාභිසිත්තස්ස දස්සේසුං අයං දේව පුරිසෝ පරේසං අදින්නං ථෙය්‍යසංඛාතං ආදියී’ති. ඒවං වුත්තේ භික්ඛවේ රාජා ඛත්තියෝ මුද්ධාභිසිත්තෝ තං පුරිසං ඒතදවෝච: “සච්චං කිර ත්වං අම්භෝ පුරිස පරේසං අදින්නං ථෙය්‍යසංඛාතං ආදියී?”ති. “සච්චං දේවාති”. “කිං කාරණා?”ති. “න හි දේව ජීවාමී”ති.
>
<
9.
අථ ඛෝ භික්ඛවේ රාජා ඛත්තියෝ මුද්ධාභිසිත්තෝ තස්ස පුරිසස්ස ධනමනුප්පාදාසි “ඉමිනා ත්වං අම්භෝ පුරිස ධනේන අත්තනා ච ජීවාහි, මාතාපිතරෝ ච පෝසේහි, පුත්තදාරඤ්ච පෝසේහි, කම්මන්තේ ච පයෝජේහි, සමණබ්‍රාහ්මණේසු උද්ධග්ගිකං දක්ඛිණං පතිට්ඨපේහි, සෝවග්ගිකං සුඛවිපාකං සග්ගසංවත්තනිකන්ති”. “ඒවං දේවා”ති ඛෝ භික්ඛවේ සෝ පුරිසෝ රඤ්ඤෝ ඛත්තියස්ස මුද්ධාභිසිත්තස්ස පච්චස්සෝසි. අඤ්ඤතරෝ පි ඛෝ භික්ඛවේ පුරිසෝ පරේසං අදින්නං ථෙය්‍යසංඛාතං ආදියි. තමේනං අග්ගහේසුං ගහෙත්වා රඤ්ඤෝ ඛත්තියස්ස මුද්ධාභිසිත්තස්ස දස්සේසුං “අයං දේව පුරිසෝ පරේසං අදින්නං ථෙය්‍යසංඛාතං ආදියී”ති. ඒවං වුත්තේ භික්ඛවේ රාජා ඛත්තියෝ මුද්ධාභිසිත්තෝ තං පුරිසං ඒතදවෝච: “සච්චං කිර ත්වං අම්භෝ පුරිස පරේසං අදින්නං ථෙය්‍යසංඛාතං ආදියී”ති. “සච්චං දේවා”ති. “කිං කාරණා?”ති. “න හි දේව ජීවාමී”ති. අථ ඛෝ භික්ඛවේ රාජා ඛත්තියෝ මුද්ධාභිසිත්තෝ තස්ස පුරිසස්ස ධනමනුප්පදාසි “ඉමිනා ත්වං අම්භෝ පුරිස ධනේන අත්තනා ච ජීවාහි, මාතාපිතරෝ ච පෝසේහි, පුත්තදාරඤ් ච පෝසේහි, කම්මන්තේ ච පයෝජේහි, සමණබ්‍රාහ්මණේසු උද්ධග්ගිකං දක්ඛිණං පතිට්ඨපේහි, සෝවග්ගිකං සුඛවිපාකං සග්ගසංවත්තනිකන්ති”. “ඒවං දේවා”ති ඛෝ භික්ඛවේ සෝ පුරිසෝ රඤ්ඤෝ ඛත්තියස්ස මුද්ධාභිසිත්තස්ස පච්චස්සෝසි.

අස්සෝසුං ඛෝ භික්ඛවේ මනුස්සා: යේ කිර භෝ පරේසං අදින්නං ථෙය්‍යසංඛාතං ආදියන්ති, තේසං රාජා ධනමනුප්පදේතීති. සුත්වාන තේසං ඒතදහෝසි: “යන්නූන මයම්පි පරේසං අදින්නං ථෙය්‍යසංඛාතං ආදියෙය්‍යාමා”ති.

අථ ඛෝ භික්ඛවේ අඤ්ඤතරෝ පුරිසෝ පරේසං අදින්නං ථෙය්‍යසංඛාතං ආදියි. තමේනං අග්ගහේසුං ගහෙත්වා රඤ්ඤෝ ඛත්තියස්ස මුද්ධාභිසිත්තස්ස දස්සේසුං “අයං දේව පුරිසෝ පරේසං අදින්නං ථෙය්‍යසංඛාතං ආදියී”ති.

ඒවං වුත්තේ භික්ඛවේ රාජා ඛත්තියෝ මුද්ධාභිසිත්තෝ තං පුරිසං ඒතදවෝච: “සච්චං කිර ත්වං අම්භෝ පුරිස පරේසං අදින්නං ථෙය්‍යසංඛාතං ආදියී”ති. “සච්චං දේවා”ති. “කිං කාරණා?”ති. “න හි දේව ජීවාමී”ති. අථ ඛෝ භික්ඛවේ රඤ්ඤෝ ඛත්තියස්ස මුද්ධාභිසිත්තස්ස ඒතදහෝසි: “සචේ ඛෝ අහං යෝ යෝ පි පරේසං අදින්නං ථෙය්‍යසංඛාතං ආදියිස්සති, තස්ස තස්ස ධනමනුප්පදස්සාමි, ඒවමිදං අදින්නාදානං පවඩ්ඪිස්සති. යන්නූනාහං ඉමං පුරිසං සුනිසේධං නිසේධෙය්‍යං මූලඡෙජ්ජං කරෙය්‍යං, සීසමස්ස ඡින්දෙය්‍ය”න්ති.
>
<
10.
අථ ඛෝ භික්ඛවේ රාජා ඛත්තියෝ මුද්ධාභිසිත්තෝ පුරිසේ ආණාපේසි: “තේන හි භණේ ඉමං පුරිසං දළ්හාය රජ්ජුයා පච්ඡාබාහං ගාළ්හබන්ධනං බන්ධිත්වා ඛුරමුණ්ඩං කරිත්වා, ඛරස්සරේන පණවේන රථියා රථිං සිංඝාටකේන සිංඝාටකං පරිනෙත්වා දක්ඛිණේන ද්වාරේන නික්ඛාමෙත්වා දක්ඛිණතෝ නගරස්ස සුනිසේධං නිසේධේථ, මූලඡෙජ්ජං කරෝථ, සීසමස්ස ඡින්දථා”ති. “ඒවං දේවා”ති ඛෝ භික්ඛවේ තේ පුරිසා රඤ්ඤෝ ඛත්තියස්ස මුද්ධාභිසිත්තස්ස පටිස්සුත්වා තං පුරිසං දළ්හාය රජ්ජුයා පච්ඡාබාහං ගාළ්හබන්ධනං බන්ධිත්වා ඛුරමුණ්ඩං කරිත්වා, ඛරස්සරේන පණවේන රථියා රථිං සිංඝාටකේන සිංඝාටකං පරිනෙත්වා, දක්ඛිණේන ද්වාරේන නික්ඛාමෙත්වා, දක්ඛිණතෝ නගරස්ස සුනිසේධං නිසේධේසුං මූලඡෙජ්ජං අකංසු, සීසමස්ස ඡින්දිංසු. අස්සෝසුං ඛෝ භික්ඛවේ මනුස්සා, “යේ කිර භෝ පරේසං අදින්නං ථෙය්‍යසංඛාතං ආදියන්ති, තේ රාජා සුනිසේධං නිසේධේති, මූලඡෙජ්ජං කරෝති, සීසානි තේසං ඡින්දතී”ති. සුත්වාන තේසං ඒතදහෝසි: යන්නූන මයම්පි තිණ්හානි සත්ථානි කාරාපෙස්සාම තිණ්හානි සත්ථානි කාරාපෙත්වා යේසං අදින්නං ථෙය්‍යසංඛාතං ආදියිස්සාම, තේ සුනිසේධං නිසේධෙස්සාම, මූලඡෙජ්ජං කරිස්සාම, සීසානි තේසං ඡින්දිස්සාමා”ති. තේ තිණ්හානි සත්ථානි කාරාපේසුං, තිණ්හානි සත්ථානි කාරාපෙත්වා ගාමඝාතම්පි උපක්කමිංසු කාතුං, නිගමඝාතම්පි උපක්කමිංසු කාතුං, නගරඝාතම්පි උපක්කමිංසු කාතුං, පන්ථදූහනම්පි උපක්කමිංසු කාතුං. යේසං තේ අදින්නං ථෙය්‍යසංඛාතං ආදියන්ති, තේ සුනිසේධං නිසේධෙන්ති, මූලඡෙජ්ජං කරොන්ති, සීසානි තේසං ඡින්දන්ති. ඉති ඛෝ භික්ඛවේ අධනානං ධනේ අනනුප්පදියමානේ දාළිද්දියං වේපුල්ලමගමාසි. දාළිද්දියේ වේපුල්ලං ගතේ අදින්නාදානං වේපුල්ලමගමාසි, අදින්නාදානේ වේපුල්ලං ගතේ සත්ථං වේපුල්ලමගමාසි. සත්ථේ වේපුල්ලං ගතේ පාණාතිපාතෝ වේපුල්ලමගමාසි. පාණාතිපාතේ වේපුල්ලං ගතේ තේසං සත්තානං ආයු පි පරිහායි, වණ්ණෝ පි පරිහායි, තේසං ආයුනා පි පරිහායමානානං වණ්ණේන පි පරිහායමානානං අසීතිවස්සසහස්සායුකානං මනුස්සානං පුත්තා චත්තාරීසං වස්සසහස්සායුකා අහේසුං.
>
<
11.
චත්තාරීසංවස්සසහස්සායුකේසු භික්ඛවේ මනුස්සේසු අඤ්ඤතරෝ පුරිසෝ පරේසං අදින්නං ථෙය්‍යසංඛාතං ආදියි. තමේනං අග්ගහේසුං, ගහෙත්වා රඤ්ඤෝ ඛත්තියස්ස මුද්ධාභිසිත්තස්ස දස්සේසුං “අයං දේව පුරිසෝ පරේසං අදින්නං ථෙය්‍යසංඛාතං ආදියී”ති. ඒවං වුත්තේ භික්ඛවේ රාජා ඛත්තියෝ මුද්ධාභිසිත්තෝ තං පුරිසං ඒතදවෝච: “සච්චං කිර ත්වං අම්භෝ පුරිස පරේසං අදින්නං ථෙය්‍යසංඛාතං ආදියී?”ති. “න හි දේවා”ති සම්පජානමුසා අභාසි. ඉති ඛෝ භික්ඛවේ අධනානං ධනේ අනනුප්පදියමානේ දාළිද්දියං වේපුල්ලමගමාසි. දාළිද්දියේ වේපුල්ලං ගතේ අදින්නාදානං වේපුල්ලමගමාසි. අදින්නාදානේ වේපුල්ලං ගතේ සත්ථං වේපුල්ලමගමාසි. සත්ථේ වේපුල්ලං ගතේ පාණාතිපාතෝ වේපුල්ලමගමාසි. පාණාතිපාතේ වේපුල්ලං ගතේ මුසාවාදෝ වේපුල්ලමගමාසි මුසාවාදේ වේපුල්ලං ගතේ තේසං සත්තානං ආයු පි පරිහායි, වණ්ණෝ පි පරිහායි, තේසං ආයුනා පි පරිහායමානානං වණ්ණේන පි පරිහායමානානං චත්තාරීසවස්සසහස්සායුකානං මනුස්සානං වීසතිවස්සසහස්සායුකා පුත්තා අහේසුං. වීසතිවස්සසහස්සායුකේසු භික්ඛවේ මනුස්සේසු අඤ්ඤතරෝ පුරිසෝ පරේසං අදින්නං ථෙය්‍යසංඛාතං ආදියි. තමේනං අඤ්ඤතරෝ පුරිසෝ රඤ්ඤෝ ඛත්තියස්ස මුද්ධාභිසිත්තස්ස ආරෝචේසි: “ඉත්ථන්නාමෝ දේව පුරිසෝ පරේසං අදින්නං ථෙය්‍යසංඛාතං ආදියී”ති පේසුඤ්ඤමකාසි. ඉති ඛෝ භික්ඛවේ අධනානං ධනේ අනනුප්පදියමානේ දාළිද්දියං වේපුල්ලමගමාසි. දාළිද්දියේ වේපුල්ලං ගතේ අදින්නාදානං වේපුල්ලමගමාසි. අදින්නාදානේ වේපුල්ලං ගතේ සත්ථං වේපුල්ලමගමාසි. සත්ථේ වේපුල්ලං ගතේ පාණාතිපාතෝ වේපුල්ලමගමාසි. පාණාතිපාතේ වේපුල්ලං ගතේ මුසාවාදෝ වේපුල්ලමගමාසි. මුසාවාදේ වේපුල්ලං ගතේ පිසුණා වාචා වේපුල්ලමගමාසි. පිසුණාය වාචාය වේපුල්ලං ගතාය තේසං සත්තානං ආයු පි පරිහායි වණ්ණෝ පි පරිහායි තේසං ආයුනා පි පරිහායමානානං වණ්ණේන පි පරිහායමානානං වීසතිවස්සසහස්සායුකානං මනුස්සානං දසවස්සසහස්සායුකා පුත්තා අහේසුං.
>
<
12.
දසවස්සසහස්සායුකේසු භික්ඛවේ මනුස්සේසු ඒකිදං සත්තා වණ්ණවන්තෝ හොන්ති, ඒකිදං සත්තා දුබ්බණ්ණා. තත්ථ යේ තේ සත්තා දුබ්බණ්ණා තේ වණ්ණවන්තේ සත්තේ අභිජ්ඣායන්තා පරේසං දාරේසු චාරිත්තං ආපජ්ජිංසු. ඉති ඛෝ භික්ඛවේ අධනානං ධනේ අනනුප්පදියමානේ දාළිද්දියං වේපුල්ලමගමාසි. දාළිද්දියේ වේපුල්ලං ගතේ ….(පෙ)…. කාමේසුමිච්ඡාචාරෝ වේපුල්ලමගමාසි, කාමේසුමිච්ඡාචාරේ වේපුල්ලං ගතේ තේසං සත්තානං ආයු පි පරිහායි වණ්ණෝ පි පරිහායි. තේසං ආයුනා පි පරිහායමානානං වණ්ණේන පි පරිහායමානානං දසවස්සසහස්සායුකානං මනුස්සානං පඤ්චවස්සසහස්සායුකා පුත්තා අහේසුං.
>
<
13. පඤ්චවස්සසහස්සායුකේසු භික්ඛවේ මනුස්සේසු ද්වේ ධම්මා වේපුල්ලමගමංසු ඵරුසාවාචා සම්ඵප්පලාපෝ ච ද්වීසු ධම්මේසු වේපුල්ලං ගතේසු තේසං සත්තානං ආයු පි පරිහායි, වණ්ණෝ පි පරිහායි. තේසං ආයුනා පි පරිහායමානානං වණ්ණේන පි පරිහායමානානං පඤ්චවස්සසහස්සායුකානං මනුස්සානං අප්පේකච්චේ අඩ්ඪතෙය්‍යවස්සසහස්සායුකා අප්පේකච්චේ ද්වේවස්සසහස්සායුකා පුත්තා අහේසුං. අඩ්ඪතෙය්‍යවස්සසහස්සායුකේසු භික්ඛවේ මනුස්සේසු අභිජ්ඣාව්‍යාපාදා වේපුල්ලමගමංසු. අභිජ්ඣාව්‍යාපාදේසු වේපුල්ලං ගතේසු තේසං සත්තානං ආයු පි පරිහායි, වණ්ණෝ පි පරිහායි. තේසං ආයුනා පි පරිහායමානානං වණ්ණේන පි පරිහායමානානං අඩ්ඪතෙය්‍යවස්සසහස්සායුකානං මනුස්සානං වස්සසහස්සායුකා පුත්තා අහේසුං. වස්සසහස්සායුකේසු භික්ඛවේ මනුස්සේසු මිච්ඡාදිට්ඨි වේපුල්ලමගමාසි. මිච්ඡාදිට්ඨියා වේපුල්ලං ගතාය තේසං සත්තානං ආයු පි පරිහායි, වණ්ණෝ පි පරිහායි. තේසං ආයුනා පි පරිහායමානානං වණ්ණේන පි පරිහායමානානං වස්සසහස්සායුකානං මනුස්සානං පඤ්චවස්සසතායුකා පුත්තා අහේසුං. පඤ්චවස්සසතායුකේසු භික්ඛවේ මනුස්සේසු තයෝ ධම්මා වේපුල්ලමගමංසු අධම්මරාගෝ විසමලෝභෝ මිච්ඡාධම්මෝ. තීසු ධම්මේසු වේපුල්ලං ගතේසු තේසං සත්තානං ආයු පි පරිහායි, වණ්ණෝ පි පරිහායි. තේසං ආයුනා පි පරිහායමානානං වණ්ණේන පි පරිහායමානානං පඤ්චවස්සසතායුකානං මනුස්සානං අප්පේකච්චේ අඩ්ඪතෙය්‍යවස්සසතායුකා අප්පේකච්චේ ද්වේවස්සසතායුකා පුත්තා අහේසුං. අඩ්ඪතෙය්‍යවස්සසතායුකේසු භික්ඛවේ මනුස්සේසු ඉමේ ධම්මා වේපුල්ලමගමංසු අමත්තෙය්‍යතා අපෙත්තෙය්‍යතා අසාමඤ්ඤතා අබ්‍රහ්මඤ්ඤතා න කුලේ ජෙට්ඨාපචායිතා.
>
<
14.
ඉති ඛෝ භික්ඛවේ අධනානං ධනේ අනනුප්පදියමානේ දාළිද්දියං වේපුල්ලමගමාසි, දාළිද්දියේ වේපුල්ලං ගතේ අදින්නාදානං වේපුල්ලමගමාසි. අදින්නාදානේ වේපුල්ලං ගතේ සත්ථං වේපුල්ලමගමාසි. සත්ථේ වේපුල්ලං ගතේ පාණාතිපාතෝ වේපුල්ලමගමාසි. පාණාතිපාතේ වේපුල්ලං ගතේ මුසාවාදෝ වේපුල්ලමගමාසි මුසාවාදේ වේපුල්ලං ගතේ පිසුණා වාචා වේපුල්ලමගමාසි පිසුණාය වාචාය වේපුල්ලං ගතාය කාමේසුමිච්ඡාචාරෝ වේපුල්ලමගමාසි කාමේසුමිච්ඡාචාරේ වේපුල්ලං ගතේ ද්වේ ධම්මා වේපුල්ලමගමංසු ඵරුසා වාචා සම්ඵප්පලාපෝ ච. ද්වීසු ධම්මේසු වේපුල්ලං ගතේසු අභිජ්ඣාව්‍යාපාදා වේපුල්ලමගමංසු, අභිජ්ඣාව්‍යාපාදේසු වේපුල්ලං ගතේසු මිච්ඡාදිට්ඨි වේපුල්ලමගමාසි මිච්ඡාදිට්ඨියා වේපුල්ලං ගතාය තයෝ ධම්මා වේපුල්ලමගමංසු අධම්මරාගෝ විසමලෝභෝ මිච්ඡාධම්මෝ. තීසු ධම්මේසු වේපුල්ලං ගතේසු ඉමේ ධම්මා වේපුල්ලමගමංසු අමත්තෙය්‍යතා අපෙත්තෙය්‍යතා අසාමඤ්ඤතා අබ්‍රහ්මඤ්ඤතා න කුලේ ජෙට්ඨාපචායිතා. ඉමේසු ධම්මේසු වේපුල්ලං ගතේසු තේසං සත්තානං ආයු පි පරිහායි වණ්ණෝ පි පරිහායි. තේසං ආයුනා පි පරිහායමානානං වණ්ණේන පි පරිහායමානානං අඩ්ඪතෙය්‍යවස්සසතායුකානං මනුස්සානං වස්සසතායුකා පුත්තා අහේසුං.


[ දසවස්සායුකසමයෝ ]
>

<
15.
භවිස්සති භික්ඛවේ සෝ සමයෝ යං ඉමේසං මනුස්සානං දසවස්සායුකා පුත්තා භවිස්සන්ති. දසවස්සායුකේසු භික්ඛවේ මනුස්සේසු පඤ්චවස්සිකා කුමාරිකා අලම්පතෙය්‍යා භවිස්සන්ති. දසවස්සායුකේසු භික්ඛවේ මනුස්සේසු ඉමානි රසානි අන්තරධායිස්සන්ති, සෙය්‍යථීදං සප්පි නවනීතං තේලං මධු ඵාණිතං ලෝණං. දසවස්සායුකේසු භික්ඛවේ මනුස්සේසු කුද්‍රෑසකෝ අග්ගං භෝජනානං භවිස්සති. සෙය්‍යථාපි භික්ඛවේ ඒතරහි සාලිමංසෝදනෝ අග්ගං භෝජනානං, ඒවමේව ඛෝ භික්ඛවේ දසවස්සායුකේසු මනුස්සේසු කුද්‍රෑසකෝ අග්ගං භෝජනානං භවිස්සති. දසවස්සායුකේසු භික්ඛවේ මනුස්සේසු දස කුසලකම්මපථා සබ්බේන සබ්බං අන්තරධායිස්සන්ති, දස අකුසලකම්මපථා අතිබ්‍යාදිප්පිස්සන්ති. දසවස්සායුකේසු භික්ඛවේ මනුස්සේසු කුසලන්තිපි න භවිස්සති. කුතෝ පන කුසලස්ස කාරකෝ. දසවස්සායුකේසු භික්ඛවේ මනුස්සේසු යේ තේ භවිස්සන්ති අමත්තෙය්‍යා අපෙත්තෙය්‍යා අසාමඤ්ඤා අබ්‍රහ්මඤ්ඤා න කුලේ ජෙට්ඨාපචායිනෝ, තේ පුජ්ජා ච භවිස්සන්ති පාසංසා ච. සෙය්‍යථාපි භික්ඛවේ ඒතරහි මත්තෙය්‍යා පෙත්තෙය්‍යා සාමඤ්ඤා බ්‍රහ්මඤ්ඤා කුලේ ජෙට්ඨාපචායිනෝ පුජ්ජා ච පාසංසා ච, ඒවමේව ඛෝ භික්ඛවේ දසවස්සායුකේසු මනුස්සේසු යේ තේ භවිස්සන්ති අමත්තෙය්‍යා අපෙත්තෙය්‍යා අසාමඤ්ඤා අබ්‍රහ්මඤ්ඤා න කුලේ ජෙට්ඨාපචායිනෝ, තේ පුජ්ජා ච භවිස්සන්ති පාසංසා ච. දසවස්සායුකේසු භික්ඛවේ මනුස්සේසු න භවිස්සති මාතා ති වා මාතුච්ඡා ති වා මාතුලානී ති වා ආචරියභරියා ති වා ගරූනං දාරෝ ති වා සම්භේදං ලෝකෝ ගමිස්සති යථා අජේළකා කුක්කුටසූකරා සෝණසිගාලා.
>
<
16.
දසවස්සායුකේසු භික්ඛවේ මනුස්සේසු තේසං සත්තානං අඤ්ඤමඤ්ඤම්හි තිබ්බෝ ආඝාතෝ පච්චුපට්ඨිතෝ භවිස්සති, තිබ්බෝ බ්‍යාපාදෝ, තිබ්බෝ මනෝපදෝසෝ, තිබ්බං වධකචිත්තං මාතු පි පුත්තම්හි, පුත්තස්ස පි මාතරි, පිතු පි පුත්තම්හි පුත්තස්ස පි පිතරි, භාතු පි භාතරි භතු පි භගිනියා, භගිනියා පි භාතරි, තිබ්බෝ ආඝාතෝ පච්චුපට්ඨිතෝ භවිස්සති තිබ්බෝ බ්‍යාපාදෝ තිබ්බෝ මනෝපදෝසෝ තිබ්බං වධකචිත්තං. සෙය්‍යථාපි භික්ඛවේ මාගවිකස්ස මිගං දිස්වා තිබ්බෝ ආඝාතෝ පච්චුපට්ඨිතෝ හෝති තිබ්බෝ බ්‍යාපාදෝ තිබ්බෝ මනෝපදෝසෝ තිබ්බං වධකචිත්තං ඒවමේව ඛෝ භික්ඛවේ දසවස්සායුකේසු මනුස්සේසු තේසං සත්තානං අඤ්ඤමඤ්ඤම්හි තිබ්බෝ ආඝාතෝ පච්චුපට්ඨිතෝ භවිස්සති තිබ්බෝ බ්‍යාපාදෝ තිබ්බෝ මනෝපදෝසෝ තිබ්බං වධකචිත්තං මාතු පි පුත්තම්හි පුත්තස්ස පි මාතරි, පිතු පි පුත්තම්හි, පුත්තස්ස පි පිතරි, භාතු පි භාතරි, භාතු පි භගිනියා, භගිනියා පි භාතරි, තිබ්බෝ ආඝාතෝ පච්චුපට්ඨිතෝ භවිස්සති, තිබ්බෝ බ්‍යාපාදෝ, තිබ්බෝ මනෝපදෝසෝ, තිබ්බං වධකචිත්තං. දසවස්සායුකේසු භික්ඛවේ මනුස්සේසු සත්තාහං සත්ථන්තරකප්පෝ භවිස්සති. තේ අඤ්ඤමඤ්ඤම්හි මිගසඤ්ඤං පටිලභිස්සන්ති. තේසං තිණ්හානි සත්ථානි හත්ථේසු පාතුභවිස්සන්ති. තේ තිණ්හේන සත්ථේන ‘ඒස මිගෝ ඒස මිගෝ’ති අඤ්ඤමඤ්ඤං ජීවිතා වෝරෝපෙස්සන්ති.

[ අයුවණ්ණාදිවඩ්ඪනකථා ]

17.
අථ ඛෝ තේසං භික්ඛවේ සත්තානං ඒකච්චානං ඒවං භවිස්සති, ‘මා ච මයං කඤ්චි, මා ච අම්හේ කෝචි, යන්නූන මයං තිණගහණං වා වනගහණං වා රුක්ඛගහණං වා නදීවිදුග්ගං වා පබ්බතවිසමං වා පවිසිත්වා වනමූලඵලාහාරා යාපෙය්‍යාමා’ති. තේ තිණගහණං වා වනගහණං වා රුක්ඛගහණං වා නදීවිදුග්ගං වා පබ්බතවිසමං වා පවිසිත්වා සත්තාහං වනමූලඵලාහාරා යාපෙස්සන්ති. තේ තස්ස සත්තාහස්ස අච්චයේන තිණගහණා වනගහණා රුක්ඛගහණා නදීවිදුග්ගා පබ්බතවිසමා නික්ඛමිත්වා අඤ්ඤමඤ්ඤං ආලිංගිත්වා සභාගායිස්සන්ති සමස්සාසිස්සන්ති ‘දිට්ඨා භෝ සත්ත ජීවසි, දිට්ඨා භෝ සත්ත ජීවසී’ති. අථ ඛෝ තේසං භික්ඛවේ සත්තානං ඒවං භවිස්සති ‘මයං ඛෝ අකුසලානං ධම්මානං සමාදානහේතු ඒවරූපං ආයතං ඤාතික්ඛයං පත්තා යන්නූන මයං කුසලං කරෙය්‍යාම.

කිං කුසලං කරෙය්‍යාම? යන්නූන මයං පාණාතිපාතා විරමෙය්‍යාම, ඉදං කුසලං ධම්මං සමාදාය වත්තෙය්‍යාමා”ති. තේ පාණාතිපාතා විරමිස්සන්ති. ඉදං කුසලං ධම්මං සමාදාය වත්තිස්සන්ති. තේ කුසලානං ධම්මානං සමාදානහේතු ආයුනා පි වඩ්ඪිස්සන්ති වණ්ණේන පි වඩ්ඪිස්සන්ති. තේසං ආයුනා පි වඩ්ඪමානානං වණ්ණේන පි වඩ්ඪමානානං දසවස්සායුකානං මනුස්සානං වීසතිවස්සායුකා පුත්තා භවිස්සන්ති. අථ ඛෝ තේසං භික්ඛවේ සත්තානං ඒවං භවිස්සති, “මයං ඛෝ කුසලානං ධම්මානං සමාදානහේතු ආයුනා පි වඩ්ඪාම, වණ්ණේන පි වඩ්ඪාම. යන්නූන මයං භිය්‍යෝසෝමත්තාය කුසලං කරෙය්‍යාම. කිං කුසලං කරෙය්‍යාම? යන්නූන මයං අදින්නාදානා විරමෙය්‍යාම, ඉදං කුසලං ධම්මං සමාදාය වත්තෙය්‍යාමා’ති. තේ පාණාතිපාතා විරමිස්සන්ති අදින්නාදානා විරමිස්සන්ති. ඉදං කුසලං ධම්මං සමාදාය වත්තිස්සන්ති. තේ කුසලානං ධම්මානං සමාදානහේතු අයුනා පි වඩ්ඪිස්සන්ති, වණ්ණේන පි වඩ්ඪිස්සන්ති. තේසං අයුනා පි වඩ්ඪමානානං වණ්ණේන පි වඩ්ඪමානානං වීසතිවස්සායුකානං මනුස්සානං චත්තාලීසතිවස්සායුකා පුත්තා භවිස්සන්ති.

අථ ඛෝ තේසං භික්ඛවේ සත්තානං ඒවං භවිස්සති, “මයං ඛෝ කුසලානං ධම්මානං සමාදානහේතු ආයුනා පි වඩ්ඪාම, වණ්ණේන පි වඩ්ඪාම. යන්නූන මයං භිය්‍යෝසෝමත්තාය කුසලං කරෙය්‍යාම. කිං කුසලං කරෙය්‍යාම? යන්නූන මයං කාමේසුමිච්ඡාචාරා විරමෙය්‍යාම, ඉදං කුසලං ධම්මං සමාදාය වත්තෙය්‍යාමා’ති. තේ පාණාතිපාතා විරමිස්සන්ති, අදින්නාදානා විරමිස්සන්ති, කාමේසුමිච්ඡාචාරා විරමිස්සන්ති. ඉදං කුසලං ධම්මං සමාදාය වත්තිස්සන්ති. තේ කුසලානං ධම්මානං සමාදානහේතු අයුනා පි වඩ්ඪිස්සන්ති, වණ්ණේන පි වඩ්ඪිස්සන්ති. තේසං අයුනා පි වඩ්ඪමානානං වණ්ණේන පි වඩ්ඪමානානං චත්තාලීසවස්සායුකානං මනුස්සානං අසීතිවස්සායුකා පුත්තා භවිස්සන්ති.
>
<
18.
අථ ඛෝ තේසං භික්ඛවේ සත්තානං ඒවං භවිස්සති, “මයං ඛෝ කුසලානං ධම්මානං සමාදානහේතු ආයුනා පි වඩ්ඪාම, වණ්ණේන පි වඩ්ඪාම. යන්නූන මයං භිය්‍යෝසෝමත්තාය කුසලං කරෙය්‍යාම. කිං කුසලං කරෙය්‍යාම? යන්නූන මයං මුසාවාදා විරමෙය්‍යාම, ඉදං කුසලං ධම්මං සමාදාය වත්තෙය්‍යාමා’ති. තේ පාණාතිපාතා විරමිස්සන්ති, අදින්නාදානා විරමිස්සන්ති, කාමේසුමිච්ඡාචාරා විරමිස්සන්ති, මුසාවාදා විරමිස්සන්ති. ඉදං කුසලං ධම්මං සමාදාය වත්තිස්සන්ති. තේ කුසලානං ධම්මානං සමාදානහේතු අයුනා පි වඩ්ඪිස්සන්ති, වණ්ණේන පි වඩ්ඪිස්සන්ති. තේසං අයුනා පි වඩ්ඪමානානං වණ්ණේන පි වඩ්ඪමානානං අසීතිවස්සායුකානං මනුස්සානං සට්ඨිවස්සසතායුකා පුත්තා භවිස්සන්ති.

අථ ඛෝ තේසං භික්ඛවේ සත්තානං ඒවං භවිස්සති, “මයං ඛෝ කුසලානං ධම්මානං සමාදානහේතු ආයුනා පි වඩ්ඪාම, වණ්ණේන පි වඩ්ඪාම. යන්නූන මයං භිය්‍යෝසෝමත්තාය කුසලං කරෙය්‍යාම. කිං කුසලං කරෙය්‍යාම? යන්නූන මයං පිසුණාය වාචාය විරමෙය්‍යාම, ඉදං කුසලං ධම්මං සමාදාය වත්තෙය්‍යාමා’ති. තේ පාණාතිපාතා විරමිස්සන්ති, අදින්නාදානා විරමිස්සන්ති, කාමේසුමිච්ඡාචාරා විරමිස්සන්ති, මුසාවාදා විරමිස්සන්ති, පිසුණාය වාචාය විරමිස්සන්ති. ඉදං කුසලං ධම්මං සමාදාය වත්තිස්සන්ති. තේ කුසලානං ධම්මානං සමාදානහේතු අයුනා පි වඩ්ඪිස්සන්ති, වණ්ණේන පි වඩ්ඪිස්සන්ති. තේසං අයුනා පි වඩ්ඪමානානං වණ්ණේන පි වඩ්ඪමානානං සට්ඨිවස්සසතායුකානං මනුස්සානං වීසතිවස්සසතායුකා පුත්තා භවිස්සන්ති.

අථ ඛෝ තේසං භික්ඛවේ සත්තානං ඒවං භවිස්සති, “මයං ඛෝ කුසලානං ධම්මානං සමාදානහේතු ආයුනා පි වඩ්ඪාම, වණ්ණේන පි වඩ්ඪාම. යන්නූන මයං භිය්‍යෝසෝමත්තාය කුසලං කරෙය්‍යාම. කිං කුසලං කරෙය්‍යාම? යන්නූන මයං ඵරුසාය වාචාය විරමෙය්‍යාම, ඉදං කුසලං ධම්මං සමාදාය වත්තෙය්‍යාමා’ති. තේ පාණාතිපාතා විරමිස්සන්ති, අදින්නාදානා විරමිස්සන්ති, කාමේසුමිච්ඡාචාරා විරමිස්සන්ති, මුසාවාදා විරමිස්සන්ති, පිසුණාය වාචාය විරමිස්සන්ති, ඵරුසාය වාචාය විරමිස්සන්ති. ඉදං කුසලං ධම්මං සමාදාය වත්තිස්සන්ති. තේ කුසලානං ධම්මානං සමාදානහේතු අයුනා පි වඩ්ඪිස්සන්ති, වණ්ණේන පි වඩ්ඪිස්සන්ති. තේසං අයුනා පි වඩ්ඪමානානං වණ්ණේන පි වඩ්ඪමානානං වීසතිවස්සසතායුකානං මනුස්සානං චත්තාරීසංඡබ්බස්සසතායුකා පුත්තා භවිස්සන්ති.

අථ ඛෝ තේසං භික්ඛවේ සත්තානං ඒවං භවිස්සති, “මයං ඛෝ කුසලානං ධම්මානං සමාදානහේතු ආයුනා පි වඩ්ඪාම, වණ්ණේන පි වඩ්ඪාම. යන්නූන මයං භිය්‍යෝසෝමත්තාය කුසලං කරෙය්‍යාම. කිං කුසලං කරෙය්‍යාම? යන්නූන මයං සම්ඵප්පලාපා විරමෙය්‍යාම, ඉදං කුසලං ධම්මං සමාදාය වත්තෙය්‍යාමා’ති. තේ පාණාතිපාතා විරමිස්සන්ති, අදින්නාදානා විරමිස්සන්ති, කාමේසුමිච්ඡාචාරා විරමිස්සන්ති, මුසාවාදා විරමිස්සන්ති, පිසුණාය වාචාය විරමිස්සන්ති, ඵරුසාය වාචාය විරමිස්සන්ති, සම්ඵප්පලාපා විරමිස්සන්ති. ඉදං කුසලං ධම්මං සමාදාය වත්තිස්සන්ති. තේ කුසලානං ධම්මානං සමාදානහේතු අයුනා පි වඩ්ඪිස්සන්ති, වණ්ණේන පි වඩ්ඪිස්සන්ති. තේසං අයුනා පි වඩ්ඪමානානං වණ්ණේන පි වඩ්ඪමානානං චත්තාරීසංඡබ්බස්සසතායුකානං මනුස්සානං ද්වේවස්සසහස්සායුකා පුත්තා භවිස්සන්ති.
>
<
19.
අථ ඛෝ තේසං භික්ඛවේ සත්තානං ඒවං භවිස්සති, “මයං ඛෝ කුසලානං ධම්මානං සමාදානහේතු ආයුනා පි වඩ්ඪාම, වණ්ණේන පි වඩ්ඪාම. යන්නූන මයං භිය්‍යෝසෝමත්තාය කුසලං කරෙය්‍යාම. කිං කුසලං කරෙය්‍යාම? යන්නූන මයං අභිජ්ඣං පජහෙය්‍යාම, ඉදං කුසලං ධම්මං සමාදාය වත්තෙය්‍යාමා’ති. තේ පාණාතිපාතා විරමිස්සන්ති, අදින්නාදානා විරමිස්සන්ති, කාමේසුමිච්ඡාචාරා විරමිස්සන්ති, මුසාවාදා විරමිස්සන්ති, පිසුණාය වාචාය විරමිස්සන්ති, ඵරුසාය වාචාය විරමිස්සන්ති, සම්ඵප්පලාපා විරමිස්සන්ති, අභිජ්ඣං පජහිස්සන්ති, ඉදං කුසලං ධම්මං සමාදාය වත්තිස්සන්ති. තේ කුසලානං ධම්මානං සමාදානහේතු අයුනා පි වඩ්ඪිස්සන්ති, වණ්ණේන පි වඩ්ඪිස්සන්ති. තේසං අයුනා පි වඩ්ඪමානානං වණ්ණේන පි වඩ්ඪමානානං ද්වේවස්සසහස්සායුකානං මනුස්සානං චත්තාරිවස්සසහස්සායුකා පුත්තා භවිස්සන්ති.

අථ ඛෝ තේසං භික්ඛවේ සත්තානං ඒවං භවිස්සති, “මයං ඛෝ කුසලානං ධම්මානං සමාදානහේතු ආයුනා පි වඩ්ඪාම, වණ්ණේන පි වඩ්ඪාම. යන්නූන මයං භිය්‍යෝසෝමත්තාය කුසලං කරෙය්‍යාම. කිං කුසලං කරෙය්‍යාම? යන්නූන මයං ව්‍යාපාදං පජහෙය්‍යාම, ඉදං කුසලං ධම්මං සමාදාය වත්තෙය්‍යාමා’ති. තේ පාණාතිපාතා විරමිස්සන්ති, අදින්නාදානා විරමිස්සන්ති, කාමේසුමිච්ඡාචාරා විරමිස්සන්ති, මුසාවාදා විරමිස්සන්ති, පිසුණාය වාචාය විරමිස්සන්ති, ඵරුසාය වාචාය විරමිස්සන්ති, සම්ඵප්පලාපා විරමිස්සන්ති, අභිජ්ඣං පජහිස්සන්ති, ව්‍යාපාදං පජහිස්සන්ති. ඉදං කුසලං ධම්මං සමාදාය වත්තිස්සන්ති. තේ කුසලානං ධම්මානං සමාදානහේතු අයුනා පි වඩ්ඪිස්සන්ති, වණ්ණේන පි වඩ්ඪිස්සන්ති. තේසං අයුනා පි වඩ්ඪමානානං වණ්ණේන පි වඩ්ඪමානානං චත්තාරිවස්සසහස්සායුකානං මනුස්සානං අට්ඨවස්සසහස්සායුකා පුත්තා භවිස්සන්ති.

අථ ඛෝ තේසං භික්ඛවේ සත්තානං ඒවං භවිස්සති, “මයං ඛෝ කුසලානං ධම්මානං සමාදානහේතු ආයුනා පි වඩ්ඪාම, වණ්ණේන පි වඩ්ඪාම. යන්නූන මයං භිය්‍යෝසෝමත්තාය කුසලං කරෙය්‍යාම. කිං කුසලං කරෙය්‍යාම? යන්නූන මයං මිච්ඡාදිට්ඨිං පජහෙය්‍යාම, ඉදං කුසලං ධම්මං සමාදාය වත්තෙය්‍යාමා’ති. තේ පාණාතිපාතා විරමිස්සන්ති, අදින්නාදානා විරමිස්සන්ති, කාමේසුමිච්ඡාචාරා විරමිස්සන්ති, මුසාවාදා විරමිස්සන්ති, පිසුණාය වාචාය විරමිස්සන්ති, ඵරුසාය වාචාය විරමිස්සන්ති, සම්ඵප්පලාපා විරමිස්සන්ති, අභිජ්ඣං පජහිස්සන්ති, ව්‍යාපාදං පජහිස්සන්ති, මිච්ඡාදිට්ඨිං පජහිස්සන්ති. ඉදං කුසලං ධම්මං සමාදාය වත්තිස්සන්ති. තේ කුසලානං ධම්මානං සමාදානහේතු අයුනා පි වඩ්ඪිස්සන්ති, වණ්ණේන පි වඩ්ඪිස්සන්ති. තේසං අයුනා පි වඩ්ඪමානානං වණ්ණේන පි වඩ්ඪමානානං අට්ඨවස්සසහස්සායුකානං මනුස්සානං වීසතිවස්සසහස්සායුකා පුත්තා භවිස්සන්ති.
>
<
20.
අථ ඛෝ තේසං භික්ඛවේ සත්තානං ඒවං භවිස්සති, “මයං ඛෝ කුසලානං ධම්මානං සමාදානහේතු ආයුනා පි වඩ්ඪාම, වණ්ණේන පි වඩ්ඪාම. යන්නූන මයං භිය්‍යෝසෝමත්තාය කුසලං කරෙය්‍යාමාති. කිං කුසලං කරෙය්‍යාම? යන්නූන මයං තයෝ ධම්මේ පජහෙය්‍යාම, අධම්මරාගං විසමලෝභං මිච්ඡාධම්මං, ඉදං කුසලං ධම්මං සමාදාය වත්තෙය්‍යාමා’ති. තේ පාණාතිපාතා විරමිස්සන්ති, අදින්නාදානා විරමිස්සන්ති, කාමේසුමිච්ඡාචාරා විරමිස්සන්ති, මුසාවාදා විරමිස්සන්ති, පිසුණාය වාචාය විරමිස්සන්ති, ඵරුසාය වාචාය විරමිස්සන්ති, සම්ඵප්පලාපා විරමිස්සන්ති, අභිජ්ඣං පජහිස්සන්ති, ව්‍යාපාදං පජහිස්සන්ති, මිච්ඡාදිට්ඨිං පජහිස්සන්ති, තයෝ ධම්මේ පජහිස්සන්ති: අධම්මරාගං විසමලෝභං මිච්ඡාධම්මං. ඉදං කුසලං ධම්මං සමාදාය වත්තිස්සන්ති. තේ කුසලානං ධම්මානං සමාදානහේතු අයුනා පි වඩ්ඪිස්සන්ති, වණ්ණේන පි වඩ්ඪිස්සන්ති. තේසං අයුනා පි වඩ්ඪමානානං වණ්ණේන පි වඩ්ඪමානානං වීසතිවස්සසහස්සායුකානං මනුස්සානං චත්තාරීසවස්සසහස්සායුකා පුත්තා භවිස්සන්ති.
>
<
21.
අථ ඛෝ තේසං භික්ඛවේ සත්තානං ඒවං භවිස්සති, “මයං ඛෝ කුසලානං ධම්මානං සමාදානහේතු ආයුනා පි වඩ්ඪාම, වණ්ණේන පි වඩ්ඪාම. යන්නූන මයං භිය්‍යෝසෝමත්තාය කුසලං කරෙය්‍යාමාති. කිං කුසලං කරෙය්‍යාම? යන්නූන මයං මත්තෙය්‍යා අස්සාම පෙත්තෙය්‍යා අස්සාම සාමඤ්ඤා බ්‍රහ්මඤ්ඤා කුලේජෙට්ඨාපචායිනෝ, ඉදං කුසලං ධම්මං සමාදාය වත්තෙය්‍යාමා’ති. තේ පාණාතිපාතා විරමිස්සන්ති, අදින්නාදානා විරමිස්සන්ති, කාමේසුමිච්ඡාචාරා විරමිස්සන්ති, මුසාවාදා විරමිස්සන්ති, පිසුණාය වාචාය විරමිස්සන්ති, ඵරුසාය වාචාය විරමිස්සන්ති, සම්ඵප්පලාපා විරමිස්සන්ති, අභිජ්ඣං පජහිස්සන්ති, ව්‍යාපාදං පජහිස්සන්ති, මිච්ඡාදිට්ඨිං පජහිස්සන්ති, තයෝ ධම්මේ පජහිස්සන්ති අධම්මරාගං විසමලෝභං මිච්ඡාධම්මං, මත්තෙය්‍යා භවිස්සන්ති පෙත්තෙය්‍යා සාමඤ්ඤා බ්‍රහ්මඤ්ඤා කුලේජෙට්ඨාපචායිනො. ඉදං කුසලං ධම්මං සමාදාය වත්තිස්සන්ති. තේ කුසලානං ධම්මානං සමාදානහේතු අයුනා පි වඩ්ඪිස්සන්ති, වණ්ණේන පි වඩ්ඪිස්සන්ති. තේසං අයුනා පි වඩ්ඪමානානං වණ්ණේන පි වඩ්ඪමානානං චත්තාරීසංවස්සසහස්සායුකානං මනුස්සානං අසීතිවස්සසහස්සායුකා පුත්තා භවිස්සන්ති. අසීතිවස්සසහස්සායුකේසු භික්ඛවේ මනුස්සේසු පංචවස්සසතිකා කුමාරිකා අලම්පතෙය්‍යා භවිස්සන්ති. අසීතිවස්සසහස්සායුකේසු භික්ඛවේ මනුස්සේසු තයෝ ආබාධා භවිස්සන්ති ඉච්ඡා අනසනං ජරා.

[ සංඛරාජූපපත්ති ]
>
<
22.
අසීතිවස්සසහස්සායුකේසු භික්ඛවේ මනුස්සේසු අයං ජම්බුදීපෝ ඉද්ධෝ චේව භවිස්සති ඵීතෝ ච, කුක්කුටසම්පාතිකා ගාමනිගමජනපද රාජධානියෝ. අසීතිවස්සසහස්සායුකේසු භික්ඛවේ මනුස්සේසු අයං ජම්බුදීපෝ අවීචි මඤ්ඤේ ඵුටෝ භවිස්සති මනුස්සේහි, සෙය්‍යථාපි නළවනං වා සරවනං වා.

අසීතිවස්සසහස්සායුකේසු භික්ඛවේ මනුස්සේසු අයං බාරාණසී කේතුමතී නාම රාජධානී භවිස්සති ඉද්ධා චේව ඵීතා ච බහුජනා ච ආකිණ්ණමනුස්සා ච සුභික්ඛා ච. අසීතිවස්සසහස්සායුකේසු භික්ඛවේ මනුස්සේසු ඉමස්මිං ජම්බුදීපේ චතුරාසීතිනගරසහස්සානි භවිස්සන්ති කේතුමතීරාජධානීපමුඛානි. අසීතිවස්සසහස්සායුකේසු භික්ඛවේ මනුස්සේසු කේතුමතියා රාජධානියා සංඛෝ නාම රාජා උප්පජ්ජිස්සති චක්කවත්තී ධම්මිකෝ ධම්මරාජා චාතුරන්තෝ විජිතාවී ජනපදත්ථාවරියප්පත්තෝ සත්තරතනසමන්නාගතෝ. තස්සිමානි සත්ත රතනානි භවිස්සන්ති, සෙය්‍යථීදං, චක්කරතනං හත්ථිරතනං අස්සරතනං මණිරතනං ඉත්ථිරතනං ගහපතිරතනං පරිණායකරතනමේව සත්තමං. පරෝසහස්සං ඛෝ පනස්ස පුත්තා භවිස්සන්ති සූරා වීරංගරූපා පරසේනප්පමද්දනා. සෝ ඉමං පථවිං සාගරපරියන්තං අදණ්ඩේන අසත්ථේන ධම්මේන අභිවිජිය අජ්ඣාවසිස්සති.

[ මෙත්තෙය්‍යබුද්ධුප්පාදෝ ]
>
<
23.
අසීතිවස්සසහස්සායුකේසු භික්ඛවේ මනුස්සේසු මෙත්තෙය්‍යෝ නාම භගවා ලෝකේ උප්පජ්ජිස්සති අරහං සම්මාසම්බුද්ධෝ විජ්ජාචරණසම්පන්නෝ සුගතෝ ලෝකවිදූ අනුත්තරෝ පුරිසදම්මසාරථි සත්ථා දේවමනුස්සානං බුද්ධෝ භගවා. සෙය්‍යථාපහං ඒතරහි ලෝකේ උප්පන්නෝ අරහං සම්මාසම්බුද්ධෝ විජ්ජාචරණසම්පන්නෝ සුගතෝ ලෝකවිදූ අනුත්තරෝ පුරිසදම්මසාරථි සත්ථා දේවමනුස්සානං බුද්ධෝ භගවා. සෝ ඉමං ලෝකං සදේවකං සමාරකං සබ්‍රහ්මකං සස්සමණබ්‍රාහ්මණිං පජං සදේවමනුස්සං සයං අභිඤ්ඤා සච්ඡිකත්වා පවේදෙස්සති, සෙය්‍යථාපහං ඒතරහි ඉමං ලෝකං සදේවකං සමාරකං සබ්‍රහ්මකං සස්සමණබ්‍රාහ්මණිං පජං සදේවමනුස්සං සයං අභිඤ්ඤා සච්ඡිකත්වා පවේදේමි. සෝ ධම්මං දේසෙස්සති ආදිකල්‍යාණං මජ්ඣේකල්‍යාණං පරියෝසානකල්‍යාණං සාත්ථං සබ්‍යඤ්ජනං කේවලපරිපුණ්ණං පරිසුද්ධං බ්‍රහ්මචරියං පකාසෙස්සති. සෙය්‍යථාපහං ඒතරහි ධම්මං දේසේමි ආදිකල්‍යාණං මජ්ඣේකල්‍යාණං පරියෝසානකල්‍යාණං සාත්ථං සබ්‍යඤ්ජනං කේවලපරිපුණ්ණං පරිසුද්ධං බ්‍රහ්මචරියං පකාසේමි. සෝ අනේකසතසහස්සං භික්ඛුසංඝං පරිහරිස්සති සෙය්‍යථාපහං ඒතරහි අනේකසතං භික්ඛුසංඝං පරිහරාමි.
>
<
24.
අථ ඛෝ භික්ඛවේ සංඛෝ නාම රාජා යෝ සෝ යූපෝ රඤ්ඤා මහාපනාදේන කාරාපිතෝ, තං යූපං උස්සාපෙත්වා අජ්ඣාවසිත්වා තං දත්වා විස්සජ්ජෙත්වා සමණබ්‍රාහ්මණකපණද්ධිකවණිබ්බකයාචකානං දානං දත්වා මෙත්තෙය්‍යස්ස භගවතෝ අරහතෝ සම්මාසම්බුද්ධස්ස සන්තිකේ කේසමස්සුං ඕහාරෙත්වා කාසායානි වත්ථානි අච්ඡාදෙත්වා අගාරස්මා අනගාරියං පබ්බජිස්සති. සෝ ඒවං පබ්බජිතෝ සමානෝ ඒකෝ වූපකට්ඨේ අප්පමත්තෝ ආතාපී පහිතත්තෝ විහරන්තෝ නචිරස්සේව යස්සත්ථාය කුලපුත්තා සම්මදේව අගාරස්මා අනගාරියං පබ්බජන්ති, තදනුත්තරං බ්‍රහ්මචරියපරියෝසානං දිට්ඨේව ධම්මේ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරිස්සති.

>
<

25.
අත්තදීපා භික්ඛවේ විහරථ අත්තසරණා අනඤ්ඤසරණා ධම්මදීපා ධම්මසරණා අනඤ්ඤසරණා. කථඤ්ච භික්ඛවේ භික්ඛු අත්තදීපෝ විහරති අත්තසරණෝ අනඤ්ඤසරණෝ, ධම්මදීපෝ ධම්මසරණෝ අනඤ්ඤසරණෝ?

ඉධ භික්ඛවේ භික්ඛු කායේ කායානුපස්සී විහරති ආතාපී සම්පජානෝ සතිමා විනෙය්‍ය ලෝකේ අභිජ්ඣාදෝමනස්සං. වේදනාසු ….(පෙ)…. චිත්තේ ….(පෙ)…. ධම්මේසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානෝ සතිමා විනෙය්‍ය ලෝකේ අභිජ්ඣාදෝමනස්සං. ඒවං ඛෝ භික්ඛවේ භික්ඛු අත්තදීපෝ විහරති අත්තසරණෝ අනඤ්ඤසරණෝ, ධම්මදීපෝ ධම්මසරණෝ අනඤ්ඤසරණෝ.

[ භික්ඛුනෝ ආයුවණ්ණාදිවඩ්ඪනකථා ]
>
<
26.
ගෝචරේ භික්ඛවේ චරථ සකේ පෙත්තිකේ විසයේ. ගෝචරේ භික්ඛවේ චරන්තා සකේ පෙත්තිකේ විසයේ ආයුනා පි වඩ්ඪිස්සථ, වණ්ණේන පි වඩ්ඪිස්සථ, සුඛේන පි වඩ්ඪිස්සථ, භෝගේන පි වඩ්ඪිස්සථ, බලේන පි වඩ්ඪිස්සථ. කිඤ්ච භික්ඛවේ භික්ඛුනෝ ආයුස්මිං? ඉධ භික්ඛවේ භික්ඛු ඡන්දසමාධිපධානසංඛාරසමන්නාගතං ඉද්ධිපාදං භාවේති, විරියසමාධි ….(පෙ)…. චිත්තසමාධි ….(පෙ)…. වීමංසාසමාධිපධානසංඛාරසමන්නාගතං ඉද්ධිපාදං භාවේති. සෝ ඉමේසං චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා ආකංඛමානෝ කප්පං වා තිට්ඨෙය්‍ය කප්පාවසේසං වා. ඉදං ඛෝ භික්ඛවේ භික්ඛුනෝ ආයුස්මිං.

කිඤ්ච භික්ඛවේ භික්ඛුනෝ වණ්ණස්මිං? ඉධ භික්ඛවේ භික්ඛු සීලවා හෝති පාතිමොක්ඛසංවරසංවුතෝ විහරති ආචාරගෝචරසම්පන්නෝ අණුමත්තේසු වජ්ජේසු භයදස්සාවී, සමාදාය සික්ඛති සික්ඛාපදේසු. ඉදං ඛෝ භික්ඛවේ භික්ඛුනෝ වණ්ණස්මිං.

කිඤ්ච භික්ඛවේ භික්ඛුනෝ සුඛස්මිං? ඉධ භික්ඛවේ භික්ඛු විවිච්චේව කාමේහි විවිච්ච අකුසලේහි ධම්මේහි සවිතක්කං සවිචාරං විවේකජං පීතිසුඛං පඨමං ඣානං උපසම්පජ්ජ විහරති, විතක්කවිචාරානං වූපසමා ….(පෙ)…. දුතියං ඣානං ….(පෙ)…. තතියං ඣානං ….(පෙ)…. චතුත්ථං ඣානං උපසම්පජ්ජ විහරති. ඉදං ඛෝ පන භික්ඛවේ භික්ඛුනෝ සුඛස්මිං.

කිඤ්ච භික්ඛවේ භික්ඛුනෝ භෝගස්මිං? ඉධ භික්ඛවේ භික්ඛු මෙත්තාසහගතේන චේතසා ඒකං දිසං ඵරිත්වා විහරති, තථා දුතියං, තථා තතියං, තථා චතුත්ථං, ඉති උද්ධමධෝ තිරියං සබ්බධි සබ්බත්තතාය සබ්බාවන්තං ලෝකං මෙත්තාසහගතේන චේතසා විපුලේන මහග්ගතේන අප්පමාණේන අවේරේන අබ්‍යාපජ්ජේන ඵරිත්වා විහරති. ඉධ භික්ඛවේ භික්ඛු කරුණාසහගතේන චේතසා ….(පෙ)…. මුදිතාසහගතේන චේතසා ….(පෙ)…. උපෙක්ඛාසහගතේන චේතසා ඒකං දිසං ඵරිත්වා විහරති, තථා දුතියං, තථා තතියං, තථා චතුත්ථං. ඉති උද්ධමධෝ තිරියං සබ්බධි සබ්බත්තතාය සබ්බාවන්තං ලෝකං උපෙක්ඛාසහගතේන චේතසා විපුලේන මහග්ගතේන අප්පමාණේන අවේරේන අබ්‍යාපජ්ජේන ඵරිත්වා විහරති. ඉදං ඛෝ භික්ඛවේ භික්ඛුනෝ භෝගස්මිං.

කිඤ්ච භික්ඛවේ භික්ඛුනෝ බලස්මිං? ඉධ භික්ඛවේ භික්ඛු ආසවානං ඛයා අනාසවං චේතෝවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨේව ධම්මේ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරති. ඉදං ඛෝ භික්ඛවේ භික්ඛුනෝ බලස්මිං.

නාහං භික්ඛවේ අඤ්ඤං ඒකබලම්පි සමනුපස්සාමි යං ඒවං දුප්පසහං යථයිදං භික්ඛවේ මාරබලං. කුසලානං භික්ඛවේ ධම්මානං සමාදානහේතු ඒවමිදං පුඤ්ඤං පවඩ්ඪතීති.

ඉදමවෝච භගවා, අත්තමනා තේ භික්ඛූ භගවතෝ භාසිතං අභිනන්දුන්ති.
>
<
චක්කවත්තිසීහනාදසුත්තං නිට්ඨිතං තතියං.!
>
`;
export default ChakkawaththiPali;