const GirimanandaPali = `
<
1.

ඒවං මේ සුතං, ඒකං සමයං භගවා සාවත්ථියං විහරති ජේතවනේ අනාථපිණ්ඩිකස්ස ආරාමේ, තේන ඛෝ පන සමයේන ආයස්මා ගිරිමානන්දෝ ආබාධිකෝ හෝති දුක්ඛිතෝ බාළ්හගිලානෝ.
>

<

2.

අථ ඛෝ ආයස්මා ආනන්දෝ යේන භගවා තේනුපසංකමි. උපසංකමිත්වා භගවන්තං අභිවාදෙත්වා ඒකමන්තං නිසිදි. ඒකමන්තං නිසින්නෝ ඛෝ ආයස්මා ආනන්තෝ භගවන්තං ඒතදවෝච.
>

<

3.

ආයස්මා භන්තේ ගිරිමානන්දෝ ආබාධිකෝ දුක්ඛිතෝ බාළ්හගිලානෝ. සාධු භන්තේ භගවා යේනායස්මා ගිරිමානන්දෝ තේනුපසංකමතු අනුකම්පං උපදායාති.
>

<

4.

සචේ ඛෝ ත්වං ආනන්ද ගිරිමානන්දස්ස භික්ඛුනෝ උපසංකමිත්වා දස සඤ්ඤා භාසෙය්‍යාසි. ඨානං ඛෝ පනේතං විජ්ජති යං ගිරිමානන්දස්ස භික්ඛුනෝ දසසඤ්ඤාසුත්වා සෝ ආබාධෝ ඨානසෝ පටිප්පස්සම්භෙය්‍ය. කතමා දස?
>

<

5.

අනිච්චසඤ්ඤා, අනත්තසඤ්ඤා, අසුභසඤ්ඤා, ආදී නවසඤ්ඤා, පහානසඤ්ඤා, විරාග සඤ්ඤා, නිරෝධසඤ්ඤා, සබ්බලෝකේ අනභිරතසඤ්ඤා, සබ්බ සංඛාරේසු අනිච්චසඤ්ඤා, ආනාපානසති.
>

<

6.

කතමාචා’නන්ද අනිච්චසඤ්ඤා?
>

<

ඉධා’නන්ද භික්ඛු අරඤ්ඤගතෝ වා රුක්ඛමූල ගතෝ වා සුඤ්ඤාගාරගතෝ වා ඉතිපටිසංවික්ඛති. රූපං අනිච්චං වේදනා අනිච්චා, සඤ්ඤා අනිච්චා, සංඛාරා අනිච්චා, විඤ්ඤාණං අනිච්චති. ඉති ඉමේසු පඤ්චසු පාදානක්ඛන්ධේසු අනිච්චානුපස්සි විහරති.

අයං චුච්චතා’නන්ද අනිච්චසඤ්ඤා.
>

<

7.

කතමා චා’නන්ද අනත්​ත සඤ්ඤා?

ඉධා’නන්ද භික්ඛු අරඤ්ඤගතෝ වා රුක්ඛමූල ගතෝ වා සුඤ්ඤාගාරගතෝ වා ඉතිපටිසංවික්ඛති. චක්ඛුං අනත්තා, රූපං අනත්තා,  සෝතං අනත්තා, සද්දා අනත්තා, ඝාණං අනත්තා, ගන්ධා අනත්තා, ජිව්හා අනත්තා, රසා අනත්තා, කායෝ අනත්තා, ඵොට්ඨබ්බා අනත්තා, මනෝ අනත්තා, ධම්මා අනත්තා’ති. ඉති ඉමේසු ඡසු අජ්ඣත්තික බාහිරේසු ආයතනේසු අනත්තානු පස්සී විහරති.  

අයං චුච්චතා’නන්ද අනත්ත සඤ්ඤා.
>
<
8.

කතමා චා’නන්ද අසුභසඤ්ඤා?

ඉධානන්ද භික්ඛූ ඉමමේව කායං උද්ධං පාදතලා අධෝකේසමත්ථකා තචපරියන්තං පූරං නානප්පකාරස්ස අසුචිනෝ පච්චවෙක්ඛති.

අත්ථි ඉමස්මිං කායේ කේසා, ලෝමා, නඛා, දන්තා, තචෝ, මංසං, නහාරු, අට්ඨි, අට්ඨිමිඤ්ජා, වක්කං, හදයං යකනං කිලෝමකං පිහකං පප්ඵාසං, අන්තං, අන්තගුණං, උදරියං, කරී සං, පිත්තං, සෙම්හං, පුබ්බෝ, ලෝහිතං, සේදෝ, මේදෝ, අස්සු වසා, ඛෙලෝ, සිංඝානිකා, ලසිකා, මුත්තන්ති.

ඉති ඉමස්මිං කායේ අසුභානුපස්සි විහරති. අයං වුච්චතානන්ද අසුභසඤ්ඤා.

>
<
9.

කතමා චා’නන්ද ආදීනවසඤ්ඤා?

ඉධානන්ද භික්ඛු අරඤ්ඤගතෝ වා රුක්ඛමූලගතෝ වා සුඤ්ඤාගාර ගතෝ වා ඉතිපටිසංවික්ඛති. බහු දුක්ඛෝඛෝ අයංකායෝ, බහු ආදීනවෝ, ඉති ඉමස්මිං කායේ විවිධා ආබාධා උප්පජ්ජන්ති. සෙය්‍යථීදං. චක්ඛුරෝගෝ, සෝතරෝගෝ, ඝාණරෝගෝ, ජිව්හාරෝගෝ, කායරෝගෝ, සීසරෝගෝ කණ්ණරෝගෝ, මුඛ රෝගෝ, දන්තරෝගෝ, කාසෝ, සාසෝ, පිනාසෝ, ඩහෝ, ජරෝ, කුච්ඡරෝගෝ, මුච්ඡා, පක්ඛන්දිකා, සුලා, විසූචිකා, කුට්ඨං, ගණ්ඩෝ, කිලාසෝ, සෝසෝ, අපමාරෝ, දද්දු, කණ්ඩු, කච්ඡු, රඛසා, විතච්ඡිකා, ලෝහිතපිත්තං, මධුමේහෝ, අංසා පිළකා, භගන්දළා.

පිත්තසමුට්ඨානා ආබාධා, සෙම්හ සමුට්ඨානා ආබාධා, වාතසමුට්ඨානා ආබාධා, සන්තිපාතිකා ආබාධා, උතුපරිනාමජා ආබාධා, ඕපක්කමිකා ආබාධා, කම්ම විපාකජා ආබාධා, සීතං උණ්හං ජිඝච්ඡා, පිපාසා, උච්චාරෝ, පස්සාවෝ’ති.

ඉති ඉමස්මිං කායේ ආදීනවානුපස්සි විහරති. අයං වුච්චතානන්ද ආදීනවසඤ්ඤා.
>
<
10.

කතමා චා’නන්ද පහානසඤ්ඤා?

ඉධානන්ද භික්ඛු උප්පන්නං කාම විතක්කං නාධිවාසේති පජහති විනෝදේති ඛ්‍යන්තීකරෝති අනභාවං ගමේති. උප්පන්නං ව්‍යාපාද විතක්කං නාධිවාසේති පජහති විනෝදේති ඛ්‍යන්තීකරෝති අනභාවං ගමේති. උප්පන්නං විහිංසා විතක්කං නාධිවාසේති පජහති විනෝදේති ඛ්‍යන්තීකරෝති අනභාවං ගමේති. උප්පන්නුප්පන්නේ පාපකේ අකුසලේ ධම්මේ නාධිවාසේති පජහති විනෝදේති ඛ්‍යන්තීකරෝති අනභාවං ගමේති.

අයං වුච්චතා’නන්ද පහාන සඤ්ඤා.

<
>
11.

කතමා චා’නන්ද විරාගසඤ්ඤා?

ඉධානන්ද භික්ඛු අරඤ්ඤගතෝ වා රුක්ඛමුලගතෝ වා සුඤ්ඤා ගාරගතෝ වා ඉති පටිසංවික්ඛති. ඒතං සන්තං ඒතං පණීතං යදිදං සබ්බ සංඛාරසමථෝ සබ්බූපධිපටිනිස්සග්ගෝ තණ්හක්ඛයෝ විරාගෝ නිබ්බාණන්ති.

අයං වුච්චතා’නන්ද විරාගසඤ්ඤා.

12.

කතමා චා’නන්ද නිරෝධසඤ්ඤා?
>

<

ඉධානන්ද භික්ඛු අරඤ්ඤගතෝ වා රුක්ඛමුලගතෝ වා සුඤ්ඤා ගාරගතෝ වා ඉති පටිසංවික්ඛති. ඒතං සන්තං ඒතං පණීතං යදිදං සබ්බ සංඛාරසමථෝ සබ්බූපධිපටිනිස්සග්ගෝ තණ්හක්ඛයෝ නිරෝධෝ නිබ්බාණන්ති.

අයං වුච්චතා’නන්ද නිරෝධසඤ්ඤා.
>
<
13.

කතමා චා’නන්ද සබ්බලෝකේ අනභිරථසඤ්ඤා?

ඉධානන්ද භික්ඛු යේ ලෝකේ උපායුපාදානා චේතසෝ අධිට්ඨානාභිනිවේසානුසයා තේ පජහන්තෝ විරමති න උපාදියන්තෝ.

අයං වුච්චතා’නන්ද සබ්බලෝකේ අනභිරථසඤ්ඤා.

14.

කතමා චා’නන්ද සබ්බසංඛාරේසු අනිච්චසඤ්ඤා?

ඉධානන්ද භික්ඛු සබ්බසංඛාරේහි අට්ටීයති හරායති ජිගුච්ඡති. අයං වුච්චතා’නන්ද සබ්බසංඛාරේසු අනිච්චසඤ්ඤා.
>

<
15.

කතමා චා’නන්ද ආනාපානසති?

ඉධානන්ද භික්ඛු අරඤ්ඤ්ගතෝ වා රුක්ඛමූල ගතෝ වා සුඤ්ඤාගාරගතෝ වා නිසීදති පල්ලංකං ආභුජිත්වා උජුං කායං පණිධාය පරිමුඛං සතිං උපට්ඨපත්වා.

සෝ සතෝව අස්සසති, සතෝ පස්සසති,
දීඝං වා අස්සසන්තෝ දීඝං අස්සසාමී’ති පජානති. දීඝං වා පස්සසන්තෝ දිඝං පස්සසාමී’ති පජානාති.
රස්සං වා අස්සසන්තෝ රස්සං පස්සසාමී’ති පජානාති, රස්සං වා පස්සසන්තෝ රස්සං පස්සසාමී’ති පජානාති. 
සබ්බකායපටිසංවේදි අස්සසිස්සාමී’ති සික්ඛති, සබ්බකාය පටිසංවේදි පස්සසිස්සාමිති සික්ඛති.
පස්සම්භයං කායසංඛාරං අස්සසිස්සාමී’ති සික්ඛති. පස්සම්භයං කායසංඛාරං පස්සසිස්සාමී’ති සික්ඛති.

පීතිපටිසංවේදි අස්සසිස්සාමී’ති සික්ඛති, පීතිපටිසංවේදී පස්සසිස්සාමී’ති සික්ඛති.
සුඛපටිසංවේදී අස්සසිස්සාමීති සික්ඛති. සුඛපටිසංවේදී පස්සසිස්සාමී’ති සික්ඛති.
චිත්ත සංඛාර පටිසංවේදි අස්සසිස්සාමී’ති සික්ඛති. චිත්ත සංඛාර පටිසංවේදී පස්සසිස්සාමී’ති සික්ඛති.
පස්සම්භයං චිත්තසංඛාරං අස්සසිස්සාමීති සික්ඛති. පස්සම්භයං චිත්ත සංඛාරං පස්සසිස්සාමීති සික්ඛති. චිත්තපටිසංවේදි අස්සසිස්සාමීති සික්ඛති. චිත්තපටිසංවේදි පස්සසිස්සාමි’ති සික්ඛති.
අභිප්පමෝදයං චිත්තං අස්සසිස්සාමී’ති සික්ඛති. අභිප්පමෝදයං චිත්තං පස්සසිස්සාමී’ති සික්ඛති.
සමාදහං චිත්තං අස්සසිස්සාමී’ති සික්ඛති. සමාදහං චිත්තං පස්සසිස්සාමී’ති සික්ඛති.
විමෝචයං චිත්තං අස්සසිස්සාමී’ති සික්ඛති. විමෝචයං චිත්තං පස්සසිස්සාමී’ති සික්ඛති.
අනිච්චානුපස්සී අස්සසිස්සාමී’ති සික්ඛති. අනිච්චානුපස්සී පස්සසිස්සාමී’ති සික්ඛති.
විරාගානුපස්සි අස්සසිස්සාමී’ති සික්ඛති. විරාගානුපස්සී පස්සසිස්සාමී’ති සික්ඛති.
නිරෝධානුපස්සී අස්සසිස්සාමී’ති සික්ඛති. නිරෝධානුපස්සී පස්සසිස්සාමී’ති සික්ඛති.
පටිනිස්සග්ගානුපස්සී අස්සසිස්සාමී’ති සික්ඛති. පටිනිස්සග්ගානුපස්සී පස්සසිස්සාමී’ති සික්ඛති.

අයං වුච්චතා’නන්ද ආනාපානසති.
>
<
16.

සචේ ඛෝ ත්වං ආනන්ද ගිරිමානන්දස්ස භික්ඛුනෝ උපසංකමිත්වා ඉමා දසසඤ්ඤා භාසෙය්‍යාසි. ඨානං ඛෝ පනේතං විජ්ජති. යං ගිරිමානන්දස්ස භික්ඛුනෝ ඉමා දස සඤ්ඤා සුත්වා සෝ ආබාධෝ ඨානසෝ පටිප්පස්සම්භෙය්‍යාති.
>

<
17.

අථ ඛෝ ආයස්මා ආනන්දෝ භගවතෝ සන්තිකේ ඉමා දස සඤ්ඤා උග්ගහෙත්වා යේනායස්මා ගිරිමානන්දෝ තේනුපසංකමි. උපසංකමිත්වා ආයස්මතෝ ගිරිමානන්දස්ස ඉමා දස සඤ්ඤා ආභාසි.
>
<
18.

අථ ඛෝ ආයස්මතෝ ගිරිමානන්දස්ස ඉමා දස සඤ්ඤා සුත්වා සෝ ආබාධෝ ඨානසෝ පටිප්පස්සම්භි. වුට්ඨාහි චායස්මා ගිරිමානන්දෝ තම්හා ආබාධා තථා පහීනෝ ච පනායස්මතෝ ගිරිමානන්දස්ස සෝ ආබාධෝ අහෝසී’ති.
>
`;
export default GirimanandaPali;