const ParabawaPali = `

<ඒවං මේ සුතං. ඒකං සමයං භගවා සාවත්ථියං විහරති ජේතවනේ අනාථපිණ්ඩිකස්ස ආරාමේ, අථ ඛෝ අඤ්ඤතරා දේවතා අභික්කන්තාය රත්තියා අභික්කන්ත වණ්ණා කේවලකප්පං ජේතවනං ඕභාසෙත්වා යේන භගවා තේනුපසංකමි, උපසංකමිත්වා, භගවන්තං අභිවාදෙත්වා ඒකමන්තං අට්ඨාසී. ඒකමන්තං ඨීතා ඛෝ සා දේවතා භගවන්තං ගාථාය අජ්ඣභාසි.
>

1.

පරාභවන්තං පුරිසං – මයං පුච්ජාම ගෝතමං
භගවන්තං පුට්ඨුමාගම්ම – කිං පරාභවතෝ මුඛං

>
<
2.

සුවිජානෝ භවං හෝති – සුවිජානෝ පරාභවෝ
ධම්මකාමෝ භවං හෝති – ධම්මදෙස්සී පරාභවෝ

>
<
3.

ඉති හේතං විජානාම – පඨමෝ සෝ පරාභවෝ
දුතියං භගවා බ්‍රෑහි – කිං පරාභවතෝ මුඛං

>
<
4.

අසන්තස්ස පියා හොන්ති – සන්තේ න කුරුතේ පියං
අසතං ධම්මං රෝචේති – තං පරාභවතෝ මුඛං

>
<
5.

ඉති හේතං විජානාම – දුතියෝ සෝ පරාභවෝ
තතියං භගවා බ්‍රෑහි – කිං පරාභවතෝ මුඛං
>
<
6.

නිද්දාසීලී සභාසීලී – අනුට්ඨාතා ච යෝ නරෝ
අලසෝ කෝධපඤ්ඤාණෝ – තං පරාභවතෝ මුඛං

>
<
7.

ඉති හේතං විජානාම – තතියෝ සෝ පරාභවෝ
චතුත්ථං භගවා බ්‍රෑහි – කිං පරාභවතෝ මුඛං

>
<
8.

යෝ මාතරං වා පිතරං වා – ජිණ්ණකං ගතයොබ්බනං
පහුසන්තෝ න භරති – තං පරාභවතෝ මුඛං

>

<
9.

ඉති හේතං විජානාම – චතුත්ථෝ සෝ පරාභවෝ
පඤ්චමං භගවා බ්‍රෑහි – කිං පරාභවතෝ මුඛං

>
<
10.

යෝ බ්‍රාහ්මණං වා සමණං වා – අඤ්ඤං වාපි වණිබ්බකං
මුසාවාදේන වඤ්චේති – තං පරාභවතෝ මුඛං
>
<
11.

ඉති හේතං විජානාම – පංචමො සෝ පරාභවෝ
ජට්ඨමං භගවා බ්‍රෑහි – කිං පරාභවතෝ මුඛං

>
<
12.

පහුතවිත්තෝ පුරිසෝ – සහිරඤ්ඤෝ සභෝජනෝ
ඒකෝ භුඤ්ජති සාදුනි – තං පරාභවතෝ මුඛං

>
<
13.

ඉති හේතං විජානාම – ජට්ඨමෝ සෝ පරාභවෝ
සත්තමං භගවා බ්‍රෑහි – කිං පරාභවතෝ මුඛං
>
<
14.

ජාතිත්ථද්ධෝ ධනත්ථද්ධෝ – ගොත්තත්ථද්ධෝ ච යෝ නරෝ
සඤ්ඤාතිං අතිමඤ්ඤෙති – තං පරාභවතෝ මුඛං

>
<
15.

ඉති හේතං විජානාම – සත්තමෝ සෝ පරාභවෝ
අට්ඨමං භගවා බ්‍රෑහි – කිං පරාභවතෝ මුඛං

>
<
16.

ඉත්ථිධුත්තෝ සුරාධුත්තෝ – අක්ඛධුත්තෝ ච යෝ නරෝ
ලද්ධං ලද්ධං විනාසේති – තං පරාභවතෝ මුඛං

>
<
17.

ඉති හේතං විජානාම – අට්ඨමෝ සෝ පරාභවෝ
නවමං භගවා බ්‍රෑහි – කිං පරාභවතෝ මුඛං

>
<
18.

සේහි දාරෙහි සන්තුට්ඨෝ – වේසියාසු පදිස්සති
දිස්සති පරදාරේසූ – තං පරාභවතෝ මුඛං

>
<
19.

ඉති හේතං විජානාම – නවමෝ සෝ පරාභවෝ
දසමං භගවා බ්‍රෑහි – කිං පරාභවතෝ මුඛං

>
<
20.

අතීතයොබ්බනෝ පෝසෝ – ආනේති තිම්බරුත්ථනිං
තස්සා ඉස්සා න සුපති – තං පරාභවතෝ මුඛං

>
<
21.

ඉති හේතං විජානාම – දසමෝ සෝ පරාභවෝ
ඒකාදසමං භගවා බ්‍රෑහි – කිං පරාභවතෝ මුඛං

>
<
22.

ඉත්ථි සොණ්ඩිං විකිරණිං – පුරිසං වාපි තාදිසං
ඉස්සරියස්මිං ඨාපාපේති – තං පරාභවතෝ මුඛං

>
<
23.

ඉති හේතං විජානාම – ඒකාදසමෝ සෝ පරාභවෝ
ද්වාදසමං භගවා බ්‍රෑහි – කිං පරාභවතෝ මුඛං

>
<
24.

අප්පභෝගෝ මහාතණ්හෝ – ඛත්තියේ ජායතේ කුලේ
සෝ ච රජ්ජං පත්ථයති – තං පරාභවතෝ මුඛං

>
<
25.

ඒතේ පරාභවේ ලෝකේ – පණ්ඩිතෝ සමවෙක්ඛිය
අරියෝ දස්සනසම්පන්නෝ – ස ලෝකං භජතේ සිවන්ති.
>

`;
export default ParabawaPali;

