const WasalaPali = `
<
ඒවං මේ සුතං.

ඒකං සමයං භගවා සාවත්ථියං විහරති ජේතවනේ අනාථපිණ්ඩිකස්ස ආරාමේ. අථ ඛෝ භගවා පුබ්බන්හ සමයං නිවාසෙත්වා පත්තචීවරමාදාය සාවත්ථියං පිණ්ඩාය පාවිසි. තේන ඛෝ සමයේන අග්ගික භාරද්වාජස්ස බ්‍රාහ්මණස්ස නිවේසනේ අග්ගි පජ්ජලිතෝ හෝති ආහුති පග්ගහිතා. අථ ඛෝ භගවා සාවත්ථියං සපදානං පිණ්ඩාය චරමානෝ යේන අග්ගිකභාරද්වාජස්ස බ්‍රාහ්මණස්ස නිවේසනං තේනුපසංකමි. අද්දසා ඛෝ අග්ගිකභාරද්වාජෝ බ්‍රාහ්මණෝ භගවන්තං දූරතෝ’ව ආගච්ඡන්තං දිස්වාන භගවන්තං ඒතද’වෝච.

තත්‍රේ’ව මුණ්ඩක (තිට්ඨාහි)
තත්‍රේ’ව සමණක (තිට්ඨාහි)
තත්‍රේ’ව වසලක තිට්ඨාහී’ති.
>
<
ඒවං වුත්තේ භගවා අග්ගිකභාරද්වාජං බ්‍රාහ්මණං ඒතද’වෝච.
ජානාසි පන ත්වං බ්‍රාහ්මණ, වසලං වා වසලකරණේ වා ධම්මේ’තී?
>
<
නඛ්වා’හං භෝ ගෝතම, ජානාමි වසලං වා වසලකරණේ වා ධම්මේ. සාධු මේ භවං ගෝතමෝ තථා ධම්මං දේසේතු, යථා’හං ජානෙය්‍යං වසලං වා වසලකරණේ වා ධම්මේ’ති.
තේන හි බ්‍රාහ්මණ සුණාහි. සාධුකං මනසිකරෝහි. භාසිස්සාමී’ති.

ඒවං භෝ’ති ඛෝ අග්ගිකභාරද්වාජෝ බ්‍රාහ්මණෝ භගවතෝ පච්චස්සෝසි.
භගවා ඒතද’වෝච.
>
<
1.
කෝධනෝ උපනාහී ච
පාපමක්ඛී ච යෝ නරෝ
විපන්නදිට්ඨි මායාවී
තං ජඤ්ඤා වසලෝ ඉති
>
<
2.
ඒකජං වා ද්විජං වා’පි
යෝ’ධ පාණානි හිංසති
යස්ස පාණේ දයා නත්ථි
තං ජඤ්ඤා වසලෝ ඉති
>
<
3.
යෝ හන්ති පරිරුන්ධති
ගාමානි නිගමානි ච
නිග්ගාහකෝ සමඤ්ඤාතෝ
තං ජඤ්ඤා වසලෝ ඉති
>
<
4.
ගාමේ වා යදිවා’රඤ්ඤේ
යං පරේසං මමායිතං
ථෙය්‍යා අදින්නං ආදියති
තං ජඤ්ඤා වසලෝ ඉති
>
<
5.
යෝ හවේ ඉණමාදාය
චුජ්ජමානෝ පලායති
න හි තේ ඉණමත්ථී’ති
තං ජඤ්ඤා වසලෝ ඉති
>
<
6.
යෝ වේ කිඤ්චික්ඛකම්‍යතා
පන්ථස්මිං වජතං ජනං
හන්ත්වා කිඤ්චික්ඛමාදේති
තං ජඤ්ඤා වසලෝ ඉති
>
<
7.
යෝ අත්තහේතු පරහේතු
ධනහේතූ ච යෝ නරෝ
සක්ඛිපුට්ඨෝ මුසා බ්‍රෑති
තං ජඤ්ඤා වසලෝ ඉති
>
<
8.
යෝ ඤාතීනං සඛානං වා
දාරේසු පතිදිස්සති
සහසා සම්පියේන වා
තං ජඤ්ඤා වසලෝ ඉති
>
<
9.
යෝ මාතරං වා පිතරං වා
ජිණ්ණකං ගතයොබ්බනං
පහූ සන්තෝ න භරති
තං ජඤ්ඤා වසලෝ ඉති
>
<
10.
යෝ මාතරං වා පිතරං වා
භාතරං භගිනිං සසුං
හන්ති රෝසේති වාචාය
තං ජඤ්ඤා වසලෝ ඉති
11.
යෝ අත්ථං පුච්ඡිතෝ සන්තෝ
අනත්ථමනුසාසති
පටිච්ඡන්නේන මන්තේති
තං ජඤ්ඤා වසලෝ ඉති
12.
යෝ කත්වා පාපකං කම්මං
මා මං ජඤ්ඤාති ඉච්ඡති
යෝ පටිච්ඡන්නකම්මන්තෝ
තං ජඤ්ඤා වසලෝ ඉති
13.
යෝ වේ පරකුලං ගන්ත්වා
භුත්වාන සුචිභෝජනං
ආගතං න පටිපූජේති
තං ජඤ්ඤා වසලෝ ඉති
>
<
<
14.
යෝ බ්‍රාහ්මණං වා සමණං වා
අඤ්ඤං වා’පි වණිබ්බකං
මුසාවාදේන වඤ්චේති
තං ජඤ්ඤා වසලෝ ඉති
>
<
15.
යෝ බ්‍රාහ්මණං වා සමණං වා
භත්තකාලේ උපට්ඨිතේ
රෝසේති වාචා න ච දේති
තං ජඤ්ඤා වසලෝ ඉති
>
<
16.
අසතං යෝ’ධ පබ්‍රෑති
මෝහේන පළිගුණ්ඨිතෝ
කිඤ්චික්ඛං නිජිගිංසානෝ
තං ජඤ්ඤා වසලෝ ඉති
17.
යෝ චත්තානං සමුක්කංසේ
පරං ච මවජානති
නිහීනෝ සේන මානේන
තං ජඤ්ඤා වසලෝ ඉති
>
<
18.
රෝසකෝ කදරියෝ ච
පාපිච්ඡෝ මච්ඡරී සඨෝ
අහිරිකෝ අනොත්තාපී
තං ජඤ්ඤා වසලෝ ඉති
>
<
19.
යෝ බුද්ධං පරිභාසති
අථ වා තස්ස සාවකං
පරිබ්බාජං ගහට්ඨං වා
තං ජඤ්ඤා වසලෝ ඉති
>
<
20.
යෝ වේ අනරහා සන්තෝ
අරහං පටිජානති
චෝරෝ සබ්‍රහ්මකේ ලෝකේ
ඒස ඛෝ වසලා’ධමෝ
ඒතේ ඛෝ වසලා වුත්තා
මයා වෝ යේ පකාසිතා
>
<
21.
න ජච්චා වසලෝ හෝති
න ජච්චා හෝති බ්‍රාහ්මණෝ
කම්මනා වසලෝ හෝති
කම්මනා හෝති බ්‍රාහ්මණෝ
>
<
22.
තදමිනා’පි විජානාථ
යථා මේදං නිදස්සනං
චණ්ඩාලපුත්තෝ සෝපාකෝ
මාතංගෝ ඉති විස්සුතෝ
>
<
23.
සෝ යසං පරමං පත්තෝ
මාතංගෝ’යං සුදුල්ලභං
ආගඤ්ඡුං තස්සුපට්ඨානං
ඛත්තියා බ්‍රාහ්මණා බහූ
>
<
24.
සෝ දේවයානමාරුය්හ
විරජං සෝ මහාපථං
කාමරාගං විරාජෙත්වා
බ්‍රහ්මලෝකූපගෝ අහූ
>
<
25.
න නං ජාති නිවාරේසි
බ්‍රහ්මලෝකූපපත්තියා
අජ්ඣායකකුලේ ජාතා
බ්‍රාහ්මණා මන්තබන්ධුනෝ
>
<
26.
තේ ච පාපේසු කම්මේසු
අභිණ්හමුපදිස්සරේ
දිට්ඨේ’ව ධම්මේ ගාරය්හා
සම්පරායේ ච දුග්ගතිං
න තේ ජාති නිවාරේති
දුග්ගච්චා ගරහාය වා
>
<
27.
න ජච්චා වසලෝ හෝති
න ජච්චා හෝති බ්‍රාහ්මණෝ
කම්මනා වසලෝ හෝති
කම්මනා හෝති බ්‍රාහ්මණෝ
>

<
ඒවං වුත්තේ අග්ගිකභාරද්වාජෝ බ්‍රාහ්මණෝ භගවන්තං ඒතදවෝච.
අභික්කන්තං භෝ ගෝතම, අභික්කන්තං භෝ ගෝතම,
සෙය්‍යථාපි භෝ ගෝතම, නික්කුජ්ජිතං වා උක්කුජ්ජෙය්‍ය, පටිච්ඡන්නං වා විවරෙය්‍ය, මූළ්හස්ස වා මග්ගං ආචික්ඛෙය්‍ය, අන්ධකාරේ වා තේලපජ්ජෝතං ධාරෙය්‍ය චක්ඛුමන්තෝ රූපානි දක්ඛින්තී’ති.
ඒවමේව භෝතා ගෝතමේන අනේකපරියායේන ධම්මෝ පකාසිතෝ. ඒසා’හං භවන්තං ගෝතමං සරණං ගච්ඡාමි. ධම්මඤ්ච භික්ඛුසංඝඤ්ච.

උපාසකං මං භවං ගෝතමෝ ධාරේතු අජ්ජතග්ගේ පාණුපේතං සරණං ගතන්ති.>

`;
export default WasalaPali;
