const Angulimala_Piritha_Sinhala = `
<මේ අංගුලිමාල පිරිත දේශනා කිරීමට දේශකයා ඉඳගත් ආසනය සේදු

ජලය පවා සියලු උවදුරු විනාශ කරයි. 

මේ පිරිත ප්‍රසූත නො කළ හැකිව පීඩා විඳිමින් සිටි මවකට සෙත් කරනු පිණිස

බුදුරජාණන් වහන්සේ විසින් අංගුලිමාල තෙරුන් වහන්සේට උගන්වන ලද්දකි

ඒ පිරිතේ ආනුභාවය තෙරුන් වහන්සේ පිරිත කී තැන ද පිහිටියේ ය. එහි ආනුභාවය එතැන මහපොළොව පවත්නා තුරුම පවතී. එය කල්පස්ථායි ප්‍රාතිහාර්යයක් බව කියා තිබේ.>
<සහෝදරිය, මම යම් අවස්ථාවක් ආර්ය ජාතියෙන් උපන්නෙම්ද,

එතැන් සිට දැනුවත්ව ප්‍රාණියෙකුගෙ දිවි තොරකල බවක් නොදනිමි.

ඒ සත්‍යය බලයෙන් තොපට යහපතක්ම වේවා, දරුගැබටද යහපතක්ම වේවා.

සහෝදරිය, මම යම් අවස්ථාවක් ආර්ය ජාතියෙන් උපන්නෙම්ද,

එතැන් සිට දැනුවත්ව ප්‍රාණියෙකුගෙ දිවි තොරකල බවක් නොදනිමි.

ඒ සත්‍යය බලයෙන් තොපට යහපතක්ම වේවා, දරුගැබටද යහපතක්ම වේවා.

සහෝදරිය, මම යම් අවස්ථාවක් ආර්ය ජාතියෙන් උපන්නෙම්ද,

එතැන් සිට දැනුවත්ව ප්‍රාණියෙකුගෙ දිවි තොරකල බවක් නොදනිමි.

ඒ සත්‍යය බලයෙන් තොපට යහපතක්ම වේවා, දරුගැබටද යහපතක්ම වේවා.
`;

export default Angulimala_Piritha_Sinhala;
