const Budhu_Guna_Piritha_Sinhala = `
(මෙය තමන් රෝගී වූ විට හෝ රෝගී වූ වෙනත් අයෙකුට ආශීර්වාද පිණිස කීමෙන් සෙත් සලසා ගත හැක)

<ඒ භාග්‍යවත් අරහත් සම්මා සම්බුදු රජාණන් වහන්සේට මාගේ නමස්කාරය වේවා!
ඒ භාග්‍යවත් අරහත් සම්මා සම්බුදු රජාණන් වහන්සේට මාගේ නමස්කාරය වේවා!
ඒ භාග්‍යවත් අරහත් සම්මා සම්බුදු රජාණන් වහන්සේට මාගේ නමස්කාරය වේවා!>

<ඒ මාගේ භාග්‍යවත් බුදු රජාණන් වහන්සේ

සියළු කෙලෙසුන් කෙරෙන් දුරු වූ හෙයින් අරහං නම් වන සේක.
සියළු කෙලෙස් සතුරන් නැති කළ හෙයින් අරහං නම් වන සේක.
සියළු දෙනාගේ ආමිස පූජා ප්‍රතිපත්ති පූජාවන් ලැබීමට සුදුසු වන හෙයින් අරහං නම් වන සේක.
රහසින්වත් පව් නොකළ හෙයින් අරහං නම් වන සේක.
ඒ මාගෙ භාග්‍යවත් බුදු රජාණන් වහන්සේ ඒකාන්තයෙන්ම අරහං නම් වන සේක. ඒ අරහං බුදුගුණයේ මහානුභාව බලයෙන් මා දිනෙන් දින නීරෝගී බවට පත් වේවා! නීරෝගී බවට පත් වේවා! නීරෝගී බවට පත් වේවා! ප්‍රතිහාර්යයක බලයක් සෙයින් මා නිදුක් වේවා! නීරෝගි වේවා! සුවපත් වේවා! කායික වේදනා දුරුවේවා! මානසික පීඩා දුරුවේවා! සැනසිල්ලම උදා වේවා! කාමච්ඡ්න්ද ආදී නීවරණයෝ මා කෙරෙන් බැහැර වේවා! මාගේ සිත සමාධි වේවා! මාගේ සිහි නුවණ දියුණු තියුණු වේවා! චතුරාර්ය සත්‍ය ධර්මය අවබෝධ වේවා!

අනන්ත බුදු රජාණන් වහන්සේලාගේ අනන්ත අරහං බුදුගුණයේ මහානුභාව බලය, ශක්තිය, පිහිට, ආරක්ෂාව, මට නිරතුරුව ලැබේවා! ලැබේවා! ලැබේවා!>

<ඒ මාගේ භාග්‍යවත් බුදු රජාණන් වහන්සේ

විශිෂ්ඨ ඥාණයෙන් දත යුතු තාක් සියළු ධර්මයන් තමන් වහන්සේ විසින්ම, පරෝපදේශ රහිතව අවබෝධ කළ හෙයින් සම්මා සම්බුද්ධ නම් වන සේක.
පිරිසිඳ දත යුතු ධර්මයන් (දුක්ඛ සත්‍යය) මනාව පිරිසිඳ දත හෙයින් සම්මා සම්බුද්ධ නම් වන සේක.
දුරු කල යුතු ධර්මයන් (සමුදය සත්‍යය) මනාව දුරු කළ හෙයින් සම්මා සම්බුද්ධ නම් වන සේක.
සාක්ෂාත් කළ යුතු ධර්මයන් (නිරෝධ සත්‍යය) මනාව සාක්ෂාත් කළ හෙයින් සම්මා සම්බුද්ධ නම් වන සේක.
වැඩිය යුතු ධර්මයන් (මාර්ග සත්‍යය) මනාව වඩනා ලද හෙයින් සම්මා සම්බුද්ධ නම් වන සේක.
ඒ මාගෙ භාග්‍යවත් බුදු රජාණන් වහන්සේ ඒකාන්තයෙන්ම සම්මා සම්බුද්ධ නම් වන සේක. ඒ සම්මා සම්බුද්ධ නමැති බුද්ධ ගුණයෙන් යුතු මාගේ බුදු පියාණන් වහන්සේ මම සිරසා වඳිමි.

අනන්ත බුදු රජාණන් වහන්සේලාගේ අනන්ත සම්මා සම්බුද්ධ බුදු ගුණයේ මහානුභාව බලයෙන් මා දිනෙන් දින නීරෝගි බවට පත් වේවා! නීරොගී බවට පත් වේවා! නීරෝගී බවට පත් වේවා! ප්‍රාතිහාර්යයක බලයක් සෙයින් මා නිදුක් වේවා! නීරෝගී වේවා! සුවපත් වේවා! කායික වේදනා දුරු වේවා! මානසික පීඩා දුරු වේවා! සැනසිල්ලම උදා වේවා! කාමච්ඡ්න්ද ආදී නීවරණයෝ මා කෙරෙන් බැහැර වේවා! මාගේ සිත සමාධි වේවා! මාගේ සිහි නුවණ දියුණු තියුණු වේවා! චතුරාර්ය සත්‍ය ධර්මය අවබෝධ වේවා!

අනන්ත බුදු රජාණන් වහන්සේලාගේ අනන්ත සම්මා සම්බුද්ධ බුදුගුණයේ මහානුභාව බලය, ශක්තිය, පිහිට, ආරක්ෂාව, මට නිරතුරුව ලැබේවා! ලැබේවා! ලැබේවා!>

<ඒ මාගේ භාග්‍යවත් බුදු රජාණන් වහන්සේ

ත්‍රි විද්‍යාවෙන් සමන්විත හෙයින් විජ්ජාචරණ සම්පන්න නම් වන සේක.
අෂ්ඨ විද්‍යාවෙන් සමන්විත හෙයින් විජ්ජාචරණ සම්පන්න නම් වන සේක.
පසළොස්චරණ ධර්මයන්ගෙන් සමන්විත හෙයින් විජ්ජාචරණ සම්පන්න නම් වන සේක.
ඒ මාගෙ භාග්‍යවත් බුදු රජාණන් වහන්සේ ඒකාන්තයෙන්ම විජ්ජාචරණ සම්පන්න නම් වන සේක. ඒ විජ්ජාචරණ සම්පන්න නැමැති බුද්ධ ගුණයෙන් යුතු මාගේ බුදු පියාණන් වහන්සේ මම සිරසා වඳිමි.

අනන්ත බුදු රජාණන් වහන්සේලාගේ අනන්ත විජ්ජාචරණ සම්පන්න බුදු ගුණයේ මහානුභාව බලයෙන් මා දිනෙන් දින නීරෝගි බවට පත් වේවා! නීරොගී බවට පත් වේවා! නීරෝගී බවට පත් වේවා! ප්‍රාතිහාර්යයක බලයක් සෙයින් මා නිදුක් වේවා! නීරෝගී වේවා! සුවපත් වේවා! කායික වේදනා දුරු වේවා! මානසික පීඩා දුරු වේවා! සැනසිල්ලම උදා වේවා! කාමච්ඡ්න්ද ආදී නීවරණයෝ මා කෙරෙන් බැහැර වේවා! මාගේ සිත සමාධි වේවා! මාගේ සිහි නුවණ දියුණු තියුණු වේවා! චතුරාර්ය සත්‍ය ධර්මය අවබෝධ වේවා!

අනන්ත බුදු රජාණන් වහන්සේලාගේ අනන්ත විජ්ජාචරණ සම්පන්න බුදුගුණයේ මහානුභාව බලය, ශක්තිය, පිහිට, ආරක්ෂාව, මට නිරතුරුව ලැබේවා! ලැබේවා! ලැබේවා!>

<ඒ මාගේ භාග්‍යවත් බුදු රජාණන් වහන්සේ

ශෝභන රූප කාය සම්පත්තියක් ඇති හෙයින් සුගත නම් වන සේක.
සුන්දර වචන විලාශයක් ඇති හෙයින් සුගත නම් වන සේක.
ශෝභන වූ ගමන් විලාශයක් ඇති හෙයින් සුගත නම් වන සේක.
සුන්දර වූ නිවන් මගට පිවිසි හෙයින් සුගත නම් වන සේක.
ඒ මාගෙ භාග්‍යවත් බුදු රජාණන් වහන්සේ ඒකාන්තයෙන්ම සුගත නම් වන සේක. ඒ සුගත නැමැති බුද්ධ ගුණයෙන් යුතු මාගේ බුදු පියාණන් වහන්සේ මම සිරසා වඳිමි.

අනන්ත බුදු රජාණන් වහන්සේලාගේ අනන්ත සුගත බුදු ගුණයේ මහානුභාව බලයෙන් මා දිනෙන් දින නීරෝගි බවට පත් වේවා! නීරොගී බවට පත් වේවා! නීරෝගී බවට පත් වේවා! ප්‍රාතිහාර්යයක බලයක් සෙයින් මා නිදුක් වේවා! නීරෝගී වේවා! සුවපත් වේවා! කායික වේදනා දුරු වේවා! මානසික පීඩා දුරු වේවා! සැනසිල්ලම උදා වේවා! කාමච්ඡ්න්ද ආදී නීවරණයෝ මා කෙරෙන් බැහැර වේවා! මාගේ සිත සමාධි වේවා! මාගේ සිහි නුවණ දියුණු තියුණු වේවා! චතුරාර්ය සත්‍ය ධර්මය අවබෝධ වේවා!

අනන්ත බුදු රජාණන් වහන්සේලාගේ අනන්ත සුගත බුදුගුණයේ මහානුභාව බලය, ශක්තිය, පිහිට, ආරක්ෂාව, මට නිරතුරුව ලැබේවා! ලැබේවා! ලැබේවා!>

<ඒ මාගේ භාග්‍යවත් බුදු රජාණන් වහන්සේ

සත්ව ලෝකය : දුක්ඛ, සමුදය, නිරෝධ, මාර්ග සත්‍ය වශයෙන් දත් හෙයින් ලෝකවිදූ නම් වන සේක.
අවකාශ ලෝකය: දුක්ඛ, සමුදය, නිරෝධ, මාර්ග සත්‍ය වශයෙන් දත් හෙයින් ලෝකවිදූ නම් වන සේක.
සංස්කාර ලෝකය: දුක්ඛ, සමුදය, නිරෝධ, මාර්ග සත්‍ය වශයෙන් දත් හෙයින් ලෝකවිදූ නම් වන සේක.
භාග්‍යවතුන් වහන්සේ සර්වාකාරයෙන් දක්නා ලද ලෝක ඇති හෙයින් ලෝකවිදූ නම් වන සේක
ඒ මාගෙ භාග්‍යවත් බුදු රජාණන් වහන්සේ ඒකාන්තයෙන්ම ලෝකවිදූ නම් වන සේක. ඒ ලෝකවිදූ නැමැති බුද්ධ ගුණයෙන් යුතු මාගේ බුදු පියාණන් වහන්සේ මම සිරසා වඳිමි.

අනන්ත බුදු රජාණන් වහන්සේලාගේ අනන්ත ලෝකවිදූ බුදු ගුණයේ මහානුභාව බලයෙන් මා දිනෙන් දින නීරෝගි බවට පත් වේවා! නීරොගී බවට පත් වේවා! නීරෝගී බවට පත් වේවා! ප්‍රාතිහාර්යයක බලයක් සෙයින් මා නිදුක් වේවා! නීරෝගී වේවා! සුවපත් වේවා! කායික වේදනා දුරු වේවා! මානසික පීඩා දුරු වේවා! සැනසිල්ලම උදා වේවා! කාමච්ඡ්න්ද ආදී නීවරණයෝ මා කෙරෙන් බැහැර වේවා! මාගේ සිත සමාධි වේවා! මාගේ සිහි නුවණ දියුණු තියුණු වේවා! චතුරාර්ය සත්‍ය ධර්මය අවබෝධ වේවා!

අනන්ත බුදු රජාණන් වහන්සේලාගේ අනන්ත ලෝකවිදූ බුදුගුණයේ මහානුභාව බලය, ශක්තිය, පිහිට, ආරක්ෂාව, මට නිරතුරුව ලැබේවා! ලැබේවා! ලැබේවා!>

<ඒ මාගේ භාග්‍යවත් බුදු රජාණන් වහන්සේ

දමනය කටයුතු තිරිසන් සතුන් දමනය කළ බැවින් අනුත්තර පුරිස දම්ම සාරථි නම් වන සේක.
දමනය කටයුතු මනුෂ්‍යයන් දමනය කළ බැවින් අනුත්තර පුරිස දම්ම සාරථි නම් වන සේක.
දමනය කටයුතු අමනුෂ්‍යයන් දමනය කළ බැවින් අනුත්තර පුරිස දම්ම සාරථි නම් වන සේක.
ඒ මාගෙ භාග්‍යවත් බුදු රජාණන් වහන්සේ ඒකාන්තයෙන්ම අනුත්තර පුරිස දම්ම සාරථි නම් වන සේක. ඒ අනුත්තර පුරිස දම්ම සාරථි නැමැති බුද්ධ ගුණයෙන් යුතු මාගේ බුදු පියාණන් වහන්සේ මම සිරසා වඳිමි.

අනන්ත බුදු රජාණන් වහන්සේලාගේ අනන්ත අනුත්තර පුරිස දම්ම සාරථි බුදු ගුණයේ මහානුභාව බලයෙන් මා දිනෙන් දින නීරෝගි බවට පත් වේවා! නීරොගී බවට පත් වේවා! නීරෝගී බවට පත් වේවා! ප්‍රාතිහාර්යයක බලයක් සෙයින් මා නිදුක් වේවා! නීරෝගී වේවා! සුවපත් වේවා! කායික වේදනා දුරු වේවා! මානසික පීඩා දුරු වේවා! සැනසිල්ලම උදා වේවා! කාමච්ඡ්න්ද ආදී නීවරණයෝ මා කෙරෙන් බැහැර වේවා! මාගේ සිත සමාධි වේවා! මාගේ සිහි නුවණ දියුණු තියුණු වේවා! චතුරාර්ය සත්‍ය ධර්මය අවබෝධ වේවා!

අනන්ත බුදු රජාණන් වහන්සේලාගේ අනන්ත අනුත්තර පුරිස දම්ම සාරථි බුදුගුණයේ මහානුභාව බලය, ශක්තිය, පිහිට, ආරක්ෂාව, මට නිරතුරුව ලැබේවා! ලැබේවා! ලැබේවා!>

<ඒ මාගේ භාග්‍යවත් බුදු රජාණන් වහන්සේ

මෙලෝ අර්ථයෙන් දෙව් මිනිසුන්ට අනුශාසනා කළ හෙයින් සත්ථා දේවමනුස්සානං නම් වන සේක.
පරලෝ අර්ථයෙන් දෙව් මිනිසුන්ට අනුශාසනා කළ හෙයින් සත්ථා දේවමනුස්සානං නම් වන සේක.
පරමාර්ථයෙන් දෙව් මිනිසුන්ට අනුශාසනා කළ හෙයින් සත්ථා දේවමනුස්සානං නම් වන සේක.
ඒ මාගෙ භාග්‍යවත් බුදු රජාණන් වහන්සේ ඒකාන්තයෙන්ම සත්ථා දේවමනුස්සානං නම් වන සේක. ඒ සත්ථා දේවමනුස්සානං නැමැති බුද්ධ ගුණයෙන් යුතු මාගේ බුදු පියාණන් වහන්සේ මම සිරසා වඳිමි.

අනන්ත බුදු රජාණන් වහන්සේලාගේ අනන්ත සත්ථා දේවමනුස්සානං බුදු ගුණයේ මහානුභාව බලයෙන් මා දිනෙන් දින නීරෝගි බවට පත් වේවා! නීරොගී බවට පත් වේවා! නීරෝගී බවට පත් වේවා! ප්‍රාතිහාර්යයක බලයක් සෙයින් මා නිදුක් වේවා! නීරෝගී වේවා! සුවපත් වේවා! කායික වේදනා දුරු වේවා! මානසික පීඩා දුරු වේවා! සැනසිල්ලම උදා වේවා! කාමච්ඡ්න්ද ආදී නීවරණයෝ මා කෙරෙන් බැහැර වේවා! මාගේ සිත සමාධි වේවා! මාගේ සිහි නුවණ දියුණු තියුණු වේවා! චතුරාර්ය සත්‍ය ධර්මය අවබෝධ වේවා!

අනන්ත බුදු රජාණන් වහන්සේලාගේ අනන්ත සත්ථා දේවමනුස්සානං බුදුගුණයේ මහානුභාව බලය, ශක්තිය, පිහිට, ආරක්ෂාව, මට නිරතුරුව ලැබේවා! ලැබේවා! ලැබේවා!>

<ඒ මාගේ භාග්‍යවත් බුදු රජාණන් වහන්සේ

දුක්ඛ සත්‍යය අවබෝධ කළ හෙයින් බුද්ධ නම් වන සේක.
සමුදය සත්‍යය සත්‍යය අවබෝධ කළ හෙයින් බුද්ධ නම් වන සේක.
නිරෝධ සත්‍යය අවබෝධ කළ හෙයින් බුද්ධ නම් වන සේක.
මාර්ග සත්‍යය අවබෝධ කළ හෙයින් බුද්ධ නම් වන සේක.
චතුරර්ය සත්‍ය ධර්මයන් තමන් වහන්සේ විසින්ම අවබෝධ කරගෙන අන්‍යයන්ටද අවබෝධ කළ හෙයින් බුද්ධ නම් වන සේක.
ඒ මාගෙ භාග්‍යවත් බුදු රජාණන් වහන්සේ ඒකාන්තයෙන්ම බුද්ධ නම් වන සේක. ඒ බුද්ධ නැමැති බුද්ධ ගුණයෙන් යුතු මාගේ බුදු පියාණන් වහන්සේ මම සිරසා වඳිමි.

අනන්ත බුදු රජාණන් වහන්සේලාගේ අනන්ත බුද්ධ බුදු ගුණයේ මහානුභාව බලයෙන් මා දිනෙන් දින නීරෝගි බවට පත් වේවා! නීරොගී බවට පත් වේවා! නීරෝගී බවට පත් වේවා! ප්‍රාතිහාර්යයක බලයක් සෙයින් මා නිදුක් වේවා! නීරෝගී වේවා! සුවපත් වේවා! කායික වේදනා දුරු වේවා! මානසික පීඩා දුරු වේවා! සැනසිල්ලම උදා වේවා! කාමච්ඡ්න්ද ආදී නීවරණයෝ මා කෙරෙන් බැහැර වේවා! මාගේ සිත සමාධි වේවා! මාගේ සිහි නුවණ දියුණු තියුණු වේවා! චතුරාර්ය සත්‍ය ධර්මය අවබෝධ වේවා!

අනන්ත බුදු රජාණන් වහන්සේලාගේ අනන්ත බුද්ධ බුදුගුණයේ මහානුභාව බලය, ශක්තිය, පිහිට, ආරක්ෂාව, මට නිරතුරුව ලැබේවා! ලැබේවා! ලැබේවා!>

<ඒ මාගේ භාග්‍යවත් බුදු රජාණන් වහන්සේ

යස මහත්වයෙන් සමන්විත හෙයින් භගවා නම් වන සේක.
පුණ්‍ය මහත්වයෙන් සමන්විත හෙයින් භගවා නම් වන සේක.
ඍධි මහත්වයෙන් සමන්විත හෙයින් භගවා නම් වන සේක.
ථාම මහත්වයෙන් සමන්විත හෙයින් භගවා නම් වන සේක.
ප්‍රඥා මහත්වයෙන් සමන්විත හෙයින් භගවා නම් වන සේක.
රාගය නැසූ හෙයින් භගවා නම් වන සේක.
ද්වේෂය නැසූ හෙයින් භගවා නම් වන සේක.
මෝහය නැසූ හෙයින් භගවා නම් වන සේක.
අතිශය විෂ්මිත වූ පුණ්‍ය මහිමයෙන් ප්‍රභාෂ්වර වූ හෙයින් භගවා නම් වන සේක.
ඒ මාගෙ භාග්‍යවත් බුදු රජාණන් වහන්සේ ඒකාන්තයෙන්ම භගවා නම් වන සේක. ඒ භගවා නැමැති බුද්ධ ගුණයෙන් යුතු මාගේ බුදු පියාණන් වහන්සේ මම සිරසා වඳිමි.

අනන්ත බුදු රජාණන් වහන්සේලාගේ අනන්ත භගවා බුදු ගුණයේ මහානුභාව බලයෙන් ද, අනන්ත බුදු රජාණන් වහන්සේලාගේ අනන්ත නව අරහාදී බුදු ගුණයේ මහානුභාව බලයෙන් ද මා දිනෙන් දින නීරෝගි බවට පත් වේවා! නීරෝගී බවට පත් වේවා! නීරෝගී බවට පත් වේවා! ප්‍රාතිහාර්යයක බලයක් සෙයින් මා නිදුක් වේවා! නීරෝගී වේවා! සුවපත් වේවා! කායික වේදනා දුරු වේවා! මානසික පීඩා දුරු වේවා! සැනසිල්ලම උදා වේවා! කාමච්ඡ්න්ද ආදී නීවරණයෝ මා කෙරෙන් බැහැර වේවා! මාගේ සිත සමාධි වේවා! මාගේ සිහි නුවණ දියුණු තියුණු වේවා! චතුරාර්ය සත්‍ය ධර්මය අවබෝධ වේවා!

අනන්ත බුදු රජාණන් වහන්සේලාගේ අනන්ත භගවා බුදුගුණයේ මහානුභාව බලය, ශක්තිය, පිහිට, ආරක්ෂාවද, අනන්ත බුදු රජාණන් වහන්සේලාගේ අනන්ත නව අරහාදී බුදු ගුණයේ මහානුභාව බලය, ශක්තිය, පිහිට ආරක්ෂාවද, මට නිරතුරුව ලැබේවා! ලැබේවා! ලැබේවා!>
`;

export default Budhu_Guna_Piritha_Sinhala;
