const Chanda_Piritha_Sinhala = `
<මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර ජේතවන නම් වූ අනේ පිඬු මහසිටුහු ගේ ආරමයෙහි වඩ වසන සේක. එසමයෙහි වනාහි සඳ දෙව්පුත් තෙමේ රාහු අසුරේන්ද්‍රයා විසින් ගන්නා ලද්දේ වෙයි ඉක්බිති සඳ දෙව්පුත් තෙමේ එවෙලෙහි බුදුරජුන් සිහි කරමින් මේ ගාථාව කීය.>

<බුද්ධ වීරයන්වහන්ස, (ඔබ වහන්සේ) සියලු කල්හි කෙලෙසුන් කෙරෙන් විශේෂයෙන් මිදුණු සේක. එසේවූ ඔබ වහන්සේට නමස්කාර වේවා. මම සම්බාධයකට පැමිණියෙමි. ඒ මට පිළිසරණ වුවමැනව.>

<එකල්හි භාග්‍යවතුන් වහන්සේ, සඳ දෙව් පුතුන් අරභයා රාහු අසරිඳු හට ගාථාවකින් මෙසේ වදාළ සේක.>

<රාහු අසුරේන්ද්‍රයා සඳදෙව් පුත් තෙමේ අර්හත්වූ තථාගතයන් වහන්සේ සරණ ගියේය. බුදුවරයෝ ලොවට අනුකම්පා කරන්නෝ ය. (එහෙයින්) සඳු අත්හැරවයි වදාළ සේක.>

<ඉක්බිති රාහු අසුරේන්ද්‍ර තෙමේ සඳු දෙව්පුත් හැර වෙළෙවිවූයේ වේපවිත්ති අසුරේන්ද්‍රයා යම් තැනෙක්හිද, එතැන්හි එළඹියේ ය. එළඹ සංවේග ඇත්තේ ලොමුදැහැගත් සිරුරු ඇත්තේ එකත් පසෙක සිටියේ ය. එකත් පස්ව සිටියා වූ රාහු අසුරිඳු හට වේපචිත්ති නම් අසුරේන්ද්‍ර තෙම ගාථාවකින් මෙසේ කීයේ ය.>

<රාහු අසුරේන්ද්‍රය වෙලෙවි වූවකු මෙන් සඳු කුමක් පිණිස අත්හැරියෙහිද? කැළැඹුණු සිත් ඇත්තෙක්වැ අවුත් බියවූවකු මෙන් කුමක් හෙයින් සිටිනෙහි ද? යනුයි.>

<බුදුන් විසින් ගාථා දෙකකින් ගයන ලද්දක් ඇසුවෙමි.  ඉදින් සදු නොහැරියේ නම් මගේ හිස සත්කඩක්ව පැළෙයි. ජීවත්වන්නේ ද, සැපයක් නො ලබයි>
`;

export default Chanda_Piritha_Sinhala;
