const Dajagga_Piritha_Sinhala = `
<මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවත් බුදුරජාණන් වහන්සේ සැවැත් නුවර ජේතවන නම් වූ අනේපිඬු සිටුතුමා ගේ ආරාමයෙහි වැඩ වසන සේක. එකල්හී භාග්‍යවතුන් වහන්සේ මහණෙනි, භික්ෂුන් ඇමතූ සේක. ඒ භික්ෂූහු ස්වාමිනි’යි භාග්‍යවතුන් වහන්සේට පිළිවදන් දුන්හ. භාග්‍යවතුන් වහන්සේ මේ කරුණ වදාළසේක.>

<මහණෙනි, පෙර වූ දෙයක් කියමි. දෙවියන් හා අසුරයන් අතර සංග්‍රාමයක් එළඹුනේ විය. මහණෙනි, ඉක්බිති සක්දෙව්රජ තෙම තව්තිසා වැසි දෙවියන් ඇමතී ය.>

<නිදුකාණෙනි, යුද්ධයට ගිය දෙවියන්ට බියක් හෝ තැතිගන්මක් හෝ ලොමුදැහැගැන්මෙක් හෝ ඉදින් උපන්නේ නම්, එසමයෙහි මගේ ම ධ්‍වජාග්‍රය බලව්. මගේ වනාහි ධ්‍වජාග්‍රය බලන්නා වූ තොපට යම් බියෙක් හෝ තැතිගැන්මෙක් හෝ ලොමුදැහැගැන්මෙක් හෝ වේද, හෙතෙම දුරු වෙයි.>

<මාගේ ධ්‍වජාග්‍රය ඉදින් නොබලා නම් ඉක්බිති ප්‍රජාපති දෙව්‍ රජහු ගේ ධ්‍වජාග්‍රය බලව. ප්‍රජාපති නම් දෙව්රජහු ගේ ධ්‍වජාග්‍රය බලන්නා වූ තොපට යම් බියක් හෝ, තැතිගැනීමක් හෝ, ලොමුදැහැගැන්මක් හෝ වේ ද, හේ දුරුවෙයි.>

<ප්‍රජාපති දෙව් රජුගේ ධ්‍වජාග්‍රය ඉදින් නොබලා නම් ඉක්බිති වරුණ දෙව්‍ රජහු ගේ ධ්‍වජාග්‍රය බලව. වරුණ නම් දෙව්රජහු ගේ ධ්‍වජාග්‍රය බලන්නා වූ තොපට යම් බියක් හෝ, තැතිගැනීමක් හෝ, ලොමුදැහැගැන්මක් හෝ වේ ද, හේ දුරුවෙයි.>

<වරුණ දෙව් රජුගේ ධ්‍වජාග්‍රය ඉදින් නොබලා නම් ඉක්බිති ඊසාන දෙව්‍ රජහු ගේ ධ්‍වජාග්‍රය බලව. ඊසාන නම් දෙව්රජහු ගේ ධ්‍වජාග්‍රය බලන්නා වූ තොපට යම් බියක් හෝ, තැතිගැනීමක් හෝ, ලොමුදැහැගැන්මක් හෝ වේ ද, හේ දුරුවෙයි.>

<මහණෙනි, සක්දෙව් රජහු ගේ හෝ ඒ ධ්වජාග්‍රය බලන්නහුට, ප්‍රජාපති දෙව් රජහු ගේ හෝ ධ්වජාග්‍රය  බලන්නහුට, ඊසාන නම් දෙව් රජහු ගේ ධ්වජාග්‍රය බලන්නහුට යම් බියක් හෝ, තැතිගැන්මේක් හෝ, ලොමුදැහැගැන්මෙක් හෝ වේද? දුරු නොවන්නේ හෝ වෙයි, එයට හේතු කවරේද යත්?>

<මහණෙනි සක්දෙව් රජතෙම වනාහි, දුරු නොකළ රාග ඇත්තේ ය, දුරු නොකළ ද්වේෂ ඇත්තේය, දුරු නොකළ මෝහ ඇත්තේ ය. බියවන සුලු ය, තැති ගන්නා සුලු ය, අතිශයින්ම බිය වන සුලුය, පලා යනු සුලු ය.>

<මහණෙනි මම ද, නුඹලාට මෙසේ කියමි. මහණෙනි ඉදින් වනයට ගියා වූ රුක්මුලට ගියා වූ හෝ, ගෙවලින් හිස් තැනකට ගියා වූ හෝ නුඹලාට බියෙක් හෝ, තැතිගැන්මක් හෝ, ලොමුදැහැ ගැන්මෙක් හෝ, උපදනේ වී නම්, එසමයහි මා ම සිහි කරව (කෙසේද?).>

<ඒ භාග්‍යවතුන් වහන්සේ මේ කරුණෙනුදු; අර්හත් ය, සම්‍යක් සම්බුද්ධ ය, විද්‍යාචරණ ධර්මයන් ගෙන් යුක්තය, සුගත ය, ලෝකවිදු ය, අනුත්‍තර ය, පුරිස ධම්ම සාරථී ය, දෙව් මිනිසුන්ට අනුශාසක ය, බුද්ධ ය, භාග්‍යවත්‍ ය, කියායි.>

<මහණෙනි, මා සිහිකරන්නා වූ ඔබට ද යම් බියෙක් හෝ තැතිගැන්මෙක් නෝ ලොමුදැහැගැන්මෙක් හෝ වේද, හේ දුරුවේ. ඉදින් මා සිහි නොකරව නම් ධර්මය සිහි කරව. බුදුරජුන් විසින් මොනවට දෙසන ලද ධර්මය තෙම සාන්දෘෂ්ටික ය, අකාලිකය, එව බලව යන විදියට සුදුසු ය, එළඹීමට සුදුසු ය, තම තමන් කෙරෙහි ලා නුවණැත්තන් විසින් දත යුත්තේය.  මහණෙනි ධර්මය සිහි කරන්නා වූ ඔබට යම් බියෙක් හෝ, තැතිගැන්මක් හෝ, ලොමුදැහැ ගැන්මෙක් හෝ වේද, හේ පහවෙයි.>

<ඉදින් ධර්මය සිහි නොකරන්නාහු නම්, ඉක්බිති සඟුන් සිහි කරව. (කෙසේද?)>

<භාග්‍යවතුන් වහන්සේ ගේ ශ්‍රාවක සංඝතෙමේ මනාව පිළිපන්නේ ය, භාග්‍යවතුන් වහන්සේ ගේ ශ්‍රාවක සංඝතෙමේ ඍජුවූ පිළිවෙතින් යුක්තය, භාග්‍යවතුන් වහන්සේ ගේ ශ්‍රාවක සංඝතෙමේ නිවන් සඳහා පිළිපන්නේ ය, භාග්‍යවතුන් වහන්සේ ගේ ශ්‍රාවක සංඝතෙමේ ත්‍රිශික්ෂාවෙහි ගරු කිරිමට සුදුසු පිළිවෙත්හි පිළිපන්නේ ය. යම් මේ, පුරුෂ යුගල වශයෙන් සතර කොටසක් වෙත් ද? පුරුෂ පුද්ගල වශයෙන් අට දෙනෙක් වෙත් ද? භාග්‍යවතුන් වහන්සේ ගේ මේ ශ්‍රාවක සංඝ තෙමේ දුරිනිදු ගෙන හැර දිය යුතු  ප්‍රත්‍යයට සුදුසු ය. අමුතු ප්‍රත්‍යයන් පිළිගැනීමට සුදුසු ය. දක්ෂිණාවට සුදුසු ය. දොහොත් මුදුන් දී වැඳීමට සුදුසු ය. සියලු ලෝකයාට උතුම් වූ පින් කෙතකැයි කියා යි.>

<මහණෙනි සංඝයා සිහි කරන ඔබට යම් බියෙක් හෝ තැතිගැන්මෙක් නෝ ලොමුදැහැගැන්මෙක් හෝ වේද, හේ දුරුවේයි. එයට කාරණා කිම යත්?>

<මහණෙනි, අරහත් වූ සම්‍යක් සම්බුද්ධ වූ තථාගත තෙම, නසන ලද රාග ඇත්තේය, නසන ලද ද්වේෂ ඇත්තේය, නසන ලද මෝහ ඇත්තේ ය, බිය නොවන සුලුය, තැති නොගන්නා සුලුය, ත්‍රාස නොවන සුලුය, බියෙන් පලා නොයන්නේ ය.>

<භාග්‍යවත් තෙම මේ ධජග්ග පරිත්තය වදාළේ ය. සුගත වූ ශාස්තෘන් වහන්සේ මෙය වදාරා නැවත අන්‍ය වූ මේ කාරණය වදාළ සේක.>

<මහණෙනි, අරණ්‍යයෙහි හෝ, රුක්මුල්හි හෝ, ජනශූන්‍ය ස්ථානයක හෝ සම්බුදුන් සිහි කරව, ඔබට බියක් නොවන්නේ යි.>

<ලොවට ජ්‍යෙෂ්ඨ වූ, නරෝත්තම වූ, බුදුරදුන් ඉදින් සිහි නොකරව් නම්, ඉක්බිති නෛර්‍යානික වූ, මනාකොට දෙසන ලද ධර්මය සිහි කරව.>

<නෛර්‍යානික වූ, මනාකොට දෙසන ලද ධර්මය සිහි නොකරව් ද, ඉක්බිති පින් කෙතක් වූ, අනුත්තර වූ සංඝයා සිහි කරව.>

<මහණෙනි, බුදුන් ද, ධර්මය ද, සංඝයා ද, මෙසේ සිහි කරන්නවුනට, බියෙක් හෝ, තැතිගැන්මෙක් හෝ, ලොමුදැහැගැන්මෙක් හෝ, නොවේ.

සාධූ! සාධූ! සාධූ!>
`;

export default Dajagga_Piritha_Sinhala;
