const Jaya_Piritha_Sinhala = `
<සෞභාග්‍යෙන් ද, ධෛර්යයෙන් ද, නුවනින් හා තේජසින් ද, උප ලක්ෂිත මහා සෘද්ධිමත් වූ, මහා ගුණයෙන් හා අප්‍රමාණ වූ, පුඤ්ඤමහිමයෙන් යුක්ත වූ, අනතුරු වැළැක්මෙහි සමත් වූ,  භාග්‍යවත් අරහත් සම්බුදු රජාණන් වහන්සේගේ..>

<දෙතිස් මහා පුරුෂලක්ඛණානුභාවයෙන් ද, අසූවක් අනුකුඩා ලකුණුවල ආනුභාවයෙන් ද, සවනක් රැස් ආනුභාවයෙන් ද, කේතුමාලානුභාවයෙන් ද, දසපාරමිතානුභාවයෙන් ද, දසඋපපාරමතානුභාවයෙන් ද, දසපරමත්ථපාරමිතානුභාවයෙන් ද, සීල සමාධි ප්‍රඤ්ඤා යන ත්‍රිවිධ ශික්ෂාවන්ගේ ආනුභාවයෙන් ද, බුද්ධ ධම්ම සංඝ යන තෙරුවන්ගේ ආනුභාවයෙන් ද, තේජසින් සෘද්ධියෙන් බලයෙන් දතයුතු දේ දැන වදාරණ ලද්දා වූ, ආනුභාවයෙන් ද, අසූහාරදහසක් ධර්මස්කන්ධයේ ආනුභාවයෙන් ද, නව ලොවුතුරු දහමේ ආනුභාවයෙන් ද, ආර්‍යඅෂ්ධාන්ගික මාර්ගයේ ආනුභාවයෙන් ද, අෂ්ධසමාපත්‍යාණුභාවයෙන් ද, සය අභිඤ්ඤාවන්ගේ ආනුභාවයෙන් ද, මෙත්තා කරුණා මුදිතා උපෙක්ෂා යන සිවු බඹ විහරණයන්ගේ ආනුභාවයෙන් ද, සියළු පාරමිතාවන්ගේ ආනුභාවයෙන් ද, තෙරුවන්ගේ ආනුභාවයෙන් ද, මාගේ සියළු රෝග ශෝක දුරුවේවා. කරදර දුක් දොම්නස් සිත් වේදනා වැනසේවා. මාගේ සියළු කල්පනාවන් ඉටුවේවා. සියක් වසක් කල් ජීවත් වීමට ශක්තිය ලැබේවා.>

<සියළු කල්හි, අහස, පර්වථ, වණ බිම්, තටාක, ගංගා හා මහසයුර, අරක්ගත් දෙවියෝ මගේ රැකවරණය සලසත්වා. සියළු බුදුවරුන්ගේ, සියළු ධර්මයේ, සියළු සංඝයාගේ ආනුභාවයෙන්, බුද්ධ ධම්ම හා සංඝ යන තෙරුවන්ගේ ආනුභාවයෙන්, අසූහාරදහසක් ධර්මස්කන්ධයේ ආනුභාවයෙන්, ත්‍රිපිටකයේ ආනුභාවයෙන්, බුද්ධස්‍රාවකයානණ් වහන්සේලාගේ ආනුභාවයෙන්, මාගේ සියළු රෝග, සියළු භය, සියළු අනතුරු, සියළු කරදර, සියළු අශුභ නිවිති, සියළු සිත් නොපිනවන දේ වැනසේවා, දුරුවේවා.>

<සියළු කළ්හි, ආයුෂෙන්, ධනයෙන්, යසසෙන්, බලයෙන් ද, වර්ණයෙන් හා සැපයෙන් වර්ධනය වේවා.>

<දුක් රෝග භය වෛර ශෝක ද, කරදර සමනය වේවා. නොයෙක් අනතුරු අන්තරාවන් ඒ තේජසෙන් විනාස වෙත්වා. ජයසිද්ධියද, ධන ලාභයද, සුව සම්පත, වාසනාවද, සැප බල හා ආයුෂ ද, වර්ණ සම්පත ද, භෝගයන් ගේ වර්ණයද, කීර්තිය ද, සිය වසකට අධික කාලයක් ආයු වැඩීමද, දේව සිද්ධියද, මා හට ලැබේවා. සියළු උවදුරු දුරු කෙරේවා. නසා රෝ දුක් බියකරු, නොවේවා අනතුරක් කිසිදා, දිනේවා ආයුෂ දිගු.>
`;

export default Jaya_Piritha_Sinhala;
