const Jaya_Piritha_Sinhala = `
මහා කරුණිකයාන වූ නාථයාණන් වහන්සේ
සියලු ජීවීන්ගේ හිතය වෙනුවෙන්
සියලු පරමිතා සම්පූර්ණ කර
ශ්‍රේෂ්ඨ සම්මා සම්බුද්ධ තත්වය ලබාගත් සේක.

මෙම සත්‍ය වචනයෙන්
ඔබට ජය මංගල්‍ය වේවා!

බෝධිගස් මූලයෙහි ජයග්‍රහණය කළ
ශාක්‍යවරුන්ගේ ප්‍රීතිය වර්ධනය කරන
මෙසේම ඔබත් ජයග්‍රහණය කරවා
ජය සහ ජයමංගල්‍යෙහි ජයග්‍රහණය කරවා!

ඉහළම අවයවයෙන් නමස්කාර කරමි
ශ්‍රේෂ්ඨම අපගේ පා දූලෙහිට
බුදුන් වහන්සේ තුළ ඇති දෝෂය
බුදුන් වහන්සේ විසින්ම පිළියම් කළ යුතුය

මෙම සත්‍ය වචනයෙන්
මට ජයමංගල්‍ය වේවා!
`;

export default Jaya_Piritha_Sinhala;
