const Kanda_Piritha_Sinhala = `
<මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවත් බුදුරජාණන් වහන්සේ සැවැත් නුවර ජේතවන නම් වූ අනේපිඬු සිටුතුමා ගේ ආරාමයෙහි වැඩ වසන සේක. එසමයෙහි සැවැත් නුවර එක්තරා භික්ෂු නමෙක් සර්පයෙකු විසින් දෂ්ට කරන ලදුව කලුරිය කළේ ය.>

<එකල්හි, බොහෝ භික්ෂූන් වහන්සේලා භාග්‍යවතුන් වහන්සේ යම් තැනක ද, එතන්හි එළඹුනහු ය. එළඹ, භාග්‍යවතුන් වහන්සේට වැඳ, එකත් පසෙක හුන්නානු ය. එකත් පසෙක හුන්නා වූ ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට මේ පුවත දැන්වූහ.>

<ස්වාමීන් වහන්ස, මේ සැවැත් නුවර සමීපයෙහි එක්තරා භික්ෂූ නමෙක් සර්පයෙකු විසින් දෂ්ට කරන ලද්දේ, කළුරිය කළේ ය. මහණෙනි, ඒ භික්ෂූ තෙම සතර අභිරාජකුලය ඒකාන්තයෙන් මෙත් සිතින් නොපැතිර වී ය. මහණෙනි, ඉදින් වනාහි සතර අභිරාජ කුලයන් මෙත් සිතින් පැතිරවී නම් මහණෙනි ඒ භික්ෂු තෙම සර්පයා විසින් දෂ්ට කරන ලද්දේ නොම කලුරිය කරන්නේ ය.>

<සතර සහිරාජ කුලයෝ කවරහුදයත්? විරූපාක්ෂ නම් සර්ප රාජ කුලය, ඒරාපථ නම් සර්ප රාජ කුලය, ජබ්‍යා පුත්ත නම් සර්ප රාජ කුලය, කණ්හා ගොතමක නම් සර්ප රාජ කුලය, යන මේ සතරයි.>

<මහණෙනි, ඒ භික්ෂු තෙම, මේ සතර සර්ප කුලයන් ඒකාන්තයෙන් මෙත් සිතින් නොපැතිරවීය. මහණෙනි, ඉදින් වනාහි ඒ භික්ෂු තෙම මේ සතර සර්ප රාජ කුලයන් මෙත් සිතින් පැතිරවී නම්, මහණෙනි ඒ භික්ෂු තෙම සර්පයා විසින් දෂ්ට කරන ලද්දේ, නොම කලුරිය කරන් නේ ය.>

<මහණෙනි, මේ සතර සර්පරාජ කුලයන් මෙත් සිතින් පතුරු වන්නට අනුදනිමි (අවසර දෙමි). කුමක් හෙයින්ද? තමාගේ සංවරණය පිණිස තමහට ආරක්ෂාව පිණිස, තමාහට පිරිත් පිණිස, පවත්නා හෙයිනි.>

<භාග්‍යවතුන්  වහන්සේ මෙසේ වදාළ සේක. මෙසේ වදාරා සුගත නම් වූ ශ්‍රාස්තෘන් වහන්සේ නැවත ද මත්තෙහි මෙය වදාළ සේක.>

<මාගේ මෛත්‍රිය විරූපාක්ෂ නම් සර්ප කුලයන් සමග ය. මාගේ මෛත්‍රිය ඒරාපථ නම් සර්පරාජ කුලයන් සමග ය. මාගේ මෛත්‍රිය ජබ්‍යාපුත්ත නම් නාග කුලයන් සමග ය. මාගෙ මෛත්‍රිය කණ්හාගෝතමක නම් සර්ප කුලයන් සමග ය.>

<මාගේ මෛත්‍රිය පා නැති දීර්ඝ ජාතීන් සමග ය. මාගේ මෛත්‍රිය දෙපා ඇති මිනිස් ආදී (දිපාදිකයන්) සමග ය. මාගේ මෛත්‍රිය සිවුපා සතුන් සමග ය. මාගෙ මෛත්‍රිය බොහෝ පා ඇත්තවුන් සමග ය.>

<අපාදක සත්වයෙක් මා නො පෙළාවා, දෙපාදක සත්වයෙක් මා නො පෙළාවා, සිවුපා සත්වයෙක් මා නො පෙළාවා, බොහෝ පා ඇති සත්වයෙක් නො පෙළාවා.>

<සියලු සත්හු ද, සියලු ප්‍රාණීහු ද, හුදෙක් සියලු භූතයෝ ද, සැමදෙන යහපතක් ම දකිත්වා, කිසිවෙකුත් කරා දුකක් නො පැමිණේවා!>

<බුද්ධ ගුණය අපමණ ය. දහම් ගුණය අපමණ ය. සංඝ ගුණය අපමණ ය. සිරිසපයෝ හෙවත් දීර්ඝ ජාතී හු ප්‍රමාණවත්හ, එනම් සර්පයෝ ය, ගෝනුස්සෝ ය, සතපදිහු ය (පත්තෑ ආදී), මකුළුවෝ ය, සිකනල්ලු ය, මූසිකය හු (යන මේ වශයෙනි). මා විසින් ආරක්ෂා කරන ලද්දාහ, පිරිත් කරන ලද්දාහ, භූතයෝ, පහවෙත්වා. ඒ මම භග්‍යවතුන් වහන්සේට නමස්කාර කරමි. සත් බුදුවරයන්ට නමස්කාර කරමි.>

<සාධූ! සාධූ! සාධූ!>

<ඒතේන සච්චේන සුවත්ථි හෝතු!
මේ සත්‍යානුභාවයෙන් සැමට සෙත් වේවා!>
`;

export default Kanda_Piritha_Sinhala;
