const Maha_Kassapa_Thero_Bojjanga_Piritha_Sinhala = `
<1) Auto-Scroll    Speed - +
මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවත් බුදුරජාණන් වහන්සේ රජගහ නුවර ලේනුන්ට දන් දෙන කලන්දකනිවාප  වේළුවන නම්වූ මහා විහාරයෙහි වැඩවසන සේක. එසමයෙහි මහා කාශ්‍යප ස්ථවිර තෙම පීඩීත ව, දුකට පත් ව, දැඩි ගිලන්ව,  පිප්ඵලී ගුහාවෙහි වෙසෙයි.>

<2) ඉක්බිති භාග්‍යවතුන් වහන්සේ සවස් වෙලෙහි ඵල සමවතින් නැගිටියේ ආයුෂ්මත් මහා කාශ්‍යප ස්ථවිරයන් වහන්සේ යම් තැනක වෙසෙත්ද  එතැනට එළඹි සේක.  එළඹ, පැණවූ අස්නෙක වැඩහුන් සේක. වැඩහිඳ, භාග්‍යවතුන් වහන්සේ මහා කස්සපයන් වහන්සේ හට මෙය වදාළසේක.>

<3) කිමෙක්ද? කාශ්‍යප ඔබට ඉවසිය හැකිද? යැපිය හැකිද? දුක්ඛ වේදනාවෝ පිරිහෙත් ද? (දුක් වේදනා අඩු වේද?) කිම දියුණු නොවෙත්ද?(වැඩි නොවෙත්ද?) ප්‍රතික්‍රමණවසනාය පෙනේද? (ඒ දුක්ඛ වේදනාවන්ගේ කෙළවරක් පෙනේද?) වැඩීමක් නොපෙනේ දැයි වදාළ සේක.>

<4) ස්වාමීනි වහන්ස, මට ඉවසීමට නොහැකිය. ඉරියව් පවත්වන්නට නොහැකිය. මගේ දුක්ඛ වේදනාවෝ බලවත්හ. දියුණු වෙත්, ප්‍රතික්‍රමණය නොවෙත්, දුක්ඛ වේදනාවන් ගේ වැඩීම පෙනෙයි. අඩුවක් නොපෙනෙයි.>

<5) කාශ්‍යප, මේ සප්ත බොජ්ඣංගයෝ මා විසින් මොනවට ප්‍රකාශ කරන ලදහ, භාවිතා කරන ලදහ, නැවත නැවත පුරුදු කරන ලදහ. සත්‍යය ප්‍රතිවේධය පිණිස, මනා අවබෝධය පිණිස, නිවන් පිණිස පවතියි. ඒ කවර සප්ත බොධ්‍යංගයෝද යත්?>

<6) කාශ්‍යප, මේ සතිසම්බොධ්‍යන්ගය (නිවැරදි සිහිය) වනාහි මා විසින් මොනවට ප්‍රකාශ කරන ලද, භාවිතා කරන ලද, බහුල වශයෙන් පුරුදු කරන ලදහ. සත්‍යය ප්‍රතිවේධය පිණිස, මනා අවබෝධය පිණිස, නිවන් පිණිස, පවතියි.>

<7) කාශ්‍යප, ධම්මවිචය (දහම් කරුණු විමසීම) සම්බොධ්‍යංගය  වනාහි මා විසින් මොනවට ප්‍රකාශ කරන ලද, භාවිතා කරන ලද, බහුල වශයෙන් පුරුදු කරන ලදහ. සත්‍යය ප්‍රතිවේධය පිණිස, මනා අවබෝධය පිණිස, නිවන් පිණිස, පවතියි.>

<8) කාශ්‍යප, විරිය (වීර්යය) සම්බොධ්‍යංගය වනාහි මා විසින් මොනවට ප්‍රකාශ කරන ලද, භාවිතා කරන ලද, බහුල වශයෙන් පුරුදු කරන ලදහ. සත්‍යය ප්‍රතිවේධය පිණිස, මනා අවබෝධය පිණිස, නිවන් පිණිස, පවතියි>

<9) කාශ්‍යප, පීති (සතුට) සම්බොධ්‍යංගය වනාහි මා විසින් මොනවට ප්‍රකාශ කරන ලද, භාවිතා කරන ලද, බහුල වශයෙන් පුරුදු කරන ලදහ. සත්‍යය ප්‍රතිවේධය පිණිස, මනා අවබෝධය පිණිස, නිවන් පිණිස, පවතියි.>

<10) කාශ්‍යප, පස්සද්ධි (සත්‍යය පිළිබඳ විශ්වාසය) සම්බොධ්‍යංගය වනාහි මා විසින් මොනවට ප්‍රකාශ කරන ලද, භාවිතා කරන ලද, බහුල වශයෙන් පුරුදු කරන ලදහ. සත්‍යය ප්‍රතිවේධය පිණිස, මනා අවබෝධය පිණිස, නිවන් පිණිස, පවතියි.>

<11) කාශ්‍යප, සමාධි (සමධි) සම්බොධ්‍යංගය වනාහි මා විසින් මොනවට ප්‍රකාශ කරන ලද, භාවිතා කරන ලද, බහුල වශයෙන් පුරුදු කරන ලදහ. සත්‍යය ප්‍රතිවේධය පිණිස, මනා අවබෝධය පිණිස, නිවන් පිණිස, පවතියි.>

<12) කාශ්‍යප, උපේක්ඛා (සම) සම්බොධ්‍යංගය වනාහි මා විසින් මොනවට ප්‍රකාශ කරන ලද, භාවිතා කරන ලද, බහුල වශයෙන් පුරුදු කරන ලදහ. සත්‍යය ප්‍රතිවේධය පිණිස, මනා අවබෝධය පිණිස, නිවන් පිණිස, පවතියි.>

<13) කාශ්‍යප, මේ සප්ත බොජ්ඣංගයෝ මට නිවන් පිණිස, සම්බෝධ පිණිස, සත්‍ය ප්‍රතිවේධය පිණිස, මනා අවබෝධය පිණිස, පවතියි.>

<14) භාග්‍යවතුන් වහන්ස, බොධ්‍යංග ධර්මයෝ මැනව, සුගතයන් වහන්ස මැනව’යි කාශ්‍යප තෙරුන් දැන්වූහ.>

<15) භාග්‍යවතුන් වහන්ස මේ ධර්මය වදාළ සේක. එයට සතුටු වූ ආයුෂ්මත් මහා කාශ්‍යප ස්ථවිර තෙම භාග්‍යවතුන් වහන්සේගේ දේශනාව අසා සතුටු විය. මහා කාශ්‍යප ස්ථවිර තෙම ඒ ආබාධයෙන් නැගීසිටියේ ය. මහා කාශ්‍යප ස්ථවිරයන් වහන්සේගේ ආබාධය පහවී ගියේමය.>
`;

export default Maha_Kassapa_Thero_Bojjanga_Piritha_Sinhala;
