const Mora_Piritha_Sinhala = `
<ඇස් ඇති ඒකරාජ වූ, රන්වන් වූ, පොළොව බුබුළුවන්නා වූ, මේ හිරු තෙම නැගෙයි. එහෙයින් රන්වන් වූ පොළොව බුබුළුවන තා වඳිමි. තා විසින් අද රක්නා ලද මේ දවස සුවසේ වසමු.>

<යම් ක්ෂීණාශ්‍රව බ්‍රාහ්මණ කෙනෙක් සියළු ඤෙය ධර්මයන් දැන, සම්‍යක්සම්බෝධියට පැමිණිහෝ ද, ඔවුනට මාගේ නමස්කාරය වේවා. ඒ භාග්‍යවත්හුදු මා රකිත්වා. පෙර බුදුවරුනට නමස්කාරය වේවා. සතරමහ සතර ඵලයයි කියන ලද බෝධියට නමස්කාර වේවා. පඤ්ච විමුක්තියට නමස්කාර වේවා. ඒ මයුර තෙම මේ පිරිත ආරක්ෂා කොටගෙන අහර සෙවීමෙහි හැසිරෙයි.>

<ඇස් ඇති, ඒක රාජ වූ, රන්වන් වූ, පොළොව බබුළුවන්නා වූ මේ හිරු තෙම පහවෙයි. එහෙයින් රන්වන් වූ පොළොව බබුළුවන තා වඳිමි. තා විසින් අද රක්නා ලද අපි සුවසේ වසමු.>

<යම් ක්ෂීණාශ්‍රව බ්‍රාහ්මණ කෙනෙක් සියළු ඤෙය ධර්මයන් දැන, සම්‍යක්සම්බෝධියට පැමිණිහෝ ද, ඔවුනට මාගේ නමස්කාරය වේවා. ඒ භාග්‍යවත්හුදු මා රකිත්වා. පෙර බුදුවරුනට නමස්කාරය වේවා. සතරමහ සතර ඵලයයි කියන ලද බෝධියට නමස්කාර වේවා. පඤ්ච විමුක්තියට නමස්කාර වේවා. ඒ මයුර තෙම මේ පිරිත ආරක්ෂා කොටගෙන වාසය කළේ යි.>
`;

export default Mora_Piritha_Sinhala;
