const Suriya_Piritha_Sinhala = `
<මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවත් බුදුරජාණන් වහන්සේ සැවැත් නුවර ජේතවන නම් වූ අනේපිඬු සිටුතුමා ගේ ආරාමයෙහි වැඩ වසන සේක.>

<බුද්ධවීරයාණෙනි නුඹවහන්සේට නමස්කාර වේවා. හැම කල්හිම කෙලෙසුන් ගෙන් වෙසෙසින් මිදුණු සේක. සම්බධායකට පැමිණියෙමි. එසේ වූ මට පිළිසරණ වන මැනව.>

<ඉක්බිති භාග්‍යවතුන් වහන්සේ හිරු දෙවිපුත් අරබයා රාහු අසුරිඳු හට ගාථාවලින් වදාළ සේක.>

<රාහු අසුරේන්ද්‍රය හිරු දෙව්පුත් තෙමේ නිකෙලෙස් වූ තථාගතයන් වහන්සේ සරණ ගියේ ය. බුදුවරු ලොවට අනුකම්පා කෙරෙති. එහෙයින් හිරු මුදව.>

<යම් සූර්යයෙක් අන්ධකාරේ ගනඳුරු දුරු හැර පහන් කෙරේද, බබළන මඬුලු ඇත්තේද, මහතෙද ඇත්තේද, එම්බල රාහුව අහසෙහි හැසිරෙන හිරු නොගිලව මගේ පුත්‍ර වූ හිරු මුදවයි වදාළ සේක.>

<ඉක්බිති රාහු අසුරේන්ද්‍ර තෙමේ හිරු දෙව්පුත් හැර වෙළෙවිවූයේ වේපවිත්ති අසුරේන්ද්‍රයා යම් තැනෙක්හිද, එතැන්හි එළඹියේ ය. එළඹ සංවේග ඇත්තේ ලොමුදැහැගත් සිරුරු ඇත්තේ එකත් පසෙක සිටියේ ය. එකත් පස්ව සිටියා වූ රාහු අසුරිඳු හට වේපචිත්ති නම් අසුරේන්ද්‍ර තෙම ගාථාවකින් මෙසේ කීයේ ය.>

<රාහු අසුරේන්ද්‍රය වෙලෙවි වූයේ හිරු මුදාහැරියෙහි  කැළැඹුණු සිත් ඇත්තෙක්වැ අවුත් බියවූවකු මෙන් කුමක් හෙයින් සිටිනෙහි ද? යනුයි.>

<බුදුන් විසින් ගාථා දෙකකින් ගයන ලද්දක් ඇසුවෙමි.  ඉදින් හිරු නොහැරියේ නම් මගේ හිස සත්කඩක්ව පැළෙයි. ජීවත්වන්නේ ද, සැපයක් නො ලබමි.>
`;

export default Suriya_Piritha_Sinhala;
